{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38630098-teams", "header": "teams", "idea_text": "quando estamos no chat do teams,  não consigo responder aos meu colega como alguma pergunta direta a ele, fica tudo misturado, gostaria de saber se há possíbilidade de vocês incluirem um opção para eu responder para a própria pessoam que nem fazemos no whats app, responder pra mesma pessoa do grupo.", "author": "920519677", "created_at": "2019-09-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37526092-shorten-the-sharepoint-urls", "header": "Shorten the SharePoint URLs", "idea_text": "SharePoint URLs are particularly very long and annoying. It isn't convenient to email to someone or store the URLs somewhere. I know people who don't like to use SharePoint just because of the long URLs.", "author": "898190548", "created_at": "2019-05-01", "votes": 22, "reaction": [], "comments": [{"author": "920756155", "created_at": "2019-09-20", "text": "Not only shorten but also mask using something like tinyurl. The current link reveals all sorts of information that opens security holes if shared externally. Additionally, allow link defaults to be set and retained so that things like setting external links to not allow editing can be done once and only changed when needed. This has to be done manually for every shared file currently."}]}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38681419-office-account-should-be-login-automatically-for-t", "header": "Office account should be login automatically for the office applications (outlook,word, excel, etc.)", "idea_text": "We have on promises exchange and Active Directory.When I am opening outlook or any other office application, office account should be logged in automatically (SSO).I raised a case with Microfsoft and get to know that there is no way to do that as of now. So please add this feature into upcoming update.Support case No: 16606553Please feel free to reach me for more clarification on it.Mob: +966590538271", "author": "925030213", "created_at": "2019-09-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36703006-webinar-booking-via-outlook", "header": "Webinar booking via outlook", "idea_text": "Add an option to allow users to create a webinar event in outlook and have the option to allow only x amount of users can reserve seats. First come first serve. Ex. A training course offered on day 1 2 and 3 and each day only 10 users can book the training.", "author": "882400573", "created_at": "2019-01-31", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37084297-show-status-message-underneath-contact-like-skype", "header": "Show status message underneath contact like Skype", "idea_text": "Skype would display the status message underneath the user and this would be helpful when it included the location. We would like to see this in teams.", "author": "888336229", "created_at": "2019-03-12", "votes": 2, "reaction": [], "comments": [{"author": "248001748", "created_at": "2019-07-10", "text": "They already got this being worked on in this uservoice: "}]}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36104098-a-working-word-app-for-samsung-galaxy-s3", "header": "A working Word app for samsung galaxy S3", "idea_text": "My idea is for microsoft word app for samsung galaxy S3 tablet to open without crashing ever since the latest updat", "author": "872836885", "created_at": "2018-11-26", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38100199-enable-export-sharepoint-list-to-excel-on-a-mac", "header": "Enable Export SharePoint List to Excel on a Mac", "idea_text": "Hi, I have a large team of users using SharePoint lists on SharePoint Online. They are not able to add a connection in Excel on a Mac. This is blocking a lot of people. Please consider that large organisations use PC and MAC.", "author": "910218340", "created_at": "2019-07-08", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/35890621-vote-by-phone", "header": "VOTE BY PHONE", "idea_text": "An Election Program to enable Americans the ability to Cast their 1 and only Votethrough their Computer, Tablet or Phone.", "author": "865085314", "created_at": "2018-11-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37363105-export-archive-mailboxes-only", "header": "Export archive mailboxes only", "idea_text": "Please create an PowerShell Command that will allow us to export a users online archive only. As it is now (per support) the only way to export an archive mailbox is from Outlook. This isnt acceptable. Especially when users have 100+ GB mailboxes. ", "author": "894153691", "created_at": "2019-04-12", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37533508-quick-fix-wrongly-coded-latex-symbol", "header": "Quick fix: Wrongly coded latex symbol", "idea_text": "This should probably be easily fixed:\nUsing the latex-editor in word, the symbol \\subsetneq is wrongly coded as \\supsetneq (i.e. as genuine superset, instead of genuine subset)", "author": "898328335", "created_at": "2019-05-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37506322-restore-the-autocorrect-option-to-the-spellcheck-i", "header": "Restore the autocorrect option to the spellcheck in Office products", "idea_text": "Earlier versions of Office had this very useful feature which disappeared a couple of years ago. Great productivity tool for people who repeat typing errors. I used this feature all the time to encourage adoption among low skilled users and then it went away!  Please bring it back ", "author": "897806518", "created_at": "2019-04-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37643722-hi-can-you-add-a-feature-to-find-the-number-of-int", "header": "Hi can you add a feature to find the number of internal users who opened a mail (phishing/ spam) from any user?", "idea_text": "Im missing the feature in office to find the number of people who have opened email from any external or internal users", "author": "900350812", "created_at": "2019-05-14", "votes": 3, "reaction": [], "comments": [{"author": "248001748", "created_at": "2019-07-10", "text": "Are you using ATP licenses? you could have all those reports if you do: "}]}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37034488-powershell-command-to-show-what-transport-rules-ar", "header": "Powershell command to show what transport rules are on a user's account.", "idea_text": "I'd like a powershell command that will show what transport rules are on a user's account. This is currently not an option. We have numerous user email groups that have numerous transport rules on their accounts. It would be nice if we could get some power shell commands that would show what transport rules are on the users accounts both individually and as a group to see if we got everyone that we were supposed to get. Currently we have to go in to the rules interface which clusters all of the users together.", "author": "887276029", "created_at": "2019-03-06", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37940098-hide-dynamics-crm-tile", "header": "Hide Dynamics CRM Tile", "idea_text": "Please find a why to hide the dynamics tile.  We currently have another CRM system and don't want users in dynamics can we please have a way to hide the tile?  I know we apparently can't disable it because you have built it into powerapps and flow but please let us hide to tile to prevent accidental use.  I have tried multiple conditional rules etc and support but no resolution.  Please let me just hide it!", "author": "907486072", "created_at": "2019-06-17", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38045113-allow-education-to-get-fast-track-support", "header": "Allow Education to get Fast Track Support", "idea_text": "As School's we love Microsoft Products and Services, However are finding it very challenging to get support to migrate to the cloud. School In the UK are on forever running on tight budgets and I have just been informed by Fast Track Team, We can't get support for 11 schools part of our trust we would like to migrate!. The reason given  is that we don't have A3 Licenses and we are currently using A1. I can't see much difference between the A1 and A3. Just would wish Microsoft would allow A1 to get the help to move to the cloud. It a shame we are missing out! Please Allow A1 Education Schools and Trusts to get the help they need?", "author": "909097558", "created_at": "2019-06-30", "votes": 3, "reaction": [], "comments": [{"author": "248001748", "created_at": "2019-07-10", "text": "They had changed this the first quarter of this year the requirement from 1000 A3 licenses went down to at least 50 A3 licenses. If I were you I would check by opening a request to see if the requirements have changed by now. "}]}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38417695-in-regard-with-sharepoint-online-alert", "header": "In regard with SharePoint Online Alert:", "idea_text": "In regard with SharePoint Online Alert:With the old version – when you uploaded a document you automatically received the properties screen and could add all the applicable metadata before you officially checked-in the document. Once you did that, a single Alert was triggered for the user (if they were setup to receive alerts).With the new version – when you upload a document you no longer get the properties screen and it appears an Alert is triggered by the upload. You then have to go find the document and add the applicable metadata which is then triggering another alert with those changes. So, at a minimum, users are now getting two alerts when they used to get one. To muddy the waters further, on the initial document upload, since there are no properties, the document is appearing in multiple “views”. If a user has an alert setup for several of those views, they will get several Alerts saying a document has been added. So, in some instances they may be getting 3+ alerts for the upload, and then another for the properties update.", "author": "915465841", "created_at": "2019-08-20", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36766150-i-m-an-administrator-and-my-customers-asked-me-if", "header": "I'm an administrator and my customers asked me if there is a feature that when an appointment is listed in the Outlook calendar as absent or", "idea_text": "", "author": "883134226", "created_at": "2019-02-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36844345-import-p-ms-whiteboard", "header": "Import p MS-Whiteboard", "idea_text": "- Import a picture of many sticky notes on a wall to the app MS-Whiteboard.\n - the one picture with many sticky notes converts into single slider notes in the Whiteboard-App automatcally", "author": "884201239", "created_at": "2019-02-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36844348-import-ms-whiteboard", "header": "Import MS-Whiteboard", "idea_text": "- Import a picture of many sticky notes on a wall to the app MS-Whiteboard.\n - the one picture with many sticky notes converts into single slider notes in the Whiteboard-App automatcally", "author": "884201239", "created_at": "2019-02-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36992473-standard-questionnaire-for-personas", "header": "Standard questionnaire for Personas", "idea_text": "It would be really good to add a standard questionnaire that will support personas... similar to the Myers Briggs type of questionnaires  e.g.  ", "author": "886557268", "created_at": "2019-03-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36896731-litigation-enabled-user-and-not-users-list-in-036", "header": "litigation enabled user and not users  list in 0365", "idea_text": "Enable the option to generate the report for litigation enabled user and not enabled user list in 0365 instead of pull out via power shell because we have limited access . We dont login administrator portal so \n", "author": "885025054", "created_at": "2019-02-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36922090-enabling-to-update-excel-links-embedded-in-powerpo", "header": "Enabling to Update excel links embedded in powerpoint so you can update graphs easily in mac OS", "idea_text": "Enabling to Update excel links embedded in powerpoint so you can update graphs easily in mac OS", "author": "885358984", "created_at": "2019-02-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36051865-help-me", "header": "Help ME!!!", "idea_text": "Scusate se scrivo qui. Ma non riesco a contattare il nr. 80089760 dell'Assistenza per L'Italia.\nPer favore chiamatemi al tel. +393473250611 perchè non riesco ad attivare lo spazio di 1T su Onedrive, anche se ho comprato regolare licenza di Office 365.\nGrazie", "author": "871324180", "created_at": "2018-11-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37264813-add-feature-to-ms-forms-to-hide-report-abuse-lin", "header": "Add feature to MS Forms to hide \"Report Abuse\" link at the bottom", "idea_text": "I understand the need for the link but would like the option to hide it if it may cause confusion. ", "author": "891685645", "created_at": "2019-04-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36573244-edit-non-adjacent-cells-in-ios-excel", "header": "Edit non-adjacent cells in IOS EXCEL", "idea_text": "It should be possible to edit non-adjacent cells in the IOS Version of Excel.", "author": "880652944", "created_at": "2019-01-19", "votes": 0, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36500866-need-to-be-able-to-see-hidden-calendars", "header": "need to be able to see hidden calendars", "idea_text": "We have admins at the c-Level that need to be able to use all features of the calendars (resources) as owners. \nEverything works until you hide the mailbox then once the admin reboots the machine the calendars are not accessible. This is documented on This is documented on   The admins do not want the calendars automapped or added as a secondary profile. This slows down machine, in exchange 2010 we have done this for yearsI have many examples", "author": "879325000", "created_at": "2019-01-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37039240-allow-users-to-customize-the-right-click-toolbar-i", "header": "Allow users to customize the right-click toolbar in Word", "idea_text": "For example, I wish to add the 'Define New Number Format' option when I right click on number/bullet lists. Currently I must go all the way through the Home tab, select number lists and then Define New Number Format, which is rather inefficient for a lot of the work I do. Another example would be to add 'Style' when right-clicking on headings. Although easy enough to access in the Home Tab, I am not always on the Home Tab when I wish to change styles. This used to be a feature in the right-click menu prior to 2016 version of Office.", "author": "887364691", "created_at": "2019-03-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38054203-bookings-to-have-ability-to-book-appointments-at-m", "header": "Bookings to have ability to book appointments at multiple locations", "idea_text": "I as a professional work from multiple locations. I know a lot of professionals including doctor, lawyers, accountants etc work from more than 1 location. I really hoped Booking would be able to handle that.", "author": "909255397", "created_at": "2019-07-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37264864-add-option-on-ms-forms-if-using-a-custom-submit-r", "header": "Add option on MS Forms, if using a custom submit response, to hide the default response.", "idea_text": "Currently, you can add your own custom submit response to show on the form. However, it still shows the default response of \"Thanks!\" with a large check mark inside a circle above it.  Why allow custom response if it will still show the default?", "author": "891685645", "created_at": "2019-04-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36999568-enable-wiki-page-tab-on-android-devices-for-guest", "header": "Enable wiki page tab on android devices for guest user in Teams", "idea_text": "Enable wiki page tab in all Android devices this is very useful features where in it will allow teams member to collaborate using their mobile device.", "author": "886667395", "created_at": "2019-03-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37992133-dillion-that-works-at-29-sterling-club-in-white-pl", "header": "Dillion,that works at 29/sterling club,in white plains!", "idea_text": "Unless,it’s a hologram room 202,since November 2015,invisible electronic barrier,so Hiroo cannot escape! Westchester county para transit services,coming to the town of eastchester,village of Scarsdale,bob litwak has not given up until Hiroo goes to wheelchair! Don wood has,a secret method read hiroo’s E mail not just yahoo!", "author": "717303589", "created_at": "2019-06-23", "votes": 1, "reaction": [], "comments": [{"author": "717303589", "created_at": "2019-06-23", "text": "Unless,it’s a hologram yes sir!"}]}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38265841-track-sharepoint-external-invite-email-bounce-back", "header": "Track SharePoint external invite email bounce back", "idea_text": "Currently there is no way to track if an email invite sent to external users when they were added to a SharePoint site got bounced back due to incorrect email address or restrictions at the receivers end. We keep on waiting for the external user to accept the invite and they keep on waiting for the invite, but there us no communication in sharepoint or in O365 Message trace if the message was delivered or not. I even opened a support ticket and got the response that it is by design.", "author": "912828139", "created_at": "2019-07-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38631004-stop-sharing-the-folder-titles-that-my-subfolder-i", "header": "stop sharing the folder titles that my subfolder is in when I share a Onedrive link! The other folders have private information in them!", "idea_text": "I try to share a subfolder with a third party. The stupid Onedrive link shows ALL THE OTHER FOLDERS that the subfolder is in. This is obnoxious and needs to be fixed asap. Stop telling us to do a work around of copying the folder to the root Files folder. It's messy. So many people are complaining about this and user forums said it was \"resolved\" back in 2015 and people are STILL COMPLAINING in 2019 and users have stated on the forum that they are jumping ship for Dropbox. Come on Microsoft!", "author": "747409921", "created_at": "2019-09-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38246248-give-the-option-to-view-the-new-onenote-in-the-201", "header": "Give the option to view the new OneNote in the 2016 format.", "idea_text": "The current view is not user friendly or ideal when trying to use it. Allowing users to select to go back to the 2016 view of the software would be an easy fix and ideal so people can choose what they want for their view.", "author": "912492463", "created_at": "2019-07-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38258614-bring-odbc-connection-to-oracle-essbase-to-excel", "header": "Bring odbc connection to Oracle essbase to Excel", "idea_text": "Allow odbc connection to essbase cubes in Excel.", "author": "912708820", "created_at": "2019-07-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36219004-single-printing-by-various-named-ranges-simplicit", "header": "Single Printing by Various Named Ranges (Simplicity!!)", "idea_text": "Can anyone tell me why after 34 years with Microsoft Excel being in existence that you can not select via a simpler window multiple named ranges? Even if you create a print macro to create process it become complex and in some cases unmanageable!", "author": "874648507", "created_at": "2018-12-07", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36477070-show-that-a-file-or-pdf-has-already-been-printed-b", "header": "Show that a file or PDF has already been printed before.", "idea_text": "I was thinking that a feature similar to the one that shows that an email was responded to but for files or PDF's that have already been printed. This would save a lot of paper and the old \" I printed it out already and gave you the invoice argument\". ", "author": "878877838", "created_at": "2019-01-08", "votes": 2, "reaction": [], "comments": [{"author": "248001748", "created_at": "2019-07-10", "text": "you need special licensing for this feature: "}]}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38451721-powerpoint-presentation-with-embedded-audio-and-co", "header": "Powerpoint presentation with embedded audio and convert to a mov or MP4 file", "idea_text": "Ability to take either a PowerPoint presentation with audio embedded into each slide and convert it to a mov or MP4 file without having to record the presentation, and have poor sound quality, or take the PowerPoint \"Custom Show\" which perfectly plays the animation and audio and save it as a Movie or a file that others can playback, without sending the entire file.", "author": "916036195", "created_at": "2019-08-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38593156-remove-open-pdf-with-word-from-the-what-s-new-se", "header": "Remove \"Open PDF with Word\" from the What's New section of Word 365 for Mac.", "idea_text": "The capability to open PDF files with Word is not supported in Word 365 for Mac.", "author": "919643842", "created_at": "2019-09-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38419429-search-in-shared-mailbox-and-shared-folder-without", "header": "Search in Shared Mailbox and Shared Folder without Full Access", "idea_text": "Include facility to search in sub-folders when user granted access to some folders in a Shared Mailbox or a Shared Folder.", "author": "915501583", "created_at": "2019-08-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/38556304-test-new-fea", "header": "test new fea", "idea_text": "", "author": "917739124", "created_at": "2019-09-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/36190762-please-add-night-mode-save-our-eyes-nowadays-al", "header": "Please add night mode & save our eyes 😢Nowadays all apps have night mode feature", "idea_text": "Please add night mode feature & save our eyes 😢Nowadays all apps have night mode ", "author": "874189258", "created_at": "2018-12-04", "votes": 12, "reaction": [], "comments": [{"author": "915808468", "created_at": "2019-08-23", "text": "Staring at a computer screen all day can lead to or contribute to conjunctivitis; your eyes are not given the appropriate opportunity to relax. Off white, cream, and amber colors are very easy on the eyes and help prevent the headaches that Bright whites do: consider along with night time mode adding soft color choice to all M365, Microsoft technologies please: (FFFFED, FFF8DC, and/or FAE8D7)"}, {"author": "874189258", "created_at": "2018-12-04", "text": "Please add night mode & save our eyes 😢Nowadays all apps have night mode "}]}
{"url": "https://office365.uservoice.com/forums/602104-fasttrack/suggestions/37515841-crosoft-needs-a-better-way-to-protect-emails-li", "header": "crosoft needs a better way to protect emails... like DropBox does files... or offer an automated .pst back up utility.", "idea_text": "Microsoft needs a better way to protect emails... like DropBox does files... or offer an automated .pst back up utility.", "author": "897961993", "created_at": "2019-04-30", "votes": 1, "reaction": [], "comments": [{"author": "248001748", "created_at": "2019-07-10", "text": "You will need special license such as ATP to handle it : "}]}
