{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34253983-can-you-create-a-template-with-publisher-or-word-u", "header": "Can you create a template with publisher or word use for campaign template?", "idea_text": "I would like to create a template in Publisher or word and use this template in the Email Campaign.", "author": "787316182", "created_at": "2018-05-15", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32271997-different-signup-pages-for-each-mailing-list", "header": "Different Signup pages for each Mailing List", "idea_text": "My use-case for Connections involves a variety of \"customer\" types (clients, partners, students, contacts).  If it not always possible for me to manually review the \"Everyone\" list and manually add people to appropriate Mailing Lists, mainly because I'd then need to know everyone's name.Would it be possible to have different (and customizable?) signup pages for each mailing list, or at least a URL slug that can be appended and pass through the sign-up to a field about the customer so I can track by URL used for signup?  I'd like to email my corporate training clients (students) about completely different offers than my consulting clients.", "author": "710747901", "created_at": "2017-11-15", "votes": 5, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-28", "note": "Hi Chase, thanks for the suggestion and use cases. We agree that having to manually manage your mailing lists isn’t always the best solution, and letting your customers subscribe or unsubscribe from specific mailing lists is something that we are looking into adding in a future release."}], "comments": [{"author": "710747901", "created_at": "2018-04-02", "text": "Bump.  Any follow up?"}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32588312-can-connections-access-distribution-list-from-o365", "header": "Can Connections access distribution list from O365 E-mail?", "idea_text": "Can Connections access distribution list from O365 E-mail?", "author": "724395986", "created_at": "2017-12-11", "votes": 3, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2018-02-09", "note": "Could you tell us more about your request?  Are you using your existing O365 email to send mails to your customers today by adding them to a Distribution List (DL) and sending to that?  Would it be valuable if you could import your DL into Connections as a mailing list?  Or is there more you’d like to see?  Your answers will help us make sure we evaluate the right functionality.  Thanks for taking the time to leave a comment!"}], "comments": [{"author": "834525967", "created_at": "2018-08-13", "text": "it would be great to be able to sync Distribution lists in Outlook/Office 365 so you don't have to import them all. "}, {"author": "796180972", "created_at": "2018-06-06", "text": "Along these same lines it would be great to connect the Mailing List to a Sharepoint Contact list. We have a large staff of Part Time and Seasonal workers that change more often then our IT department can keep up with."}, {"author": "780028471", "created_at": "2018-04-23", "text": "Hello, I'm not the original poster, but I'm also having an issue with Connections DL functionality. For me, having the ability to apply a filter to Business Center contacts when creating a DL, as well as having more fields available to filter would be minimum requirement for creating lists. "}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33736714-allow-custom-domains-for-outbound-email-address", "header": "Allow custom domains for outbound email address", "idea_text": "Please allow me to send from my custom domain like mycompany.com rather than mycompany.mssend.com", "author": "398985916", "created_at": "2018-03-23", "votes": 11, "reaction": [], "comments": [{"author": "818528542", "created_at": "2018-06-27", "text": "This change would allow us to use this feature. Not sure that we can, if the change is not made."}, {"author": "783150592", "created_at": "2018-05-02", "text": "This is a deal breaker.  The app is not useful without this particularly given all the concern about spam, phishing and spoof email senders.  Please enable this critical feature!"}, {"author": "398985916", "created_at": "2018-03-23", "text": "Created by the Connections team to capture a request that was made as part of another request."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33736753-allow-me-to-choose-the-reply-to-address", "header": "Allow me to choose the Reply to address", "idea_text": "Please allow me to set the reply-to address for my campaigns.", "author": "398985916", "created_at": "2018-03-23", "votes": 3, "reaction": [], "comments": [{"author": "398985916", "created_at": "2018-03-23", "text": "Created by the Connections team to capture a request made in the comment of another request."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/31195294-please-bring-this-to-non-profit-subscriptions-too", "header": "Please bring this to Non-Profit subscriptions too.", "idea_text": "It would be great to see this appear for the non profit users. ", "author": "662039014", "created_at": "2017-09-03", "votes": 8, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-09-11", "note": "Thanks for letting us know you’d like to see Connections in the non-profit subscriptions. We’ll evaluate that request for our future releases."}], "comments": [{"author": "837406045", "created_at": "2018-08-18", "text": "Any news on whether this will be added. Non-profits need to send out newsletters as well. In fact it is crucial to most. We have to use something like mailchimp, which starts costing a lot of money once you have more than 2000 subscribers.\nPlease make connections available to non-profits."}, {"author": "354403612", "created_at": "2017-09-06", "text": "data loss protection to the Enterprise 1 Not for profit - that would be great as we deal with so much PHI HIPAA information. thanks"}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35094043-customise-the-welcome-email", "header": "Customise the welcome email", "idea_text": "When someone signs up and confirms to join the mailing list, it would be nice to customise the email that is sent to them when they confirm their subscription to the mailing list. ", "author": "662039014", "created_at": "2018-08-12", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33874228-scheduling-campaigns", "header": "scheduling campaigns", "idea_text": "Make it possible to schedule campaigns for future delivery. It isn't always convenient to draft the campaign at the moment you want to send it.", "author": "774565747", "created_at": "2018-04-06", "votes": 3, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2018-04-09", "note": "Good news — we’re now rolling out a “scheduled send” feature to Connections users now!  You may already see it, and if not, you should see it within the next few weeks.When the scheduled send feature is available for your account, it will appear on the final preview screen before sending.You’ll see a note just above the To and Subject lines indicating “This campaign will be sent immediately” with a link to Edit when the campaign should be sent.We’d love to hear feedback on how you like this new functionality."}], "comments": [{"author": "774565747", "created_at": "2018-04-06", "text": "It would be very helpful to allow a campaign to be created, but sent at a specific future date.It is often not convenient to create the campaign at exactly the moment you want to send it."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/31923127-enable-a-flow-or-custom-api-to-integrate-with-micr", "header": "Enable a Flow or Custom API to integrate with Microsoft Connections", "idea_text": "Currently, I am using MailChimp to Outlook Contacts Flow. In addition, I use MailChimp for newsletters. It would be nice if we could use a form or REST call to add contacts to list. For example, on my Facebook page, I have a custom form to subscribe visitors to my newsletter. Additionally, I have a form on my website where it would be nice to add users that submit an email to the Microsoft Connections Contact List. Lastly, I would really like to avoid using MailChimp and just keep everything in O365. I know I can just import Outlook contacts from the Contacts page in the Business Center but this is just a workaround, not a long-term solution.", "author": "689956246", "created_at": "2017-10-17", "votes": 15, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-18", "note": "Thanks, Eric. We’ll take your request for a Flow or custom  into account as we work to continually improve Microsoft Connections."}], "comments": [{"author": "726593299", "created_at": "2017-12-16", "text": "Just to add, putting in place an API for Microsoft Connections should allow us to sync with Salesforce CRM with Flow.   This would enable us to move from Mailchimp to Microsoft Connections."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32034397-better-contact-control-connections-campaigns", "header": "Better Contact Control - Connections Campaigns", "idea_text": "The Business Center Contacts and mailing lists are \"clunky\" and difficult for larger campaigns.  The ability to have custom fields and filter on them for campaigns would be a huge improvement.  We want to do several campaigns grouped by sales people, but when creating a mailing list you have to manually click on each user instead of querying a group by a particular field.  Also, how about tracking the email results, especially if undeliverable?  Custom fields would also be helpful to follow up on certain items like if the contact has become stale, setting up geographical regions for campaigns and other things too numerous to mention.  The ability to bulk update these from a spreadsheet, powershell, or database would also be nice.  Most SMB users have limited IT resources so the process needs to be more manageable with better tools.I think this is a good start for the SMB market, but it still needs added functionality for ease of use and reporting on contacts.", "author": "700632094", "created_at": "2017-10-26", "votes": 15, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-30", "note": "Hi Brian,Thanks for the great feedback! If I’m understanding you correctly, you’re making four distinct but related suggestions:1. Improve the contacts list by allowing custom fields (some of your ideas are geographical region, whether they’re still an active customer, which salesperson they work with)\n2. Improve the Email Marketing feature by allowing you to bulk-add contacts to a mailing list after filtering by those custom values\n3. Track whether any emails were undeliverable (and add that as another field on the contact?)\n4. Enable bulk-updating contacts using a spreadsheet / database / PowerShell.All of these are great suggestions and we’ll be considering these in the future."}], "comments": [{"author": "771156316", "created_at": "2018-03-27", "text": "I would love to see stack-able mailing lists as well (for example three or more mailing lists I can stack into a distribution list)Also - pretty new to the platform so maybe i'm missing it, but I would like to see a drop down in the \"edit a customer\" to add to mailing list"}, {"author": "700491799", "created_at": "2017-10-27", "text": "Contact types is limited to Customer and Lead... most will need to be able to segregate people into more groups so allow other values to be created. \nA separate multi-value custom field would be useful too to capture other attributes (possibly filtered by contact type field)."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34633963-easier-de-duping", "header": "Easier de-duping", "idea_text": "I had a failed attempt at importing my data into Connections, so I deleted all the contacts and started again.  I now have a (more or less) clean list assigned to various mailing lists but this has brought about its own issues.My suggestions are:1) I have a complete set of duplicates (and more - 832 people in Contacts but 1,705 people on the 'Everyone' list) with no reassurance that, if I use this list, it won't send each mail twice!\n2) Provide an easier way of searching for duplicates in the contacts list.  At present all you seem able to do is browse down a long list and try to spot them yourself (I should send you my optician bill!!!)\n3) For GDPR purposes I want to remove any phone numbers I added in ignorance - I don't have a need to keep these within MS Connections.  But again, I have no way other than to browse down each list, edit each contact and then repeat, as saving a contact makes the list scroll back to the top each time.Thanks!", "author": "817115323", "created_at": "2018-06-22", "votes": 17, "reaction": [], "comments": [{"author": "818056369", "created_at": "2018-06-29", "text": "As a related issue, if you have multiple contacts with the same email address (eg husband and wife) Connections complains when you try to add both to a mailing list - whereas actually you may need to send out separate opt-in emails to each person individually ..."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/31928530-when-will-it-be-available-in-western-europe", "header": "When will it be available in Western Europe?", "idea_text": "", "author": "690797128", "created_at": "2017-10-18", "votes": 11, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-18", "note": "We’re currently available to First Release users in the United Kingdom, Canada, and the United States, and we want to make sure we get the experience right for organizations in these locations before we expand further."}], "comments": [{"author": "839999953", "created_at": "2018-08-23", "text": "I'm also hoping to be able to use Microsoft Connections..."}, {"author": "821009980", "created_at": "2018-07-06", "text": "You might not by accident be that vague I presume?\nWhy not even a statement of whether you are committed to the European expansion?\nSince your comment now is close to 1 year old now, the millions of European customer do at least deserve some more clarity here, don't you think?\n"}, {"author": "790353439", "created_at": "2018-05-23", "text": "Are you able to give an update ?"}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35348143-do-not-retire-connection-from-business-365", "header": "Do not retire Connection from business 365", "idea_text": "We are a small company that started using windows for business 365 and love it. We used the connections portion of it and was an amazing hit wit the clients now it is being retired. What is this going to mean for us.  The best thing about 365 is that everything you need is there in one spot.\nWe need the connection/ campaign APP\nPlease do something                         ", "author": "847671376", "created_at": "2018-09-07", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32338252-multiple-business-profiles", "header": "Multiple Business Profiles", "idea_text": "At our company, we have different domains for different business units, and it would be helpful if Microsoft Connections would allow for completely separate setup of lists, templates, etc between the different domains OR the ability to create a Microsoft Connections instance based on a Group or Team Site in SharePoint Online. ", "author": "713283688", "created_at": "2017-11-21", "votes": 9, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-27", "note": "Hi Kevin,Thank you for your suggestion. As we continue to add functionality for Connections, we will take your suggestion into consideration."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/31806115-the-new-office-365-business-center-includes-email", "header": "The new office 365 business center includes email marketing", "idea_text": "The new office 365 business center includes \"email marketing\" mailing list includes the option for a sign-up page. On the banner of the sign-up page the text \"sign up for updates and promotions\" Admins should be allowed to change the text for the signup page.", "author": "681130792", "created_at": "2017-10-08", "votes": 17, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2018-02-06", "note": "We’re working on this item. You’ll be able to change the “sign up for updates and promotions” text."}, {"status": "thinking about it", "author": "398985916", "created_at": "2017-10-17", "note": "Thanks for the feedback! We’ll consider allowing admins to edit the contents of the sign-up page when planning future releases."}], "comments": [{"author": "915385828", "created_at": "2019-08-20", "text": "The best thanks to explore the method addiction begins is to peel back the complicated problems layer by layer and examine the method every element relates to the matter.\n\n"}, {"author": "914605942", "created_at": "2019-08-13", "text": "Alcohol addiction will ruin a person’s life, and nonetheless several still abuse the drug wittingly to avoid alcohol withdrawal. ward and withdrawal area unit ill-famed within the addiction community for being physically and psychologically uncomfortable experiences. If done reception while not medical attention, alcohol withdrawal will even flip deadly. However, now of bodily cleansing is that the opening to golf shot your life back heading in the right direction.                                                                                                                        In several cases, alcohol withdrawal needs medical treatment and hospital admission. Medication may be wont to treat physical symptoms whereas content and support teams facilitate with dominant drinking behavior.\n\n"}, {"author": "913499587", "created_at": "2019-08-05", "text": "Crime is one in each of the many concerns not only in our country but also around the world, and alcohol is somehow intertwined in most of these cases. As alcohol will increase the risk of aggressive behavior of someone and impairs the person’s judgment, there has been a big increase in Alcohol and Crime throughout the country.\n\n"}, {"author": "906861289", "created_at": "2019-06-12", "text": "Coinbase customer Service number\nDue to an increase in the number of online users, a number of services come into the picture. There are a number of companies who claim  to be the best in their customer Services that really, doesn’t reflect so. Coinbase, with its effective and certified services, has  forever fulfilled its words so they need a group of happy reviews of the customers. Coinbase customer Service number did offer on our web  site to contact our agents for customer support. There are numerous ways to contact our customer service but it'd be best if you dial our  fee variety to urge a second reply.\n"}, {"author": "871985980", "created_at": "2018-11-20", "text": "If you phase technical issues with the AOL email it is resolved in a fraction of seconds? Yes, it is, of course, our technical assistance understands what everyone needs where he has issue in AOL, he has a capacity to provide the best solution with the perfect answer. It is not a matter of solution, it is a matter of good service that how the team is handling AOL Email Customer Support number 1-888-270-8375 for AOL users.Visit us:- "}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32361730-greater-flexibility-with-editing-email-campaigns", "header": "Greater Flexibility with Editing Email Campaigns", "idea_text": "Everything from font to footer is limited to the defaults, need to be able to customise current template.", "author": "714389113", "created_at": "2017-11-23", "votes": 13, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2018-02-06", "note": "We’re working on adding additional flexibility here including font, font size, font color, and additional support for images."}], "comments": [{"author": "747409921", "created_at": "2018-02-25", "text": "Yes, also, allow us to delete the default images and have NO headers and just have plain text emails we can send as well. For an initial email to people who signed up to receive documents, I just want to send a personalized email, not something with a ton of photos and large fonts. "}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32035576-easier-and-more-useful-template-creation-control", "header": "Easier and more useful template creation/control", "idea_text": "The campaign templates are really basic and appear that they are only built for mobile devices by size.  They look fine for a few things, but there is no way to do custom coding with it or get a higher end (professional) look and feel.  I tried to put 600x338 pixel image in a template and it would not let me resize to fit the predetermined box (which is pretty much square).  Adding more links to the template document would be helpful.  You can add one link basically to the announcement template, plus all your social links, so very limited.  How about allow HTML imports/creation options so we can embed things better?  Custom accent colors instead of the basic 14 provided so the end users can match their logo colors, etc.The marketing posts on Connections states \"You can also provide simple ways for people to join your mailing list or unsubscribe\"  Where is the \"join\" function?  I find very little \"documentation\" and when you query MS online help, it provides information about network connections to Microsoft, not the product itself.What does the roadmap look like for this product?  Will it grow into an application with more functionality?Regards,Brian", "author": "700632094", "created_at": "2017-10-26", "votes": 19, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-30", "note": "Hi Brian,Thank you again for your additional feedback!I would like to try to summarize your ideas/questions, as it will help the team identify the different pieces they might be able to help on.Your Suggestions:1. You would like more flexibility with the look and feel of campaigns—for example the image you were trying to add was different from the aspect ratio of the template.2. You would like to add more links to the templates. (You are correct that right now, the “Referral” campaign doesn’t allow any custom links, and the “Announcement” campaign allows just one. However the “Newsletter” template allows as many links as you like).3. You would like to have the ability to edit  directly or import a pre-made  template4. You would like to have the ability to pick a custom accent color.Your Questions:1. Where is the “join” function?\n- The place where you can find that is the “Mailing Lists” page. In the upper-right corner there’s a link to “Grow your mailing list” with a sign-up page.2. Where’s the help documentation?\n- While we do have a few articles on support.office.com, we’d love to better understand what you believe needs more detail or explanation. Please let us know and we can create more support articles. We’re in the early stages of rolling this out, and we are grateful to customers like you who are helping us improve.3. What does the roadmap look like?\n- We plan to iterate and improve the product based on feedback from customers like yourself, but one of our goals is to make these tools accessible to businesses who would benefit from an “all-in-one” package and who don’t require as much customization. For customers with more technical experience and who want a sizeable amount of customizability, we may not quite meet those needs. In those cases, we suggest that Microsoft Dynamics 365 Business might better suit those customers for these types of business functions."}], "comments": [{"author": "874816120", "created_at": "2018-12-09", "text": "I have no buineess I just want chrome and facebook reinstalled\n"}, {"author": "771156316", "created_at": "2018-03-27", "text": "This is an absolute necessity! But also the ability to eliminate entire blocks of content from the templates. And the forced social media or URL button links are not always relevant \n"}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32272105-make-an-embeddable-signup-form-for-websites", "header": "Make an embeddable signup form for websites", "idea_text": "Would it be possible to make the signup page(s) available as embeds that could be inserted into web pages?  I'd like to place the signup box on every page within my site and not just the link to the signup page.", "author": "710747901", "created_at": "2017-11-15", "votes": 10, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-28", "note": "Hi Chase, thanks for the suggestion! Allowing the signup form to be embedded in your own website is something that we are considering adding in a future release."}], "comments": [{"author": "710747901", "created_at": "2018-04-02", "text": "Bump.  Any follow up on this idea yet?  "}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/20144035-make-connections-available-to-all-edcucation-custo", "header": "Make connections available to all Edcucation customers", "idea_text": "I would like to see Microsoft Connections available for Education customers as well.", "author": "416675725", "created_at": "2017-07-17", "votes": 19, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-07-17", "note": "Thank you for the feedback, your feedback will be considered for future releases."}], "comments": [{"author": "700491799", "created_at": "2017-11-01", "text": "and on plans for non-profits too"}, {"author": "104826864", "created_at": "2017-07-27", "text": "Yep!  Could definitely see this being used in education, today we have to refer people to MailChimp."}, {"author": "421573045", "created_at": "2017-07-24", "text": "I currently have 2 Microsoft accounts; one is my personal account and the other is an account that my school sets up for their online students. Besides wishing that I could somehow combine the two accounts, because I have important school work on both, I've noticed many restrictions on my school account, especially with the newer apps such as Azure and Dynamics 365. The restrictions cause me to go back and forth between accounts, splitting up my work."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/20026852-please-activate-it-for-enterprise-plans-as-well", "header": "Please activate it for Enterprise plans as well", "idea_text": "All our clients are below 100 employees, yet most of them are on Please activate it for Enterprise plans as wellOffice365 Plan E3, including us selves, and we are only 5 on the team.All the new goodies, Connections, Listings, Invoicing, MileIQ and Bookings, Outlook Customer Manager are only for Business Premium, why not let the companies that pay more opt-in on these as well?", "author": "123833484", "created_at": "2017-07-11", "votes": 76, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2017-08-29", "note": ""}], "comments": [{"author": "899221294", "created_at": "2019-05-07", "text": "I spoke to Microsoft at the highest level and I have to say there is no one there with any small business sense whatsoever.  It was the best feature of Office 365 ever."}, {"author": "899221294", "created_at": "2019-05-07", "text": "Thanks to Microsoft for removing the best feature of Office 365"}, {"author": "893651839", "created_at": "2019-04-17", "text": "thankyou for Office365.uservoice.com"}, {"author": "889503610", "created_at": "2019-03-19", "text": "For MileIQ inquiries with E3 subscriptions, they are helping clients via , reach out and they will help you get set-up with accounts. "}, {"author": "435037657", "created_at": "2019-01-06", "text": "ANY UPDATES? are their any email marketing replacements IF connections is gone from Business center? \nWHY not allow connections to be used separately of business center?! \nWHY did E3 customers never get access to Connections if we pay more than Business Premium customers?!?!?! \n@Microsft Admins, cmon, its been a year and a half! Give us an update!!!"}, {"author": "391702249", "created_at": "2018-09-28", "text": "Sadly it looks like Connections and several other parts of business center are being retired at the end of November."}, {"author": "836378206", "created_at": "2018-08-16", "text": "Please make this available in A1 as John H requested. "}, {"author": "700992055", "created_at": "2018-07-06", "text": "Definately looking for E3/E5!!"}, {"author": "708443071", "created_at": "2018-06-26", "text": "Also is it possible to make available to academic plans such as Office 365 A1"}, {"author": "790977244", "created_at": "2018-05-25", "text": "Another user here looking for Connections in the E3 & E5 tier. We are going to deploy with Mail Chimp next week since this issue keeps my enterprise users from being able to work on the campaigns."}, {"author": "789641809", "created_at": "2018-05-21", "text": "Is there anything we can do to make it faster? The issue was raised almost a year ago, and it is still causing pain and frustration to customers today. "}, {"author": "778777450", "created_at": "2018-04-19", "text": "Dear Microsoft admin, please take a look at it again. As an Enterprise E3 user I don't want to be condemned anymore to using third party applications or even the email marketing functionality within Microsoft Dynamics. It is just not as user friendly."}, {"author": "261353968", "created_at": "2018-04-13", "text": "Hello, can you share more on the reasons why it's currently not included in Enterprise plans?"}, {"author": "363805525", "created_at": "2018-03-19", "text": "No updates? "}, {"author": "700992055", "created_at": "2018-02-20", "text": "we have mixed licenses in our environment as some need the E3 for MS Phone."}, {"author": "733072753", "created_at": "2018-01-03", "text": "Any progress on this? We have E3 and are scratching our heads on why it's still not available."}, {"author": "710477029", "created_at": "2017-11-15", "text": "Agree with Ulrich makes no sense to not be on Enterprise E3 license. If you are supporting customers you cannot see how it is working and would need to learn on the fly while supporting or purchase a Business Premium license which makes no sense."}, {"author": "710107420", "created_at": "2017-11-14", "text": "Make Connections part of the O365 E3 and E5 plans. I need E5 for cloud PBX so I am precluded from getting Connections. This does not make sense."}, {"author": "708350302", "created_at": "2017-11-10", "text": "Agreed.  Not having this available in E3 doesn't make any sense.  Our users are paying significantly more - why has Microsoft chosen not to offer this to the more expensive tier (E3)."}, {"author": "663892138", "created_at": "2017-09-06", "text": "We're in this boat as well.. as a partner, since the beginning of Office 365 the mantra we got from account managers was always \"lead with enterprise\", and we did. All our clients are on some mix of Enterprise accounts, mainly E3/E5 - Enterprise offers more flexibility with licensing when it comes to task workers, it's not one size fits all. However, it's now starting to cause pain that a lot of the new add-ons are only appearing for the low end when they should ultimately be universal to the platform. I mean we could switch all our customers from Enterprise to the Business SKUs, but I can't imagine you want to lose that additional revenue... I know I don't."}, {"author": "398985916", "created_at": "2017-07-11", "text": "Hi Ulrich! This is great feedback, and we'll take a look at whether we can add these products to the enterprise plans."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32087230-support-needed-in-power-bi-pro", "header": "Support needed in Power bi Pro", "idea_text": "Support needed in Power bi Pro", "author": "676547236", "created_at": "2017-10-31", "votes": 3, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2017-11-07", "note": ""}], "comments": [{"author": "398985916", "created_at": "2017-11-07", "text": "Thank you for the feedback. We will consider including Power bi pro support in future releases."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/37251055-advance-method-high-level-technology-of-digital", "header": "ADVANCE Method & high level technology of DIGITAL MARKETING COURSES", "idea_text": "With the aim to educate people in ( Marcos Group ) IIDM international digital marketing in simplistic and easy to understand approach Simply Digital has emerged as one of the leading Digital Marketing Institutes in Delhi having the best faculty members from IIT and IIM who provide training through the classroom as well as online classes. A comprehensive training of live classroom sessions are provided for students,    entrepreneurs and corporate professionals. In addition to having 5 centers in Delhi itself, they also have centers in Delhi Nevada  please call 8448554713, 8505817612, 9319644438, our next batch start 1-April -2019. Read More :- ", "author": "891432664", "created_at": "2019-03-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/37082053-backup-tool-for-live-com", "header": "Backup tool for Live.com", "idea_text": "Live.com is a web-based application that is used for email communication. However, there are various online threats available that can cause harm to your database or important emails. Issues like account hacking, permanent deletion of important emails, virus issues make your account inaccessible, internet connectivity problem etc. may create trouble for you to access emails of Live.com. In this case, backup is the only solution by which the users can access their important database already saved.for more detail visit here: \n", "author": "888111022", "created_at": "2019-03-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/37349299-simplify-info-about-updates-to-be-downloaded", "header": "Simplify info about \"updates to be downloaded\"", "idea_text": "Problem when starting Outlook shown in an info screen at the centre of my laptop screen, but no suggested solution. After several restarts and new tests to start Outlook I happened to see -\"there are updates to be made\" etc at the lower right side corner. But why on earth don't you write that tiny info in the \"error message box\" on the centre of the screen, so everyone can see that info without using a magnifier!", "author": "893894488", "created_at": "2019-04-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/37815483-you-have-to-attach-invoice-to-the-letter-about-inv", "header": "You have to attach invoice to the letter about invoice.", "idea_text": "You have to attach invoice to the letter about invoice. It is the 3rd year in a row here is a panic in our company, caused by your's (late) panic letter about out-of-date invoice, without containing invoice itself, Accountant should get invoice with the letter. There is no reason for accountant to use admin console to find invoice there and download it. The way to pay should be obvious, not go-somewhere-else-and-get-it-there way.  \nAlso, there is no in advance letter with information about approaching time to pay. You have to make it more obvious for accountants.", "author": "904063525", "created_at": "2019-06-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/37800496-there-is-no-recalls-sent-email-messages-in-outlook", "header": "There is no recalls sent email messages in Outlook for Mac.", "idea_text": "I would like to do Recall in the emails I send, like, there is in Windows, because if you make a mistake you can retrieve the email back. mistakes sending: confidential information, information that is not for one user and in general errors.", "author": "903783247", "created_at": "2019-05-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/36826924-please-allow-option-to-insert-the-image-in-autorep", "header": "Please allow option to insert the image in autoreply in OWA", "idea_text": "Please allow option to insert the image in autoreply in OWA", "author": "883969264", "created_at": "2019-02-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/38343151-outlook-shared-calendars-take-5min-or-more-to-sync", "header": "outlook shared Calendars take 5min or more to synchronize from ethernet connected computer to Cellular connected computer", "idea_text": "Outlook shared calendars take 5min or more to synchronize family appointments causing double bookings and cancelations, this seems to be a returning issue, happens through the local Outlook App and is fixed when we call Microsoft O365 tech support, issue reoccurs after a random time (days, weeks, month) not sure what is being done on the back end to fix this but can this issue be implanted to always work at 45 second sync times and not degrade over time causing me to have to call Microsoft tech support to fix this issue on the back end again", "author": "914100769", "created_at": "2019-08-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/38463322-77", "header": "77", "idea_text": "", "author": "916231915", "created_at": "2019-08-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/38494849-what-is-a-sleeping-pill", "header": "What is a sleeping pill?", "idea_text": "These medications square measure accustomed facilitate people's World Health Organization have an issue falling asleep or staying asleep on their own. Sleeping pills square measure hypnotics, which means that they promote or extend sleep. they're conjointly typically referred to as sedatives, that whereas virtually which means “calming,” additional usually will seek advice from “the ability to cause somnolence.”\nWhat is a sleeping pill?\nThe most common prescription sleeping pills, or hypnotics, square measure within the categories of medication referred to as antianxiety drugs or benzodiazepine receptor agonists. Sleeping pills will have serious aspect effects if overused or abused.\nYour aid supplier can begin your consultation by attempting to work out the contributory factors and length of your sleep disorder.  instead, if these don't work, or in conjunction with these techniques, he or she could verify that you just may benefit from the utilization of sleeping pills. this could be the case if your temporary state is acutely poignant your health and everyday life activities negatively.\n", "author": "915385828", "created_at": "2019-08-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33328891-import-and-add-to-specific-mailing-list", "header": "Import and add to specific mailing list", "idea_text": "During the import there is a option to enable marketing email however we would need to have the option to add people to specific mailing lists as currently it adds them to all mailing lists including ones that are not relevant to them.", "author": "700992055", "created_at": "2018-02-14", "votes": 2, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2018-02-16", "note": "Thanks for your comment. We’re working on this feature now. You’ll soon be able to choose a specific mailing list and your imported contacts will get added to that list as part of import."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34158016-download-results", "header": "Download results", "idea_text": "You can upload data from a csv but no way to download. would be good if could download all data, contacts with campaign results, i.e. success, failed delivery, unsubscribe etc. so we could then bulk edit and re upload changes. i need to be able to download so can update our crm system. don't like the idea of copy and pasting for the next few hours  ", "author": "776887684", "created_at": "2018-05-04", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/37579141-why-don-t-they-change-this-topic-to-connections-w", "header": "Why don't they change this topic to Connections \"WAS\" an email marketing campaign.", "idea_text": "Microsoft giveth and Microsoft taketh away.", "author": "899221294", "created_at": "2019-05-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/38452498-side-effects-of-tramadol-drugs-overdose", "header": "Side Effects Of Tramadol Drugs Overdose", "idea_text": "Side Effects Of Tramadol Drugs Overdose Tramadol may be a narcotic-like pain reliever. Tramadol is employed to treat moderate to severe pain in adults. Tramadol will slow or stop your respiration and should be addictive. Drugs will particularly in a very kid or different person exploitation the drugs while not a prescription. Tramadol mustn't incline to a toddler younger than twelve years recent. Ultra mustn't incline to anyone younger than eighteen years recent.Take Tramadol precisely as prescribed. Follow all directions on your prescription label. Tramadol will slow or stop your respiration, particularly once you begin exploitation this drugs or whenever your dose is modified. né'er take these drugs in larger amounts, or for extended than prescribed. Tell your doctor if the drugs look to prevent operating still in relieving your pain. Since Tramadol is employed for pain, you're not going to miss a dose. Skip any lost dose if it's virtually time for your next regular dose. Don't take further drugs to create up the lost dose.\n", "author": "916052413", "created_at": "2019-08-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34513525-delete-expired-campaigns", "header": "delete expired campaigns", "idea_text": "There should be a way to delete campaigns to manage storage. I have generated a number of campaigns simply in testing. I would like to delete them and, once I use Connections in production, be able to delete old campaigns so that I don't need to scroll through hundreds of ages to find one I want to replicate.", "author": "774565747", "created_at": "2018-06-11", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/38468041-voice-message", "header": "Voice message", "idea_text": "In place of writing an email I suggested to record a voice to make message easier deliver and more clear to receiver also more secure than someone using your email, also listening easy than reading and more clear. Also more healthy for keeping our eyes away from screen .", "author": "916301449", "created_at": "2019-08-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33540694-allow-us-to-fill-out-multiple-e-mail-addresses-of", "header": "Allow us to fill out multiple e-mail addresses of contacts when creating the inquiry.", "idea_text": "*English follows Japanese■Title(件名)：問合せ時に連絡先のメール アドレスを複数入力できるようにしてほしいAllow us to fill out multiple e-mail addresses of contacts when creating the inquiry.\n***************\n■Description(内容):\n問合せ時に連絡先のメール アドレスを複数入力できるようにしてほしいI hope  you to improve the system that allows us to fill out multiple e-mail addresses of contacts when creating the inquiry.Thank you for your consideration.", "author": "761183893", "created_at": "2018-03-06", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34698070-resend-a-campaign-to-addressees-who-haven-t-opened", "header": "Resend a campaign to addressees who haven't opened the email", "idea_text": "It would be useful to be able to resend a campaign to only those people who haven't yet opened the email.", "author": "818056369", "created_at": "2018-06-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/36366190-when-ever-new-user-created-in-o365-tenant-new-user", "header": "When ever new user created in O365 Tenant,new user has to get an email to his office mail id or else customized mail ID.", "idea_text": "When ever new user created in O365 Tenant,new user has to get an email to his office mail id or else customized mail ID.", "author": "876342205", "created_at": "2018-12-24", "votes": 1, "reaction": [], "comments": [{"author": "876795754", "created_at": "2018-12-24", "text": "Its nice, When Admin created new user, Insted of sending manual email to user. user will get the welcome message from tenant automatically."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/31653046-made-for-the-ipad-pro", "header": "Made for the iPad Pro", "idea_text": "Can you optimize the Connections app for the iPad Pro? Would like to use it but not on a small device like the iPhone. Would get a lot more use of the app on the iPad.", "author": "676151218", "created_at": "2017-09-27", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-03", "note": "Thanks for this feedback. We will consider making an optimized app for iPad Pro for a better big screen experience."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32504887-replied-to-mailouts-not-going-to-shared-mailbox", "header": "Replied to mailouts not going to shared mailbox?", "idea_text": "Am I correct in thinking that we cannot set the 'reply-to' field in the mail sendouts? At the moment we have marketing mailouts that seem to be replying to the user logged in to 365 to send them and it doesn't seem there is a way of setting an valid alternative send-from or reply-to e-mail address?", "author": "713892400", "created_at": "2017-12-04", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-02-09", "note": "Yes, that’s correct. You cannot currently set the Reply-to field. Replies go to the individual who sent the email.  Would you prefer to have a shared mailbox?  It would be great to hear more about your needs there.  We have considered allowing for more flexibility around Reply-to, but we started with something simple that wouldn’t require another mailbox to be checked or managed."}], "comments": [{"author": "398985916", "created_at": "2018-02-09", "text": "Also, thanks for the additional note. We've fixed that typo."}, {"author": "713892400", "created_at": "2017-12-06", "text": "Unrelated, but also there is a typo at the top of this page, \"Give us some ideas or suggetions to improve!\" should read, \"suggestions\".I hope someone can confirm either way on the 'send-from' issue though."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/32585452-when-will-it-be-available-in-latin-america", "header": "When will it be available in Latin America?", "idea_text": "", "author": "724273603", "created_at": "2017-12-11", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-02-22", "note": "We’re currently available in the US, UK and Canada and we’ll look to expand to more regions in the coming months. When more information on geographic expansion becomes available, we’ll post it on the Office 365 public roadmap at . Thanks for creating this comment so we know you’re interested in having the product available in Latin America!"}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33792766-auto-unsubscribing-bug-in-connections", "header": "Auto-unsubscribing bug in Connections", "idea_text": "I run a mailing list in Connections and noticed a much larger than average percentage of users unsubscribed. Some of these in the months that followed then telephoned and complained they hadn't got our mailout. In discussion and sessions with support, it appears as though if ever an email is not successfully sent to (for example, inbox full etc), the contact is auto-unsubscribed, or so it seems.I know from past mailout uses (constant contact for example), that some contacts return email not successfully sent, but in fact they have got them when you speak to them about it. Constant contact did not unsubscribe these Contacts so my suggestion is Connections should maintain the mailing list and only remove if the contact or admin change the status.I now have to go through over 250 unsubscribed contacts and decide which ones are 'mistakes' and which ones were self-removed by the contact as there seems no bulk way of reinstating all but the genuine unsubscribers.Until this is fixed, I probably have to use another mailing system in order that our mailing list is preserved correctly.", "author": "713892400", "created_at": "2018-03-29", "votes": 1, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2018-03-30", "note": "We’re investigating this issue and we’ll reach out to you via email so we can work with you to understand what’s gone wrong.The intended behavior is to unsubscribe users when the email provider responds with a permanent errors — for example, when the email provider tells us the email address does not exist.  We’re taking this step to protect your spam reputation with that email provider, since some providers penalize senders who send to addresses that don’t exist.However, this should not be unsubscribing users who experience temporary issues (like their mailbox is full), and we will investigate why your subscribers with valid email addresses were unsubscribed.  Thank you for all the information you provided to help us take a look."}], "comments": [{"author": "713892400", "created_at": "2018-03-29", "text": "Further information: I can send a single e-mail from my 365 managed e-mail domain to a contact successfully. The recipient can read the e-mail. When I send to that same contact via a Connections mailing, it fails to send and returns \"The e-mail to <recipient's e-mail> was rejected by the recipient's e-mail provider.\" I once again try to send a single e-mail and it is successful, just not via the Connection mailing.This seemingly auto unsubscribes the contact from the mailing list.\n"}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33914545-can-we-import-contacts-from-dynamics-366-into-micr", "header": "Can we import contacts from Dynamics 366 into Microsoft Connections?", "idea_text": "It doesn’t appear that there is any ability to import contacts from Dynamics 365 into Miscrosft Connections. In Dynamics 365 we now have the ability to create unique contact lists. And because Dynamics 365 and Microsoft Connections are together in the same platform you would think and expect that this capability would naturally be made available. ", "author": "406763098", "created_at": "2018-04-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34323309-office-365-graph-content-pack-in-power-bi-and-data", "header": "Office 365 Graph Content Pack in Power BI and Data Connector in Flow/Power Apps", "idea_text": "Office Graph Data is extremely valuable. Being able to access it in Power BI, Flow and Power Apps is hugely valuable. It's possible with custom connectors/home brew now. It needs to be available to power users without code.", "author": "789975898", "created_at": "2018-05-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33320350-when-will-it-be-available-in-france-we-have-offi", "header": "When will it be available in France ? We have Office Business Premium, with the monthly updates, but do not have access yet to Connections", "idea_text": "When will it be available in France ? We have Office Business Premium, with the monthly updates, but do not have access yet to Connections", "author": "755554912", "created_at": "2018-02-14", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-02-22", "note": "Thanks for letting us know you’d like to see Microsoft Connections available in France. We’re currently rolling out in US, UK and Canada and we’ll look to expand to more regions in the coming months. When more information on geographic expansion becomes available, we’ll post it on the Office 365 public roadmap at ."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/33418936-allow-embedding-of-video", "header": "Allow embedding of video", "idea_text": "Hello,Please allow embedding of video directly onto new and existing templates.Thank you.", "author": "759292543", "created_at": "2018-02-22", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-02-22", "note": "We’d love to know more details if you have a chance to add a comment to this suggestion. Will the video be the primary focus of your email campaign, or are you mostly planning to use the video as supporting content for your main image and text?"}], "comments": [{"author": "759292543", "created_at": "2018-02-23", "text": "Thank you for the quick response. I'm looking at sending personalized video messages to my clients. This could be on its own or in addition to supporting content. It would be nice to have that option. For example, a personalized video to one of my clients thanking them for their business or a video to a group of clients interested in a particular product or service. In both situations, I would like the ability to add images, links and texts just as it is in email campaigns currently or send them solely as just videos. Thank you."}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34827541-a-future-for-all-projects", "header": "A Future for all. projects", "idea_text": "Perché nn create un computer che cresce in base all eta di chi lo utilizza,  man mano che il bambino cresce il pc si aggiorna aggiungendo contenuti in base all eta di chi lo utilizza..stessa cosa in per le persone anziane piu si diventa anziani piu si ingrandiscono i caratteri più si semplifica con programmi pre istallati. Che...contattami se volete l intero plan..", "author": "823639108", "created_at": "2018-07-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35067205-contactos-en-bandeja-entrada-y-nombre-remitente-co", "header": "CONTACTOS EN BANDEJA ENTRADA Y NOMBRE REMITENTE COGER EL DE AGENDA", "idea_text": "Hello everyone,\nmy suggestion is:In the inbox, the sender name that you see should be able to be changed by the name you have recorded in the contacts or calendar.\nAll other email management programs do it and on cell phones as well.\nMore than anything that many times you have to decipher email that we know where it comes from and if it is a contact that you already have established.Waiting for you to implement it.Thank you very much", "author": "832320637", "created_at": "2018-08-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34482166-contacts-filter-for-those-not-on-a-mailing-list", "header": "Contacts filter for those not on a mailing list", "idea_text": "Within contacts you can filter in various manners but cannot filter those that are not on a mailing list so that you can allocate accordingly, or mailing list specific. Those not on a mailing list may have signed up via the 'sign up page' in Connections but you will have no idea who has signed up. So suggested filter options in Contacts:Contacts not on a mailing list.\nNew contacts, added within last 30 days.\nMailing list specific.Plus notification by email of new sign ups (an option to turn this off should be included as some might receive excessive notifications)\n", "author": "714389113", "created_at": "2018-06-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/20017258-any-way-to-talk-with-the-someone-from-new-connecti", "header": "Any way to talk with the someone from new Connections Email tool department?", "idea_text": "My product, NiftyImages.com offers personalized image and countdown timers that integrate into all current email platforms and we would like to make sure your Connections clients can use our tool as well. Some early access for testing or integration talks would be great!", "author": "410690251", "created_at": "2017-07-10", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-09-26", "note": "Hi Kevin, thank you for your interest! Right now we’re not looking into partner features—we want to make sure our core scenarios are well-oiled. We have taken note of your request, and our Business Development team will reach out to you in the future when we get to the stage of evaluating partnership opportunities. Thanks again!"}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/34420210-where-can-i-find-somewhere-to-complain-about-the-n", "header": "WHERE CAN I FIND SOMEWHERE TO COMPLAIN ABOUT THE NEW SET UPON THE MAIL PAGE?", "idea_text": "RETURN TO OUTLOOK  EMAIL ORIGINAL SET UP PAGE, NEW ONE READING PANE TOO SMALL, PRINT TOO SMALL, DIFFICULT TO FIND MESSAGES IN 'JUNK' and 'SENT. ", "author": "792898708", "created_at": "2018-06-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35195719-what-is-the-limit-wrt-the-number-of-emails-that-ca", "header": "What is the limit wrt the number of emails that can be sent at once?", "idea_text": "I have a mailing list of over 30k people who have all opted-in to receive my monthly emails. We are considering a move from Mailchimp to Connections. Can I send my emails through MS Connections?", "author": "840132511", "created_at": "2018-08-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/37071322-aol-backup-tool", "header": "AOL backup tool", "idea_text": "To take backup of AOL mailboxes, you can try any of the methods as several solutions are available for this. But the user should make the selection on the basis of data safety and their ease. Some solutions are available but they are not safe that’s why we recommend you to download free AOL Backup software. for more detail visit here: \n", "author": "888111022", "created_at": "2019-03-11", "votes": 0, "reaction": [], "comments": [{"author": "873344128", "created_at": "2019-03-29", "text": "Try best ZOOK AOL Backup Tool  to download AOL emails to local PC or flash drive. It easily export AOL email folders and email account to Outlook PST, Thunderbird, Yahoo, Gmail, Zimbra, PDF, and 15+ file options. More Info, Click Here "}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35402056-unable-to-access-shared-mailbox-via-typing-full-em", "header": "Unable to access shared mailbox via typing full email address", "idea_text": "when I try to input full email address on \"Open other mailbox\" on OWA. unable to open shared mailbox. I believe that open other mailbox blank rely on GAL search result. ", "author": "850357672", "created_at": "2018-09-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35904532-visio-should-be-included-app-for-e3", "header": "VISIO should be included app for E3", "idea_text": "my business subscribes to Enterprise 3 MS Office. Upon learning that VISIO is an extra application for purchase i was stunned at how MS makes money but small business can't at this rate. Make VISIO a full function online and desktop inclusion for E3 users", "author": "866155141", "created_at": "2018-11-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35681758-suggest-to-develop-an-approval-required-process-if", "header": "suggest to develop an approval required process if someone sends an email to more than some limited recipients.", "idea_text": "suggest to develop an approval required process if someone sends an email to more than som", "author": "857207278", "created_at": "2018-10-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35786122-outlook-email-address-extractor", "header": "Outlook Email Address Extractor", "idea_text": "Outlook Email Address Extractor is powerful software designed to collect email ids from Outlook account. ", "author": "861064630", "created_at": "2018-10-21", "votes": 1, "reaction": [], "comments": [{"author": "879272317", "created_at": "2019-01-15", "text": "Hello everyone, if you are outlook user then this information was for you just because if the situation comes that you have to extract  outlook files like  attachments, calendar, contacts, email in a various format so  I would like to suggest a smart and intelligent software that can save you from this situation outlook\nvisit here: \n"}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/36192931-hi-is-there-a-way-to-test-trial-mode-microsoft", "header": "Hi, is there a way to test (trial mode) Microsoft Connections before deciding to upgrade to Office365 Business Pro from the standard suite?", "idea_text": "At the moment our organization has the Office365 Business plan, from the Business Pro plan we're interested to test Microsoft Connections as a solution for sending out newsletters. Is there a way to test Connections before upgrading the plan? Many thanks!", "author": "874228444", "created_at": "2018-12-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/36273685-gmail-email-extractor", "header": "Gmail Email Extractor", "idea_text": "Perfect gmail email address software to easily collected all gmail, outlook and yahoo email addresses successfully. Try free demo ", "author": "875416654", "created_at": "2018-12-13", "votes": 1, "reaction": [], "comments": [{"author": "902954104", "created_at": "2019-05-29", "text": "Gmail is one of the most Common web based email program that help to Send receive email and message. If you are using the Window Operating System then there is no problem in taking a backup of your Gmail emails in your local system you can just download the Gmail Backup software for making your work simple and quickly finish. This utility is very much reliable and supports all window versions.\nMore info Visit here: "}, {"author": "888652615", "created_at": "2019-03-14", "text": "Try Gmail backup tool for creating the backup and save it to hard drive with PST, EML, EMLX,MBOX, MSG file format that makes emails secure and for more detail visit here: "}]}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/35385511-retiring-connections-will-cause-me-to-discontinue", "header": "Retiring Connections will cause me to discontinue my MS O365 Business plan, guess we have to go back to MailChimp. Shame on you Microsoft.", "idea_text": "Retiring Connections will cause me to discontinue my MS O365 Business plan, guess we have to go back to MailChimp. Shame on you Microsoft. Get us hooked on your product then discontinue it...that's poor business practice.", "author": "848786797", "created_at": "2018-09-12", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600610-microsoft-connections-email-marketing/suggestions/36825589-error-either-there-is-no-email-client-or-the-cur", "header": "Error- \"Either there is no email client or the current mail client canot fulfill the messaginf request. Please run Microsoft Outlook..", "idea_text": "User get the error- \"Either there is no email client or the current mail client cannot fulfill the messaging request. Please run Microsoft Outlook and set it as the default mail client.\" while previewing the .msg files in the Preview Pane enabled under File Explorer. \nWe have Win 10 Enterprise 64-bit OS on which we are using the Office(Outlook) 2016 64-bit and though Outlook is already a default mail client still user is getting this error. While troubleshooting this issue I found that other file types are being previewed with no issues other than .msg files also when I tried to reproduce the issue on my system with same configuration I have the same error when I enable the Preview Pane enabled under File Explorer. \nWhile searching on MS sites for KB's related to this, I found below KB-Where I got a false workaround and not a exact fix for Outlook 64-bit on Win10 64-bit.False because, to support many O365 features Microsoft itself asks to have the latest 64-bit Office on WIn10 64-bit OS. And as per above KB MS is asking user to use below workaround-Method 2: Use 32-bit OutlookOr Method 1: Disable the Windows Explorer Preview Pane, and open the .msg file to view it in Outlookwhich is not good as it will disturb some other O365 features when we downgrade the Office to 32-bit as per the MS suggestion.\nEven other method is not useful as it's hampering users productivity badly.Please have a permanent fix/resolution for the same and not any false workaround as it's already been almost five moths when above KB was last updated- as per (Last Updated: Sep 18, 2018 ).In addition the support staff here in this opened case is putting more efforts in closing this case as of now mentioning the preview for .msg files is not available with Outlook 64 bit by giving reference of same KB given by me while raising this MS Case# [Ticket #:13054236] and not involving the product Development Team to have the required product development to support the .msg preview feature in Outlook 64-bit.Expecting the involvement of further/higher Team to get this resolved with tentative ETA for the resolution on this.Thank You,\nAtish Kamble\nTCL-IT\nMB: +918983643531\n", "author": "883945975", "created_at": "2019-02-12", "votes": 2, "reaction": [], "comments": [{"author": "916559329", "created_at": "2019-08-29", "text": "Still nothing not in August 2019.  Same issue.  It's ridiculous that Microsoft won't support their own software in 64-bit in 2019!"}]}
