{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32270230-use-the-date-format-from-settings", "header": "Use the date format from settings", "idea_text": "The date on invoices is in US format - MM/DD/YY - even though I have my location correctly set as UK. I think is a bug rather than a feature but it needs to be fixed as customers are given a date which can have an impact on when they pay.", "author": "710687908", "created_at": "2017-11-15", "votes": 16, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2017-12-05", "note": "Sorry for the delay in getting back to you on this issue. We’re currently investigating why you are seeing the US date format."}, {"status": "tell us more", "author": "398985916", "created_at": "2017-11-16", "note": "Hello, and thank you for your feeedback. The date format is intended to be inherited from the settings, but a couple of things can interfere with that. For example, if you are using a computer that has US regional settings, then that can influence how data is presented, even if you are in the UK.\nWe’re investigating further on our end, but can you check and see if your browser is listing US as the preferred language for example?"}], "comments": [{"author": "776774713", "created_at": "2019-08-09", "text": "We have the same issue with Excel Online using US date format which is confusing our users especially when they have created the spreadsheet in Desktop version of Excel 365 which formats UK dates correctly...then there's the time zone issue with SharePoint always using PST when we are GMT"}, {"author": "893548165", "created_at": "2019-04-09", "text": "Hello, I have the same problem. The date stamped on the e-mail of the invoice is in US format. Could you please change it to UK for me, or advise how it can be done?\nMy online profile regional settings are set to English (UK)."}, {"author": "766395052", "created_at": "2018-03-13", "text": "Date format doesn't work on 365 whatever you do. Everything comes up in the US format. You'd think that date is one of the simplest things excel should be able to handle. Scandalous. "}, {"author": "763506346", "created_at": "2018-03-06", "text": "I get exactly the same problem and my language and keyboard layout is set to UK in Windows and in my browsers. Are there any updates on this issue ?"}, {"author": "711931657", "created_at": "2018-01-30", "text": "Are you ever going to fix this? Invoicing is of no use until you do. "}, {"author": "711931657", "created_at": "2017-11-18", "text": "Further information on this. In the invoices list, the dates are shown in the correct local format - DDMMYY in this case - but the invoices editing screen shows the US format - MMDDYY - as do the invoices themselves when sent to the customer. So it looks like the settings are being picked up but are not being applied correctly."}, {"author": "711931657", "created_at": "2017-11-17", "text": "Thanks for responding. I don't thing Edge has separate browser language preferences as far as I can see? All the setting I can find - Office 365, Business Center and Windows 10 Control Panel are correct. Also, the same issue is happening when I create an invoice in iPhone app. It would be very much appreciate it if you could fix this, as it the date confusion makes Invoicing pretty much unusable. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32000080-allow-integration-with-xero", "header": "Allow Integration with Xero", "idea_text": "You have integration with Quickbooks. Integration with Xero would be nice as well. Xero and Office 365 already play pretty nice together. Thanks!", "author": "689962489", "created_at": "2017-10-24", "votes": 14, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-02", "note": "Thank you for your feedback. We’ve added it to the list of things to consider for future update."}], "comments": [{"author": "786653578", "created_at": "2018-05-13", "text": "They haven't done it yet. That's disappointing"}, {"author": "299782012", "created_at": "2017-11-24", "text": "Shaun - I would rather have integration with flow.microsoft.com and have Xero work with flow... Would that work for you?\n"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32165905-add-notes-field-per-line-item", "header": "Add notes field per line item", "idea_text": "Add a free from field that allows end user to enter in additional information about the item. ", "author": "706471228", "created_at": "2017-11-07", "votes": 25, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-14", "note": "Thank you for your feedback! We’re thinking about adding this type of flexibility to the invoice template in a later update."}], "comments": [{"author": "876508912", "created_at": "2018-12-21", "text": "I agree, line notes is just as valuable as header/footer notes."}, {"author": "866096095", "created_at": "2018-11-12", "text": "Yes, please!!!  We need to add a whole second customer info panel in order to bill a third party.   Also, we need fields for P.O. numbers and Work Order numbers.\nPlease consider adding the flexibility to customize both the customer info area and the invoice fields themselves. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32718283-add-payment-term-net-30-days", "header": "Add Payment Term NET 30 DAYS", "idea_text": "I was trying to use the service, but the Term most used with my customers are Net 30 Days but is not available.  When I try to update or type the value in the box, the system produces an error message and not allow to continue.  Net 30 Days is the payment term most used in my industry.  Thanks!", "author": "729413887", "created_at": "2017-12-23", "votes": 22, "reaction": [{"status": "in the plans", "author": "398985916", "created_at": "2018-01-17", "note": "Thank you for your suggestion! We’re currently working on adding this capability and expect to make it available to you in February or March."}], "comments": [{"author": "909666178", "created_at": "2019-07-04", "text": "2011 EU Payments Directive it is 30 Days for SME for Invoice Settlement so a requirement before rolling out in the EU"}, {"author": "876508912", "created_at": "2018-12-21", "text": "Confirmed this feature is currently implemented."}, {"author": "747773197", "created_at": "2018-01-30", "text": "Would also like net 30! Hope it comes soon."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32043073-allow-unit-price-to-be-excl-vat", "header": "Allow unit price to be excl. VAT", "idea_text": "Unit price is shown inclusive of VAT but invoice should have ability to show prices exclusive too. Column in sent invoice for unit price doesn't indicate that price is inclusive. Simple solution is for unit price to be exclusive and Line Amount is inclusive. \nMore flexible solution is to have option to show unit and line item as inclusive or exclusive and ensure column header indicates incl. or excl.", "author": "700491799", "created_at": "2017-10-27", "votes": 22, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-02", "note": "Thank you for that suggestion! We’ve added it to our list of things to investigate further for our European customers."}], "comments": [{"author": "904329562", "created_at": "2019-06-05", "text": "Totally agree guys! This causes me a lot of problems with clients! I am already looking for a new system"}, {"author": "901611589", "created_at": "2019-05-21", "text": "It’s shame this still hasn’t been sorted"}, {"author": "891676246", "created_at": "2019-04-02", "text": "Has this been sorted yet?"}, {"author": "885113164", "created_at": "2019-02-20", "text": "I only chose the office 365 option on my go daddy subscription so that i could use the invoicing system, but as the other comments have said this invoice system without the ability to separate the VAT element is not fit for purpose in the UK. I am shocked that this hasn't been incorporated and annoyed that I have now have a system I opted and paid for is useless to me and my business. Please address this issue with the utmost urgency, if you wish to regain customer confidence in your product.   "}, {"author": "884015743", "created_at": "2019-02-12", "text": "Hi Small Business Team,Are you any closer to implementing the idea and a comments from other users? They are all absolutely correct and you need to do this ASAP if you want UK users to use this service. People will know soon that the service is not fit for purpose in the UK if you do not resolve the issue soon. We need:Net Total £100\nVAT @ 20% £20\nTotal including VAT £120"}, {"author": "883015855", "created_at": "2019-02-05", "text": "This is a real problem in the UK as most customers wish to see day rate or unit price exclusive of VAT followed  by the quantity and the total - one times the other. Then at the foot, the VAT rate applied with a subtotal for VAT applied to the subtotal of the  invoice lines and a grand total being the sum of the two. Most packages do it this way and most customers will not accept a VAT inclusive line item with no exclusive rate shown."}, {"author": "725804036", "created_at": "2017-12-14", "text": "This is also what I have been asking Customer services, In business to business you don't show prices with VAT, or at least one column without VAT. My customers wont accept it as they would have to deduct the VAT to see the true cost. \n"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32193655-be-allowed-to-edit-the-automated-email-currernly", "header": "Be allowed to edit the automated email. Currernly reads \"Hello x\" and it would like the option to change that to \"Dear x\"", "idea_text": "", "author": "706985968", "created_at": "2017-11-09", "votes": 23, "reaction": [{"status": "in the plans", "author": "398985916", "created_at": "2017-11-14", "note": "Thank you for your feedback! We have this on our list of capabilities to consider for a later update."}], "comments": [{"author": "876508912", "created_at": "2018-12-21", "text": "It's a little concerning the admin hasn't updated this page since 11/2017. I confirm this feature is already available. You can edit the automated estimate and invoice email."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33664762-integration-with-outlook-customer-manager", "header": "Integration with Outlook Customer Manager", "idea_text": "Contacts management should be integrated with Outlook Customer Manager.  And Invoicing events and tasks appear in OCM history.", "author": "767660227", "created_at": "2018-03-17", "votes": 28, "reaction": [], "comments": [{"author": "878276479", "created_at": "2019-01-04", "text": "Please integrate Microsoft Invoicing with Outlook Customer Manager (or create a Flow template). When an estimate or invoice is sent, ideally, a new deal will be recorded in Customer manager. This would be a great way to bring the apps together. Integration is key."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32025457-please-consider-releasing-to-the-rest-of-us-soon", "header": "Please consider releasing to the rest of us soon.", "idea_text": "I have been monitoring this page hoping to see a release date or “hoped for” time frame but haven’t seen one. Any idea how much longer?", "author": "700343197", "created_at": "2017-10-25", "votes": 36, "reaction": [{"status": "in the plans", "author": "398985916", "created_at": "2017-11-02", "note": "Thank you for your keen interest – we are working to expand our offering to other countries and regions and will share timelines as we get closer to those dates."}], "comments": [{"author": "915166120", "created_at": "2019-08-18", "text": "\"Microsoft\"  answered 2017-11-02 (!!!!!!!!!)\nToday: 2019-08-18That is more than 1,5 years.Cite: \"... and will share timelines as we get closer to those dates.\"Seems more like: we will not do it and will not tell you ..."}, {"author": "910982023", "created_at": "2019-07-16", "text": "Hmmmm……. quite here…… no News on MS Invoicing available in Germany ??@MS: Please share new Information, timeline, Roadmap or let us know if you are planing not to provide it in Germany."}, {"author": "904250863", "created_at": "2019-06-04", "text": "Would be nice to have it in Germany. See, we are paying for Office365 as well. As a solopreneur I do not benefit from all these teams functions. But the business center options would be really helpful."}, {"author": "352365052", "created_at": "2019-03-27", "text": "More than a year went by now and still no info?"}, {"author": "878981053", "created_at": "2019-01-09", "text": "Any updates for EU yet ?"}, {"author": "860173180", "created_at": "2018-10-18", "text": "Still no news..."}, {"author": "859640071", "created_at": "2018-10-17", "text": "Almost 1 year has passed......"}, {"author": "752085787", "created_at": "2018-03-10", "text": "Any news?"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32590625-allow-for-deleting-a-cancelled-invoice", "header": "Allow for Deleting a Cancelled Invoice", "idea_text": "Cancelled Invoice stay forever right now. There should be an option to delete.  Also cancelled invoice appear in the Dashboard along with all other invoices which doesn't make sense.", "author": "722405248", "created_at": "2017-12-11", "votes": 62, "reaction": [], "comments": [{"author": "919439506", "created_at": "2019-09-11", "text": "Definitely need to add archiving to invoices.  Small business's will play with a feature before going live with customers to understand how it works.  Archiving off old / bad data would make things much cleaner"}, {"author": "896851090", "created_at": "2019-04-25", "text": "There was a problem with me and no one can modify it and keep its value higher than the products. This is very bad. There are companies that charge less than Microsoft"}, {"author": "352365052", "created_at": "2019-03-27", "text": "I can totally understand the inconvenience factor. For compliance reasons, the deletion of invoices should definitely not be possible.However, a hiding option would make sense."}, {"author": "878336740", "created_at": "2019-01-04", "text": "totally agree.  Am now not going to switch until such time that I can delete invoices.  "}, {"author": "878276479", "created_at": "2019-01-04", "text": "Dashboard is a mess due to test invoices. I would like to be able to remove these as I don;t want to see the test invoices anymore. Please add this feature. "}, {"author": "877666792", "created_at": "2018-12-31", "text": "could you please add a feature to delete old invoices "}, {"author": "876508912", "created_at": "2018-12-21", "text": "I've been testing the software and now have test customers and invoices which clutter my legitimate list.I understand for compliance you shouldn't be able to delete invoices and invoiced customers, but there should at least be an archive option to remove from plain view."}, {"author": "874291132", "created_at": "2018-12-05", "text": "Can we please have this feature please??? "}, {"author": "866758105", "created_at": "2018-11-05", "text": "100% agree with this, there needs to be an option to delete cancelled invoices. There is no point in keeping them or even the line items in them that have been reformatted."}, {"author": "864916351", "created_at": "2018-11-01", "text": "Same boat as everyone else.  While learning the new application I created test invoices that I can't delete now.  Please add the ability to delete an invoice."}, {"author": "855535579", "created_at": "2018-10-04", "text": "As with the others on the forum, I've got several test invoices, test customers and test product lines that need to be deleted but can't because they are being used in my canceled test invoices.  This is a mess and I had no idea when I wanted to take this app for a test drive that I couldn't undo any of it.Please add the ability to delete these."}, {"author": "840891760", "created_at": "2018-08-24", "text": "Same experience as the others: a bunch of test invoices lingering around..."}, {"author": "828657073", "created_at": "2018-07-31", "text": "Yes I agree.  This is a needed feature.  I too created a bunch of test invoices before integrating into my business.  Seeing all these test invoices, even if they are cancelled is annoying. "}, {"author": "827843761", "created_at": "2018-07-27", "text": "Please I want that feature too!!!"}, {"author": "790211167", "created_at": "2018-05-23", "text": "could you please add a feature to delete old invoices "}, {"author": "783126466", "created_at": "2018-05-02", "text": "please add an edit button too"}, {"author": "783126466", "created_at": "2018-05-02", "text": "this is a must"}, {"author": "782719624", "created_at": "2018-05-01", "text": "I definitely need this. Like the others, I wanted to play with the app before actually using it for my customers. Not knowing, I wouldn't be able to delete them, I made a bunch of test invoices and now I have test products that don't exist and customers that don't exist and I cannot delete them because they are in an existing invoice and my dashboard is messed up. "}, {"author": "776476291", "created_at": "2018-04-12", "text": "Absolutely.  Should be an option to delete an invoice.  "}, {"author": "772400257", "created_at": "2018-03-31", "text": "Please allow this for the admin of the site.  I setup a few test invoices to see how this worked.  Now I can't delete pricing components because they say they are included in an existing invoice (the cancelled ones!!!).  "}, {"author": "747767842", "created_at": "2018-01-30", "text": "YES YES PLEASE ALLOW THIS (in caps).  I'm learning how to use this app and setup a bunch of test invoices and now my dashboard is a mess.  I'm on with a nice gentleman at microsoft support and he is trying to figure it out but it doesn't sound easy (or intuitive).  Let's please make this easier.  I'm so excited for this functionality but my production site is my playground so we need the ability to do some test \"hygiene.\""}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32178478-more-information-to-be-added-to-template", "header": "More information to be added to template", "idea_text": "Have the ability to add a greater volume of information to the template and being able to remove lines such as the \"make cheques payable\".  ", "author": "706985968", "created_at": "2017-11-08", "votes": 29, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-14", "note": "Thank you for your feedback!  You’re not the first to ask for this, and we’re still thinking about adding it in a later update if interest increases."}], "comments": [{"author": "878879377", "created_at": "2019-01-11", "text": "I put this in the \"notes\"."}, {"author": "840891760", "created_at": "2018-08-24", "text": "Any news on this? It's been a year and it's a really basic + critical feature.Custom fields are a must.Example no1)\nHere in Quebec, we need to display our tax numbers + registered contractor numbers on our bills.\nCurrently, there is no professional way to add this information.Example no2)\nI deal with municipal clients, whom use Order Numbers and Supplier Numbers.\nI need to add that information to each invoice, and again... there's no way for me to add this information.The current work-around is to create a Product with 0 price for it.But it makes it look pretty unprofessional!"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33876163-email-invoice-to-multiple-client-addresses", "header": "Email invoice to multiple client addresses", "idea_text": "Several of my clients require that I address the invoice to multiple email addresses (or to CC additional individuals) with each Invoice.  Currently, I can only get the Invoice service to address the invoice to one external email address.Please add the ability to add CC and BCC recipients for each contact in the same way that we can currently set CC and BCC recipients for within our own organization.", "author": "710747901", "created_at": "2018-04-06", "votes": 33, "reaction": [], "comments": [{"author": "877991392", "created_at": "2019-06-09", "text": "This is a common need for me also, especially when invoicing smaller businesses, but it happens to be needed with huge international firms with many divisions. For example I send my invoices to the invoicing department located in Asia and payments come from there too. My actual USA client, a specific program manager, wants to be notified and have a copy of the invoice also. "}, {"author": "878879377", "created_at": "2019-01-08", "text": "We need the same."}, {"author": "848246746", "created_at": "2018-12-21", "text": "This would be a wonderful thing to have since most customers have several email addresses."}, {"author": "876508912", "created_at": "2018-12-21", "text": "Currently you can only setup an internal Cc and Bcc. We should have the option to send to at least two external addresses.My current workaround is when I send the invoice, I use the \"internal\" Cc to send to my external client. The down side isi must go back into my settings and remove it afterwards."}, {"author": "710747901", "created_at": "2018-04-06", "text": "I should say that currently I'm having to send the invoice and then forward the copy that I receive in my own email inbox as a CC recipient within my organization.  This is less than ideal as it requires a number of additional steps (access email, add recipients, forward, etc.) and it strips the formatting."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32306971-allow-for-disabling-of-vat-options", "header": "Allow for disabling of VAT options", "idea_text": "I am not a VAT registered business and, as such, I do not need my invoices cluttered with VAT (indeed, it makes them technically wrong as I have to mark everything as zero-rated to get the numbers right, even though that isn't quite accurate).I recognise that for many larger businesses VAT is a legal requirement, but maybe this feature could be added with suitable disclaimers to warn unsuspecting users.", "author": "712029001", "created_at": "2017-11-18", "votes": 44, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-12-05", "note": "Sorry for the delay in getting back to you on this! We will consider adding support for non- registered businesses. In the meanwhile, please contact your accountant to make sure you’re  exempt and they might advise about the feasibility of mark your service as zero rated in the app."}, {"status": "tell us more", "author": "398985916", "created_at": "2017-11-21", "note": "Thank you for your feedback! For us to better support you, can you share with us which line of business you are in?"}], "comments": [{"author": "898770760", "created_at": "2019-05-05", "text": "Has this been resolved??? Where is the option to switch off VAT for none-VAT registered small businesses?"}, {"author": "895174486", "created_at": "2019-04-17", "text": "yes this is really important!!"}, {"author": "894661177", "created_at": "2019-04-15", "text": "Zero rated and exempt are not the same in the UK. Your system simply doesn't work for companies that do not charge vat. It is illegal to use the zero rated option as this is an actual rate for certain goods and services.  If you don't enable disabling of this feature you are losing many customers because no proper business can use what you are providing.  On the other hand we can all use proper accounting software thst realises this is integral feature that needs to be on for some businesses iff for others and makes it simple for the end user to apply the setting relevant to them. "}, {"author": "893725516", "created_at": "2019-04-15", "text": "An option to Opt Out the VAT options or the ability to turn it off would greatly help our non-VAT registered Small & Medium Businesses users."}, {"author": "882319159", "created_at": "2019-01-31", "text": "Seem Microsoft are just not bothered... It has taken me 10 emails to explain what I am asking. They seem to think I am asking them to remove VAT from their invoices?!?! I don't think they even know what MS Invoicing is?!?! Anyway it fails to deliver on many levels and I have given up even trying to use the systemShame as it is handy within the ADMIN of OFFCE 365"}, {"author": "855440536", "created_at": "2018-10-04", "text": "Hi desperately need to be able to disable the VAT registration number fields on our invoices. We're using Zero rated as a work around in testing but we need to get this off...."}, {"author": "855072577", "created_at": "2018-10-03", "text": "Is there any update on adding support for non-Vat Registered businesses. We have just converted over to 365 Business Premium to avail of the invoicing system specifically and now we find there is VAT all over the invoice template which we cannot have. "}, {"author": "760546111", "created_at": "2018-07-05", "text": "Why is there still no progress on this? This is utterly ridiculous now.Microsoft builds a product aimed clearly at small businesses. It then leaves out a crucial option which means said product can't actually be used by small businesses.The comment from \"Admin\" above indicates Microsoft is still completely unaware of how VAT actually works for small businesses.It's not a case of \"VAT exempt\" or \"0% VAT\" - business owners like me are *not VAT registered*, and cannot issue invoices which contain references to VAT. It *is not enough* to issue an invoice displaying 0% VAT if you are not VAT-registered - the two are entirely separate concerns. If you are not VAT-registered, you can not display VAT on your invoice - it is as simple as that. There is no \"feasibility\" of marking your service as 0% if you are not a VAT-registered business.How is this so hard for Microsoft to understand? You just need to add an \"off\" button.... I find it hard to believe it's taking you over six months to do this. All it needs to do is obliterate every reference to VAT in the generated invoices... then Invoicing will finally be usable by what seems to be its core target audience."}, {"author": "711931657", "created_at": "2018-03-03", "text": "It seems bizarre that a service that is aimed at small businesses should have no provision for businesses that do not need to register for VAT. I’m wondering if the US development team appreciates that there is a threshold for VAT registration and businesses below this threshold do not register and cannot use a VAT invoice? This limitation is particularly incomprehensible as most businesses that are over the VAT threshold will probably have a full accounting package and won’t need this simple invoicing capability. "}, {"author": "712029001", "created_at": "2017-12-06", "text": "Many thanks - I shall do, but I'm not VAT exempt, I simply don't turn over enough to require VAT registration (nor am I working through a limited company).\nAlso - you might like to know that I found the email notification for this thread in my junk folder in Outlook for Mac."}, {"author": "712029001", "created_at": "2017-12-06", "text": "Many thanks - I shall do, but I'm not VAT exempt, I simply don't turn over enough to require VAT registration (nor am I working through a limited company).\nAlso - you might like to know that I found the email notification for this thread in my junk folder in Outlook for Mac."}, {"author": "712029001", "created_at": "2017-11-21", "text": "No problem, I am a web designer and full stack developer."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33259927-make-it-available-in-the-netherlands", "header": "Make it available in the Netherlands", "idea_text": "Please make Invoices available in the Netherlands. As I would like to use it, but it is not available.", "author": "753339229", "created_at": "2018-02-08", "votes": 40, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-02-12", "note": "Thank you for your suggestion! We’re working on a schedule for making Invoicing available in more markets."}], "comments": [{"author": "919204297", "created_at": "2019-09-10", "text": "Make it available to South Africa."}, {"author": "740954776", "created_at": "2019-08-30", "text": "Are you still thinking about it? No decision yet on when to enable this for The Netherlands? The platform is there, what is holding you back from enabling it? Please provide us some insights."}, {"author": "916560049", "created_at": "2019-08-29", "text": "Please make Invoicing available in Australia"}, {"author": "909942571", "created_at": "2019-07-08", "text": "Please make Invoicing available in Australia"}, {"author": "909666178", "created_at": "2019-07-04", "text": "Should be rolled out to Europe.\nBut then will this be another Product launched and then dropped by Microsoft?"}, {"author": "859640071", "created_at": "2019-07-01", "text": "It is available in portal.office.com but still states: \"not available in your country\" :-((Netherlands)"}, {"author": "908616178", "created_at": "2019-06-26", "text": "Is there any update about this? A public schedule for the new markets should be welcome."}, {"author": "907879627", "created_at": "2019-06-19", "text": "+1 for Australia!!"}, {"author": "733671154", "created_at": "2019-05-10", "text": "Make it availeble in ***************!"}, {"author": "898506238", "created_at": "2019-05-03", "text": "Is there allready a availability /rolluik planning for the Netherlands?"}, {"author": "897350479", "created_at": "2019-04-28", "text": "Please make available in Spain, this App is a great addition to the 365 suite "}, {"author": "891037252", "created_at": "2019-03-28", "text": "Please make it available in Australia too!"}, {"author": "878981053", "created_at": "2019-01-09", "text": "Please make Invoices available for EU tenants. My clients (and myself) would be really happy with this feature. "}, {"author": "878285938", "created_at": "2019-01-04", "text": "I would like to add my vote for this to be available in the Netherlands! Do you have an update for when Microsoft Invoicing will be available in the EU or Netherlands region?  I don't even need a language update, just the app, english would be great!"}, {"author": "872358862", "created_at": "2018-11-23", "text": "When will it be available in South Africa"}, {"author": "859640071", "created_at": "2018-10-17", "text": "Still quiet :-( \nWhen will Invoicing be available in NL?"}, {"author": "850414540", "created_at": "2018-09-14", "text": "Any updates?"}, {"author": "848797933", "created_at": "2018-09-12", "text": "Yes make it happen!"}, {"author": "816494926", "created_at": "2018-06-20", "text": "Is it possible to get invoicing in the netherlands?\n"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32441321-add-to-the-enterprise-offerings", "header": "Add to the Enterprise Offerings", "idea_text": "This seems like a great product to add to the Enterprise offerings not just Business Premium", "author": "717969121", "created_at": "2017-11-30", "votes": 12, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-12-05", "note": "Thank you for your feedback! Microsoft Invoicing is currently available only for Business Premium, but we might reconsider if more people like you are interested  in Enterprise plans."}], "comments": [{"author": "827552161", "created_at": "2019-02-12", "text": "This is maddening... We require E3 licensing as we use advanced Excel features, which precludes us from the Business plans which include Invoice and other features our small startup desperately needs.  Please add this into \"Business Apps (Free)\" that will allow company's in the same situation as us access to these vital services."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32304718-allow-different-currencies", "header": "Allow different currencies", "idea_text": "It would be good to be able to choose the invoice currency when creating an invoice. As Invoicing uses PayPal as its payment mechanism and PayPal is built to handle any currency, this shouldn't be too difficult to implement. Without this feature, we can only use Invoicing for domestic business, which greatly reduces its usefulness.", "author": "711931657", "created_at": "2017-11-17", "votes": 46, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-21", "note": "Thank you for your feedback! We’re thinking about supporting multiple currencies, but for the time being, you can only invoice your customers in your own currency. However, they can then pay PayPal in their own currency, so you can have customers outside your own country."}], "comments": [{"author": "926421085", "created_at": "2019-09-27", "text": "I Use bank transfer and dont use paypal"}, {"author": "894398800", "created_at": "2019-09-09", "text": "This is really a must-have feature for any business in Europe"}, {"author": "909672760", "created_at": "2019-07-05", "text": "We really need this function! For European customers, I have to issue the invoices in Euro. "}, {"author": "909269467", "created_at": "2019-07-01", "text": "This makes this completely useless for any modern online business which supports pricing in different currencies, how ridiculous that almost two years later you still haven't figured it out."}, {"author": "899016853", "created_at": "2019-06-24", "text": "To be able to invoice in different currencies is a MUST for this system. I have customers in different countries and have to invoice them in their own currencies."}, {"author": "902255449", "created_at": "2019-05-25", "text": "Likewise, really need to invoice in euros but everything is set to pounds which isn't accepted by our customer."}, {"author": "893697385", "created_at": "2019-04-10", "text": "I'd like to see this also. The PayPal 'workaround' isn't useful at all. I need to send invoices for professional services worldwide in multiple languages and currencies. Zervant offer this service for free, I was exploring moving my invoicing to O365 as I already pay for it but without this it's useless. "}, {"author": "892080208", "created_at": "2019-04-03", "text": "This should be simple: in the payments section of the settings function, we have the option to enter different payment instructions.  Just let us select which instruction to use when creating each invoice rather than make one of them a default.  For international users trading in different currencies, if we don't have this functionality then the entire App is completely useless."}, {"author": "885583984", "created_at": "2019-02-23", "text": "As a translator, I have clients all across the globe. At least for European clients, invoicing them in their local currency is absolutely paramount. The PayPal workaround is useless to me because a) PayPal currency conversion rates are abysmally bad compared to banks, and b) I would add the whole new hassle of having to manually stay on top of daily current rates to adjust and convert my unit pricing.\nLastly, it is kind of ironic to point to PayPal as a \"workaround\" when PayPal itself offers relatively sophisticated SMB invoicing features.Invoicing from within Office would have been the USP that would have made me buy a 365 subscription, until I can use it with different currencies I will stick with my \"local\" non-subscription Office installation."}, {"author": "882703978", "created_at": "2019-02-03", "text": "This is a required feature, your workaround of using PayPal is not sufficient as I need the invoice to be issued in the customers currency. Not for example invoiced in GDP and then converted to say USD. If the contract is for a set USD amount that is what I need to bill in."}, {"author": "873068380", "created_at": "2018-11-27", "text": "Unusable without multi currency invoicing. We trade globally and with different legal entities that trade and invoice in different currencies. This is basic and completely hobbles the tool without it."}, {"author": "832933090", "created_at": "2018-08-10", "text": "I just discovered that the multi-currency invoicing feature is not available in MS Invoicing. Unbelievable! Why. on the other hand, in the Business Centre Settings, you can select any currency, if it is not taken over in the Invoice too??? This really needs to be updated, it's completely ridiculous and there can't be a logic reason behind the lack of this feature. thank you."}, {"author": "818862103", "created_at": "2018-06-28", "text": "Hi there, it would be great to add this.  I need to be able to invoice in different currencies and would prefer to use Business center.  I won't until this feature is added."}, {"author": "806874844", "created_at": "2018-06-14", "text": "Would it be possible to add in a feature where I can track/log my accounts payable side of the business? "}, {"author": "767365864", "created_at": "2018-03-16", "text": "I also have the same issue as the OP. Paypal is not an ideal way for my business to operate.I am now looking at alternative software to invoice which is unfortunate as I really thought Office 365 was going to be a complete solution. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32123416-allow-invoice-number-to-be-changed", "header": "Allow invoice number to be changed", "idea_text": "I would like to use this service but I haven't been able to find a way to edit the invoice number assigned to the invoice meaning that my test invoice starts at 1.  However this is not a new business so I already have invoices up to a certain number so would need to be able to change the invoice number to reflect that.  I also have some regular clients who I have assigned a range of invoice numbers to which means my invoices aren't always sequential so I would need to be able to edit the invoice number for every invoice.", "author": "703674526", "created_at": "2017-11-03", "votes": 45, "reaction": [{"status": "in the plans", "author": "", "created_at": "2018-01-17", "note": ""}, {"status": "thinking about it", "author": "398985916", "created_at": "2017-11-07", "note": "Thank you for your suggestions! \nWe are considering enabling the users to select which is the starting number for their invoices. \nHowever, please be aware that most  and tax laws require that invoices must be sequential, therefore editing the invoice number assigned by the system may lead to unwanted consequences."}], "comments": [{"author": "699561859", "created_at": "2019-07-24", "text": "This is a very important feature for businesses that have been in business for a while. How come it isn't already implemented?"}, {"author": "886233262", "created_at": "2019-02-27", "text": "Has this problem been solved?"}, {"author": "825376459", "created_at": "2018-07-19", "text": "It would be nice if you were able to save a different invoice number sequence for each client.  I have unique identifiers that I use for each one.  it seems (of course in my mind) like this could be added under the contact details. That way each time you pick a new client the new sequence number autopopulates into the invoice. "}, {"author": "734732944", "created_at": "2018-01-07", "text": "Have the same issue ...  It will be interesting not to update each invoice but to configure the starting invoice number ... "}, {"author": "728501305", "created_at": "2017-12-20", "text": "Invoicing programs allow changing the invoice number. One good reason is a paper invoice may have been issued or an invoice from another platform may have been issued and have the ability to change the invoice number is important for me.  It would be helpful to be able to change the start number so I can continue the order. I was hoping to start using MS Invoicing January 1st, 2018"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33679795-notification-of-price-increases", "header": "Notification of Price Increases", "idea_text": "Notify users of any planned increase of price via email.", "author": "768226852", "created_at": "2018-03-19", "votes": 6, "reaction": [], "comments": [{"author": "791869840", "created_at": "2019-03-06", "text": "This is just standard practice, to inform customers ahead of time of any price changes. In our case, the cost is increasing for us 84% month-on-month - this is a big hit on our budgeting for the year, with zero warning."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33837127-multiple-notes-to-contact-in-outlook-customer-mana", "header": "multiple notes to contact in outlook customer manager", "idea_text": "Bring back multiple notes feature to Outlook customer manager", "author": "692724496", "created_at": "2018-04-03", "votes": 6, "reaction": [], "comments": [{"author": "773397457", "created_at": "2018-04-03", "text": "It was very useful, i really want it back. Looking forward to Microsoft to enable it."}, {"author": "760709386", "created_at": "2018-04-03", "text": "I used to be able to add multiple notes to my OCM, it was my favorite feature. Please bring it back !!!"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34678330-be-able-to-edit-update-invoices-and-have-invoic", "header": "Be able to edit & update invoices, and have invoices reflect payments customers have made", "idea_text": "Some customers make payments.  When registering payments, their invoices do not reflect it, which I think should happen automatically.  We should be able to re-send the invoice showing the payment deducted from the original amount owed.  Why register a payment if it does not show on the invoice?  And, because invoices cannot be edited once they are sent, etc., I have to start from scratch to be able to send an invoice with my customer's payments reflected.  PLEASE FIX THIS... it is an important feature that needs to be added.  Thanks!!", "author": "818422855", "created_at": "2018-06-27", "votes": 6, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "I agree with this idea. There should be a toggle to show payments made on invoices resent."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34100242-adding-a-reference-field-for-invoicing", "header": "adding a reference field for invoicing", "idea_text": "It would be a nice idea to have a reference field for the invoices. One issue i have had from my clients when I have invoiced is that they are not always aware of what job the invoice relates to. Currently I am adding it into the customer notes section which appears at the bottom of the invoice which is not really ideal.Thank you", "author": "781996768", "created_at": "2018-04-29", "votes": 6, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2018-05-02", "note": "Thank you for your suggestion! Just for clarification, is the description of the job just a description, or an order number from your customer?"}], "comments": [{"author": "775351258", "created_at": "2019-09-03", "text": "I'd like an additional field 'Invoice Name' which would contain a short description of the project or work the invoice relates to. This field should also be a column on the Invoice summary screen to enable you to quickly find a specific invoice for a customer. e.g. if you do 5 projects for the same customer you can quickly find the right invoice. This would also be in the email subject and detail on the printed invoice to enable the customer to know which piece of work the invoice relates to."}, {"author": "900414799", "created_at": "2019-07-05", "text": "I am in the exact same situation as Hesham below. This feature is a deal breaker. I may discontinue use of this system because of this feature. "}, {"author": "781996768", "created_at": "2018-05-31", "text": "its more of a title rather than a reference number. I'm an electrical contractor and send multiple invoices to the same customers for works at the same location (they get billed weekly). Its not always clear from the invoice details where the job was. At the moment, i have to add the location of the works in the notes section. When i look through the invoices, i would like to be able to see a name so i can quickly identify what site/job the invoice relates too, rather than having to try to remember what date it was invoiced and open the invoice to check if it is for the job i'm looking for.On my old system i had an invoice number eg. 20170065 and then a reference field e.g University Arms Hotel Cambridge. I could search for all invoices with the same reference and find all the invoices for that job"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31973860-email-account-not-working", "header": "Email account not working", "idea_text": "Why would my business 365 email account not work ?", "author": "698452075", "created_at": "2017-10-21", "votes": 7, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2018-05-02", "note": "Are you still blocked from using your Office 365 mail account?"}, {"status": "working on it", "author": "398985916", "created_at": "2017-10-24", "note": "Hi there, \nMicrosoft Invoicing and the rest of Business Premium is still in preview to a limited number of users. We’ll be generally available soon, so stay tuned!"}], "comments": [{"author": "715486027", "created_at": "2017-11-25", "text": "When using the send estimate function via e-mail when using a google account or more importantly the office 365 email address of the user logged in we are seeing errors thrown on testing an e-mail send or trying to send an actual estimate or invoice.  We know of another office 365 tenant with invoicing where the send e-mail works.  We tried with that e-mail address with no luck from our tenant as well.  The error we are seeing is:  \tThe email system returned the following error.  \"The SMTP server requires a secure connection.  The server response was 5.7.57 SMTP client was not authenticated to send anonymous email during mail from....\""}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38558767-allow-bank-transfer-payment-method-for-ukraine", "header": "Allow bank transfer payment method for Ukraine", "idea_text": "Please allow the office 365 payment through bank transfer for Ukraine. Thank you.", "author": "904129396", "created_at": "2019-09-09", "votes": 6, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34875175-allow-to-change-credit-card-for-annual-accounts", "header": "Allow to change Credit Card for annual accounts", "idea_text": "I would like to see Office 365 have the ability to update the credit card information for annual accounts. The current process is to cancel the subscription, have the remaining balanced credited, and pay for the new one year term. This is unacceptable to the customer. The solution should just be to update the existing credit card on file without changing the subscription period and charging the credit card. I have never seen this with any other company and find it hard to believe this isn't a solution currently. ", "author": "825297199", "created_at": "2018-07-19", "votes": 6, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35740534-setup-automatically-invoice-payment-reminder", "header": "Setup automatically invoice payment reminder", "idea_text": "We need a feature to submit invoice payment reminders to the clients if the invoice has not been paid on the due date. The feature should allow us how often the reminder should be sent and the criticality level. For example if the client didn’t pay on the due date system automatically submit a friendly reminder. The vendor can provide a new date for payment and if accepted by us it will show the new date as per client request with history. If the client doesn’t pay by the new due date another friendly reminder would be submitted. We can also program how many times the vendor can change the due date. Let’s say if we allow 3 times in a period of one week and client exhausted the allowed time, client would not be able to provide a new date and different email notification would be sent to the client. We could establish each communication severity category with different reminders. If the first category the system sent 3 reminders programmed by us it would move to the next category with different text and how often would be sent. This way would help us to manage the invoice payments and history proof if we decide to sue the client.", "author": "858962824", "created_at": "2018-10-16", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37074163-allow-for-a-custom-template", "header": "Allow for a custom template", "idea_text": "I want to be able to adjust what the customer sees when receiving an invoice. Allow for an esthetical change. Also, allow for the proper categories for the specific business", "author": "888167278", "created_at": "2019-03-11", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37273417-availability-in-germany", "header": "Availability in Germany", "idea_text": "Make MS Invoicing available for Germany", "author": "891829072", "created_at": "2019-04-02", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37143499-direct-debit", "header": "direct debit", "idea_text": "Possible to have direct debit as a type of payment", "author": "889480852", "created_at": "2019-03-19", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36504937-more-customer-information", "header": "More customer information", "idea_text": "More customer information.  Most importantly \"Company\" and 2nd phone number.  Customizable customer fields or a template would be best.", "author": "878879377", "created_at": "2019-01-11", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37193731-integrate-with-bookings", "header": "Integrate with Bookings", "idea_text": "As a user I would like to create invoices in MS Invoicing directly from MS Bookings (without having to go through Business Central).Additional capabilities:\n  Import/synchronize customers between bookings and invoicing\n  automatically generate and send invoices at end of booked appointment", "author": "890430427", "created_at": "2019-03-25", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38334229-customizing-invoices", "header": "Customizing Invoices", "idea_text": "Allow customization for invoices depending on the needs of the business/organization.", "author": "909717181", "created_at": "2019-08-08", "votes": 4, "reaction": [], "comments": [{"author": "913970767", "created_at": "2019-08-08", "text": "Invoice on Business Premium has to allow for dating of multiple services on different days.  Also needs to have an ability to designate client and the matter being worked on. I am an attorney and I have a client that sends me different matters to work on. Each matter gets billed separately. We have to be able to amend/edit a description of a service after it has been entered."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31865923-support-modern-authentication", "header": "Support modern authentication", "idea_text": "My Office 365 account and my Microsoft account use the same email. This is normally not an issue with any other app, I simply get the modern authentication prompt and specify which account I want to use. Microsoft invoicing instead just ignores that and tells me I can’t login with my personal account.", "author": "683322493", "created_at": "2017-10-12", "votes": 5, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-17", "note": "Thank you for your feedback! You’re right that Microsoft Invoicing has a dependency on your Office 365 work or school account, and that you cannot log in with your personal account. But you have a good point about the experience, so we’ll take a look at what we can do to make it easier for you going forward."}], "comments": [{"author": "683322493", "created_at": "2017-10-17", "text": "Thanks - just to clarify, I'm not planning to try and use it with a personal account, I'm trying to login with the Office 365 account. But Microsoft Invoicing doesn't seem to even check for an Office 365 account, the second it finds I've got a MSA with the email I'm trying to use, it tells me I can't sign in, and doesn't go on to check whether there's an Office 365 account with the same email.\nSo this is more of a bug than a feature request."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31934683-cant-login-if-you-have-personal-and-busines", "header": "Cant login if you have personal and busines", "idea_text": "Unable to login to invoicing because i have both personal and business account on the same email address. Having the app use modern login would vastly improve this as the. I can choose my business account to operate this app. Unavailable to me and now i have to use third party software", "author": "691038406", "created_at": "2017-10-18", "votes": 5, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-19", "note": "Thank you for your feedback! You’re not the first to suggest this precise scenario, so we’re currently investigating what we can do to help."}], "comments": [{"author": "766489555", "created_at": "2018-03-14", "text": "is there a way to create a user name without the domain only to log in your account ? I need a username for work and another for my personal"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34633159-edge-browser-unable-to-print-background-graphics", "header": "Edge browser unable to print background graphics", "idea_text": "While all other browsers are able to print background graphics, Edge is lacking this simple feature. Main reason for this request is: We created a spfx Sharepoint webpart to export lists in a nice template. If we want to print this html export from Edge then the colors and background are gone. Therefore we use Chrome because Edge lacks this option. Seems like a quick win for the Edge browser to support this!", "author": "295668346", "created_at": "2018-06-22", "votes": 4, "reaction": [], "comments": [{"author": "870226336", "created_at": "2018-11-16", "text": "also having a lot of edge printing slowness and issues. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33142198-itd-be-great-to-show-contacts-as-customers-in-invo", "header": "Itd be great to show contacts as customers in Invoicing.", "idea_text": "it seems theres no way to sync my 365 contacts with my invoicing customers even though they are one and the same. \nbe great to have that feature or one where invoicing syncs with customer manager as well...", "author": "748578250", "created_at": "2018-01-30", "votes": 5, "reaction": [], "comments": [{"author": "263938978", "created_at": "2019-09-09", "text": "Please add option to sync/import Outlook contacts into invoiving app"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35010619-create-powershell-cmdlets-to-manage-invoice-pdfs", "header": "Create PowerShell cmdlets to manage invoice PDFs", "idea_text": "Hi,\nI think there should exist some cmdlets for us to automate the invoice download using PowerShell.", "author": "73808406", "created_at": "2018-08-02", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35263708-the-ability-to-create-a-master-invoice-template-th", "header": "The ability to create a master invoice template that can be applied to recipients.", "idea_text": "I have a customer looking to create a master invoice template(s) that would apply to specific groups that they are trying to manage.  Instead of entering each invoice item line by line, there should be a way to link a recipient to a template.", "author": "845758792", "created_at": "2018-08-31", "votes": 3, "reaction": [], "comments": [{"author": "755090107", "created_at": "2019-03-27", "text": "And or an invoice template(s) per customer. I.e. Defining standard line items and payment terms by customer."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36123505-add-a-line-for-customers-purchase-order-number", "header": "Add a line for customers purchase order number", "idea_text": "", "author": "873097249", "created_at": "2018-11-27", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36002365-offer-full-accounting-software-like-quickbooks-or", "header": "offer full accounting software like Quickbooks or Sage 50 and integrate with Office 365", "idea_text": "offer full service accounting software with office 365. AR, AP, Inventory, Chart of Accounts, etc!", "author": "868172125", "created_at": "2018-11-12", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36372250-put-the-date-format-as-uk-invoicing-is-useless-u", "header": "put the date format as UK - invoicing is useless unless this is fixed.", "idea_text": "Please make it possible to put the invoice date as UK - as we'd like to use this but can't if it is a USA date form.", "author": "876933190", "created_at": "2018-12-25", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35507347-availability-in-europe-within-the-next-6-months", "header": "Availability in Europe within the next 6 months?", "idea_text": "I'm a single user and considering paying for a premium subscription just so I can use bookings and invoice app....and I have no need of any other Microsoft products.  So is it in the pipeline?", "author": "852474424", "created_at": "2018-09-24", "votes": 3, "reaction": [], "comments": [{"author": "858115219", "created_at": "2018-10-13", "text": "Currently reviewing this myself. Although I do use or plan to use other products, this is the product that I am really looking for to kick out an online subscription for another invoicing system."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36378676-able-to-use-tab-in-microsoft-excel-online-also-i", "header": "Able to use \"Tab\" in Microsoft Excel Online also in Microsoft Teams", "idea_text": "Be able to use Tab to navigate through Microsoft Excel Online and also Microsoft Teams.", "author": "761144137", "created_at": "2018-12-26", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35397547-provide-the-option-to-add-a-longer-description-to", "header": "Provide the option to add a longer description to invoice.", "idea_text": "Provide the option to add a larger description to an invoice. So that a business that provides a service can be more descriptive about the work being performed.", "author": "850226389", "created_at": "2018-09-13", "votes": 3, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "Jason, it seems you posted a duplicate submission. To reduce confusion, it may be best to close one of the requests."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35431849-allow-microsoft-invoicing-to-business-premium-plan", "header": "Allow Microsoft Invoicing to Business Premium Plan", "idea_text": "Currently i do not have access to MS Invoice with my Business Premium Plan. Requesting you to please add it.", "author": "851198194", "created_at": "2018-09-18", "votes": 2, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "Be sure you've enabled it in the Admin center\noffice.com > Admin > Settings > Business Center > Turn on Microsoft InvoicingOnce it is enabled, you can access it on "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36600367-send-paid-invoice", "header": "send paid invoice", "idea_text": "Send a \"paid\" invoice to the customer when requested.", "author": "881055679", "created_at": "2019-01-22", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35576632-an-office-365-yearly-subscription-should-be-able-t", "header": "An Office 365 Yearly Subscription should be able to use a Microsoft Gift Card, then set the auto-renew or opt out.", "idea_text": "Using Gift Card for Microsoft annual subscriptions", "author": "854126908", "created_at": "2018-09-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35879875-use-total-payments-when-calculating-threshold-for", "header": "Use total payments when calculating threshold for invoiced payments.", "idea_text": "I have around 50 Office365 for Business and Essentials licenses which are paid by invoice. I also have a smaller number of Skype for Business and Exchange Online licenses which are paid by Credit Card. I would like to amalgamate all the payments to invoicing. But invoiced payment is currently not available for the Skype and Exchange bills.", "author": "864836377", "created_at": "2018-11-01", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36649477-let-customers-changes-credit-cards-from-different", "header": "Let customers changes credit cards from different countries", "idea_text": "I have a business account with a credit card from Hong Kong. I want to shift to a credit card from Sweden. The only way I can do that is to end my account and start a new one. It may somehow be related to the users being in China, but I don't know. In any case it's a typical example of how a company's internal organization carries over to a customer, for whom there is no logic to this. I think Microsoft should figure out internally how to move accounts between accounting units in the company, and not bother the customer with that.", "author": "876986131", "created_at": "2019-01-28", "votes": 3, "reaction": [], "comments": [{"author": "887010589", "created_at": "2019-03-04", "text": "This is just fundamentally flawed. I can and do pay occasionally using EFT from the UK to the US on my office365 account and that’s accepted. So, sort the card processing out please "}, {"author": "816028831", "created_at": "2019-02-20", "text": "There is no reason why MS can't accept a credit card payment from any country to pay for an O365 or other subscription.   Their logic on this is very, very flawed and is not supportable. I can use my US and Japan-based CC for any purchased -- anywhere in the world. So why can't mighty Microsoft? "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36600394-request-to-add-the-automatic-reply-features-in-off", "header": "Request to add the automatic reply features in office 365 groups and MS Team groups.", "idea_text": "", "author": "881056477", "created_at": "2019-01-22", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36179968-let-me-see-the-payments-i-ve-made-within-hours-no", "header": "let me see the payments I've made within hours, not weeks (ref. case #12292597)", "idea_text": "I paid for Office 365 several weeks ago, but there was no record of the payment on my MS account, only on my bank statements.Apparently I need to wait for the billing cycle to end, then for it to be a week day.Crazy that I have to look up my MS payments with my bank, not with MS.", "author": "874012339", "created_at": "2018-12-03", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36778654-electronic-bill", "header": "Electronic bill", "idea_text": "In catalonia, the invoices directed to the Public Administrations must be electronic, and Microsoft does not make electronic invoices. Has Microsoft comply with the law? ", "author": "883274068", "created_at": "2019-02-07", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37507273-why-invoice-naming-has-no-details", "header": "Why invoice naming has no details", "idea_text": "Invoice naming can be more explicit.\nSuch as naming can include cusotmer code, date, product name and so on.\nWe as a service provider, need to bill to our customers. The current billing invoice take us too much time to comb through things.", "author": "897815671", "created_at": "2019-04-30", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35018374-allow-ink-editor-on-microsoft-word-for-macbook-pro", "header": "Allow Ink Editor on Microsoft Word for Macbook Pro (Non Touch)?", "idea_text": "The Ink Editor feature for MS Word is only available for the touch tablets or IPADs. I think this feature should be allowed on MS Word installations so that we can use this great feature by connecting the laptops with WACOM like tablets. \nI am using MacBook Pro and I find Draw tab (Ink Editor) missing and also I am using the WACOM tablet also. This feature powers Trainers like me to have a webinar with clients, using the power of MS Office tools. Otherwise it;s frustrating to switch tabs and sometimes things go out of context.", "author": "829533073", "created_at": "2018-08-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31313329-by-allowing-the-use-of-my-personal-outlook-account", "header": "By allowing the use of my personal outlook account.", "idea_text": "Instead of only using 365, it would be nice to use my outlook account to login and use invoicing. ", "author": "665619547", "created_at": "2017-09-08", "votes": 2, "reaction": [{"status": "feedback taken", "author": "", "created_at": "2017-09-22", "note": ""}], "comments": [{"author": "398985916", "created_at": "2017-09-22", "text": "That's a good suggestions, but we do not currently plan to include personal mail accounts."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31653007-made-for-the-ipad-pro", "header": "Made for the iPad Pro", "idea_text": "Can you optimize the Invoicing app for the iPad Pro? Would like to use it but not on a small device like the iPhone. Would get a lot more use of the app on the iPad.", "author": "676151218", "created_at": "2017-09-27", "votes": 2, "reaction": [{"status": "try this instead", "author": "398985916", "created_at": "2017-10-12", "note": "Thank you for your feedback, but we are not planning to provide an app for iPad or iPad Pro. Instead, we recommend that you use Business center from your iPad. For more information, see "}, {"status": "try this instead", "author": "398985916", "created_at": "2017-10-02", "note": "Thank you for your feedback, but we are not planning to provide an app for iPad or iPad Pro. Instead, we recommend that you use Business center from your iPad. For more information, see "}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32035696-you-need-to-be-able-to-attach-a-pdf", "header": "you need to be able to attach a PDF", "idea_text": "", "author": "699561859", "created_at": "2017-10-26", "votes": 2, "reaction": [{"status": "try this instead", "author": "398985916", "created_at": "2017-11-02", "note": "Do you mean attaching a file in addition to the invoice? You can do that in Business center but not on the phone today."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32043466-enter-bank-detail-for-bacs-payments", "header": "enter bank detail for BACS payments", "idea_text": "Similar to the section you have for Paypal allow settings to include bank details so these get printed on invoices.\nSimilarly - instructions for cheques.", "author": "700491799", "created_at": "2017-10-27", "votes": 2, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-31", "note": "Thank you for your suggestion! We’ve added  payments to our list of things to consider for a later update, so stay tuned."}], "comments": [{"author": "713428762", "created_at": "2017-11-23", "text": "Also we need to be able to add Bank Name, Account name, Bank Account number, Sort code, IBAN code and BIC code. A simple checklist to make these available would be smart."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32116840-include-in-office-365-business-essentials", "header": "Include in Office 365 business essentials", "idea_text": "Would be awesome if Invoicing was made available to Business Essentials subscriptions as well. ", "author": "703962016", "created_at": "2017-11-02", "votes": 2, "reaction": [{"status": "feedback taken", "author": "398985916", "created_at": "2017-11-07", "note": "Thank you for your feedback! Microsoft Invoicing is indeed currently available to customers who have an Office 365 Business Premium subscription. We do not currently plan to make the app available in other subscriptions."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32766403-overdue", "header": "Overdue", "idea_text": "Hi thereIt would be really good if you could send an overdue reminder of an invoice.Thanks", "author": "731409058", "created_at": "2017-12-29", "votes": 2, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-01-17", "note": "Thank you for your suggestion! We’re currently investigating the best solution for sending your customer reminders. We hope to be able to support it later this year."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32420539-help-me-get-signed-in", "header": "Help me get signed in!!!", "idea_text": "It would be more helpful if I could actually sign in", "author": "717126805", "created_at": "2017-11-29", "votes": 2, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2017-11-30", "note": "Hello, we’re sorry to hear that you’re having troubles signing in. to help us investigate this, can you share with us if you are trying to log in with a work or school account and not a personal email account?"}], "comments": [{"author": "875306989", "created_at": "2018-12-12", "text": "thats not very smart sir"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32447474-payment-reminders", "header": "payment reminders", "idea_text": "", "author": "718234718", "created_at": "2017-11-30", "votes": 2, "reaction": [{"status": "in the plans", "author": "398985916", "created_at": "2017-12-05", "note": "Thank you for your suggestion! We’re planning to make it possible to send your customers a reminder to pay the remaining amount. This will become available next year."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33309739-see-a-summary-of-monthly-totals-in-invoicing-app", "header": "See a summary of monthly totals in invoicing app", "idea_text": "See a summary of monthly totals in invoicing app", "author": "734464057", "created_at": "2018-02-13", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33187969-create-a-notification-that-tells-people-that-if-th", "header": "Create a notification that tells people that if they change from CC payment to invoice payment, they can't switch back with out new sub.", "idea_text": "When you change your payment method from CC to Invoice, it does not warn you that you will have to buy a completely new subscription if you want to change back. This can cause extreme problems for customers when it comes to the billing implications. ", "author": "750339385", "created_at": "2018-02-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33358162-testing-the-feature-for-testlio", "header": "Testing the feature for Testlio", "idea_text": "Testing the feature for Testlio", "author": "756954694", "created_at": "2018-02-17", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33694966-line-item-categories", "header": "Line Item Categories", "idea_text": "Love the app. I think it has a lot of potential, but somethings holding me back from using it full time.An explainer: I'm the owner of a video production company. A lot of our costs go into labor (via independent contractors), equipment rentals, miscellaneous production & admin costs. I could really use the ability to sort out different services into categories when creating the estimate, for the client to easily digest. A sub-total feature for each category would be great too. Thanks again!", "author": "768722008", "created_at": "2018-03-20", "votes": 2, "reaction": [], "comments": [{"author": "881055679", "created_at": "2019-01-22", "text": "Or just the ability to add a text-only line to line-item descriptions without quantity, tax, rate, etc."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33813118-adding-a-descriptions-of-service-completed-as-a-li", "header": "Adding a descriptions of Service completed as a line description.", "idea_text": "", "author": "772449541", "created_at": "2018-03-31", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33868906-tds-refund-procedure", "header": "TDS refund procedure", "idea_text": "There is no online help or documentation on how to get TDS Tax refund. We suggest to make it a standard procedure. Currently it is very cumbersome through your online support as they do not provide support for billing/invoicing for India. The Indian accounts support on telephone does not raise a ticket for TDS issues. Also there must be email/chat contact for India billing.", "author": "774431881", "created_at": "2018-04-05", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38019292-office-365-tial-expiraiton-notification-problem", "header": "Office 365 Tial expiraiton notification problem", "idea_text": "Apparently, we signed up for a trial version of Office 365 for Business and then forgot to convert to a paid subscription.  Later, when the trial had expired and the product would no longer work, we would get a popup message about problems with the subscription which appeared to be an install issue.  Later when investigating, we see that Microsoft sent an email 2 weeks prior to the trial expiration but it didn't reference the fact that it was a trial.  We were working under the assumption that we had setup billing initially and thought the problems we were having were of a technical nature.  So, I recommend when sending out an email notice of pending subscription expiration, you indicate that it is a trial version and needs billing setup.", "author": "908680030", "created_at": "2019-06-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38098063-addresses-in-invoice-are-not-formatted-correctly", "header": "Addresses in Invoice are not formatted correctly", "idea_text": "Addresses for a customer who is billed on the invoice are not formatted correctly.The addresses are formatted differently and are not consistent.An Address should be formatted as such:\n \nJohn Smith\n100 Test Street\nTest, Ontario\nA1B 2C3Instead, the Dynamics Invoice is formatted it incorrectly as:John Smith\n100 Test Street\nTest, A1B 2C3\nO\nCanadaTherefore you notice there are a few issues with this. Also if you have your from field set as your business it is formatted differently as well. The business address is formatted as such:Company Abc\n100 Front Street\nCity, Ontario K1B 2C3You can still use the above address but it is best formatted if the postal code is on the next line", "author": "910180240", "created_at": "2019-07-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38106658-allow-split-of-data-in-home-subscription", "header": "Allow split of data in Home subscription", "idea_text": "Today's Home subscription allows 6 people with 1 TB of data each. In a family of only 4, allow the remaining data to be split out to the other family members.", "author": "910311016", "created_at": "2019-07-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38054860-enable-receipt-downloading", "header": "Enable Receipt Downloading", "idea_text": "Please add an ability to get Paid Receipt like an Invoice. \nGovernmental organizations, especially in Japan, always require receipts in the payment procedure. Solution providers need a long time to change license subscriptions.", "author": "909268915", "created_at": "2019-07-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38121079-for-health-services-providers-add-space-to-includ", "header": "For health services providers, add space to include information on the clinician offering the service", "idea_text": "We work in a health services clinic-  we need to\n1) Add room to choose a clinician's name, registration number\n2) we need to include the clinician's and rate per hour\n3) we need space to add a .jpg of the clinician's signature (for insurance purposes)\nThank you!", "author": "910444261", "created_at": "2019-07-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38151814-audittax-iafrica-com", "header": "audittax@iafrica.com", "idea_text": "my licences for office 365 has not expired , the message on my computer screen says it has expired .\nI bought my product in October I, 2018 .\nmy email address is ", "author": "910961284", "created_at": "2019-07-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38195860-make-invoicing-available-in-japan", "header": "Make Invoicing available in Japan.", "idea_text": "", "author": "911665096", "created_at": "2019-07-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38184469-fix-sales-tax-rate-rounding-error-on-invoices", "header": "Fix Sales Tax Rate Rounding Error on Invoices", "idea_text": "Please correct the sales tax rate or the way your accounting system automatically rounds to the hundredths.  Our rate should be 8.875% but your system rounds to 8.8%.  You are therefore overcharging.", "author": "911462614", "created_at": "2019-07-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38262196-upgrade-from-365-personal-to-business-premium", "header": "Upgrade from 365 Personal to Business Premium", "idea_text": "Just orderd the upgrade relying on Microsoft Business Hotline advisors that I would get a partial refund of my 69 Euro/year Personal payment. Now Microsoft Personal Hotline tells me that this is only possible within a 30 day timelimit after renewal. Seems Personal and Business have no common link. Now I have to licences but I only need one instead of the a 50 Euro refund!", "author": "912771877", "created_at": "2019-07-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38383657-improve-stability-and-autosave-consistency", "header": "Improve stability and autosave consistency", "idea_text": "PROBLEM\nThe Microsoft Invoicing web UI gives you no feedback as to what it's doing.  Additionally, if there is a problem, it crashes out, refreshes the page and deletes what you just did.  Additionally, the feedback during errors is not clear or helpful for the user to self resolve the problem - SQL statements, etc.  Is it a data format problem?  A length issue?  WHY is it bombing?Some fields auto save, some don't.  This is inconsistent.  Either do it all or do it none.", "author": "890239825", "created_at": "2019-08-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38193685-power-bi-connector", "header": "Power BI connector", "idea_text": "It would be really nice if there was a connector in power bi to be able to import invoice data directly from Invoicing.", "author": "911620636", "created_at": "2019-07-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38406727-allow-removal-of-all-references-to-vat", "header": "Allow removal of all references to VAT", "idea_text": "We operate in a VAT exempt territory and as such VAT is never a consideration. We'd like to remove any reference to VAT from our invoices because it's not relevant.", "author": "915293389", "created_at": "2019-08-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38406715-allow-sending-of-invoices-via-office-365-groups-e", "header": "Allow sending of invoices via Office 365 Groups (email)", "idea_text": "I appreciate that you can now send invoices from a Shared Mailbox (if you assign a license to it). However, I have some Office 365 Groups with email addresses, one of which is accounts@ and I'd like to send invoices FROM this address.", "author": "915293389", "created_at": "2019-08-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36372256-put-the-date-format-as-uk-invoicing-is-useless-u", "header": "put the date format as UK - invoicing is useless unless this is fixed.", "idea_text": "Please make it possible to put the invoice date as UK - as we'd like to use this but can't if it is a USA date form.", "author": "876933190", "created_at": "2018-12-25", "votes": 4, "reaction": [], "comments": [{"author": "885455383", "created_at": "2019-02-22", "text": "My Invoicing has reset to a new year since January. This is very inconvenient as my tax year ends in April. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37009483-financial-year-change-to-align-with-actual-busines", "header": "Financial year change to align with actual business needs", "idea_text": "I use this for my company, our financial year is not the calendar year but the invoicing tool is already moved into the \"next\" financial year.... Is this possible to change?", "author": "886881397", "created_at": "2019-03-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36972409-make-invoice-details-cleaner-when-changing-license", "header": "Make invoice details cleaner when changing license quantity", "idea_text": "If I add or remove a license in the middle of a billing period the corresponding invoice should simply add one line charging me a prorated amount for the new license or refunding me for the removed license. Currently there are usually at least 4 lines: a charge for the annual amount for the new license total, a refund for the previously paid license amount, and then usually two charge for the prorated amount for the new license total for the amount between billing periods. I shouldn't have to do some complicated equation to verify the bill makes sense. Just show me what I'm paying for - 1 new license for a specific amount of time, don't show me all the confusing calculations you did to get there. The invoices from Microsoft are the most convoluted I receive from any vendor and it makes them look disorganized and shoddy.", "author": "886197439", "created_at": "2019-02-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37053451-auto-reading-entering-excel-invoices-data", "header": "Auto Reading & Entering Excel Invoices DATA", "idea_text": "My Idea is to Link- and Translate each or some cell in the excel invoice into global barcode can be scanned to save time & eliminate human errors while entering data .\n a lot of other features can be added in my mind if you are interested in my ideal \nplease contact me \nMobile or Whats app : 00966563996378 \nVia email : ", "author": "887593102", "created_at": "2019-03-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37261978-please-make-invoicing-available-in-greece", "header": "Please, make Invoicing available in Greece.", "idea_text": "Please, make Invoicing available in Greece. Local economy heavily relies in small businesses (like mine) that could benefit a lot!!", "author": "891642526", "created_at": "2019-04-02", "votes": 1, "reaction": [], "comments": [{"author": "920367046", "created_at": "2019-09-17", "text": "Is there any plan for making Invoicing available in Greece in near future? I need to change my invoicing software and I'd like to try Microsoft Invoicing that i can see in my Office 365 Apps .but yet not available for Greece. Thanks"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37280803-allow-us-to-enter-an-invoice-date-and-amend-paymen", "header": "Allow us to enter an invoice date and amend payment terms", "idea_text": "We need to migrate our manual Excel based invoices into the App, but in doing so the App only issues invoices using the date we input the details and the default payment terms.  1) to keep the chronology in tact we'd like to enter the original invoice date (backdate) and 2) as some clients are on different payment terms, we'd like to enter those terms accordingly for each invoice", "author": "892080208", "created_at": "2019-04-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37335574-repeating-invoices", "header": "Repeating invoices", "idea_text": "Give us the ability to have repeating invoices (monthly, yearly etc)", "author": "893629225", "created_at": "2019-04-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37337638-the-threshold-story-is-very-discriminatory", "header": "the threshold story is very discriminatory", "idea_text": "I don't think thresholds should be implemented ", "author": "893663911", "created_at": "2019-04-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37315009-dansk-talende-faktura-service-ville-v%C3%A6re-en-fordel", "header": "Dansk talende faktura service ville være en fordel.", "idea_text": "Det er besværligt at kontakte en engelsktalende service om fakturering, der er mange tal og detaljer som det tager meget lang tid at udredde.\nSørg for at der er service tilgængelig i Danmark, på dansk.\nvenlig hilsen ", "author": "893203882", "created_at": "2019-04-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37341247-allow-users-to-change-from-monthly-to-yearly-payme", "header": "Allow users to change from monthly to yearly payment in their portal.  You should make people choose their billing method.  I am frustrated", "idea_text": "I am frustrated that I was not asked how I wanted to pay for my subscription.  It defaulted to monthly.  I would prefer yearly but can't do that without cancelling.  Too much work.\n", "author": "893724910", "created_at": "2019-04-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35608888-swedish-translations", "header": "Swedish translations", "idea_text": "When selecting a time period to view the invoice history, the button in English says \"View\" but in the Swedish translations, it's traslated to \"Vy\" which is not the correct translation, \"Visa\" would be a better word. ", "author": "854761603", "created_at": "2018-10-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35397574-provide-the-option-to-add-a-longer-description-to", "header": "Provide the option to add a longer description to invoice.", "idea_text": "Provide the option to add a larger description to an invoice. So that a business that provides a service can be more descriptive about the work being performed.", "author": "850226389", "created_at": "2018-09-13", "votes": 1, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "Jason, the current description field allows 49 characters. Can you provide an update with a more specific character count?"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35608894-swedish-translations", "header": "Swedish translations", "idea_text": "When selecting a time period to view the invoice history, the button in English says \"View\" but in the Swedish translations, it's traslated to \"Vy\" which is not the correct translation, \"Visa\" would be a better word. ", "author": "854761603", "created_at": "2018-10-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37400692-description-de-produit", "header": "Description de produit", "idea_text": "Pouvoir ajouter une description sous le produit, comme toute les autre app de facturation. ", "author": "895108462", "created_at": "2019-04-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35589292-service-dates", "header": "Service Dates", "idea_text": "Is there any word on adding the option to have separate dates on the invoice...aka service dates.  My invoices are for particular months however, I need to show the dates of service.", "author": "854574448", "created_at": "2018-10-01", "votes": 1, "reaction": [], "comments": [{"author": "914656864", "created_at": "2019-09-16", "text": "Is there at least a work around for adding a date to Microsoft invoicing.  Most business invoice after work is completed for example if I invoice my clients for work that was done last week a date field would be perfect.  Is there a current work around for that? "}, {"author": "914656864", "created_at": "2019-08-14", "text": "Is there any update on being able to add the dates of service for invoicing? We bill for the previous weeks work so if we worked M-F the previous week then we need to include those dates on the invoice? thank you"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35618398-can-you-have-two-invoice-systems-on-the-one-plan", "header": "Can you have two Invoice Systems on the one Plan?", "idea_text": "I was wondering if you could have two invoice systems on the one plan. We run a shop and an online business and wanted to know can we have the two invoices separated. ", "author": "855072577", "created_at": "2018-10-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36002569-eliminate-current-expiration-policy-for-communicat", "header": "Eliminate current expiration policy for communications credits", "idea_text": "We use communications credits only for in-bound 1-800 service, of which we have little traffic. I was just informed that my initial purchase of $20, which is the minimum amount I can purchase at a time, expired after 12 months, although I had only used $1.92 of activity in the 12 month period of time.  Now in order for my customers to use my 1-800 numbers, I need to buy another $20 credit -- which I will most likely need to forfeit 80% of to Microsoft solely because of the antiquated policy.  It's not a lot of money, but it is the principle, I am a small business. Every dollar really counts.  I would like to see the minimum purchase reduced and for communications credits to never expire.  If I have to pick one, then set credits to never expire.  I'll eventually use the $20 worth of credits. :)  ", "author": "868175848", "created_at": "2018-11-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35921182-zahlungsmethode-kreditkarte-oder-bankeinzug-in-der", "header": "Zahlungsmethode Kreditkarte oder Bankeinzug in der Schweiz", "idea_text": "Leider ist derzeit nur Kreditkartenzahlung möglich. Wenige Unternehmen haben aber eine Kreditkarte und scheuen daher vermutlich den Umstieg auf Office 365.", "author": "866877796", "created_at": "2018-11-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36354823-multiple-email-addresses-should-be-allowed-per-cus", "header": "Multiple email addresses should be allowed per customer", "idea_text": "More than one email address per customer will allow us to send invoice to more than one responsible person of the same invoice instead of creating whole new invoice. ", "author": "876570460", "created_at": "2018-12-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36433489-when-i-initially-signed-up-for-the-365-we-discove", "header": "When I initially signed up for the 365, we discovered I was never activated. Only this evening 01/02/2019 was it discovered that my account", "idea_text": "My account was activated on 01/02/2019. Yet, I have already had 2 fees of $8.25 charged to my credit card. I am more than happy to continue this account as I do need these products. However, out of my concern that I have been paying for something I did not get for 3+ months later, I should be compensated somehow at some point for the delay. Please look into my account and reply back to me via e-mail. \nThank you.", "author": "877958437", "created_at": "2019-01-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36512353-not-firing-someone", "header": "Not Firing Someone", "idea_text": "I was fired while my ISP was out over Oct 14/15/ into 16 by Experis wrongfully from a  career I looked every day to work! To a call around Oct 27 saying I sent a Non-Admin PII which I can prove I didn't, via ISP and internet and reimaged my laptop on Monday almost the entire day after 9:00 am CST due to no access VP and CMAT which Jason would verify and also sceenshots from VPN not connecting \nPaul Rath 7155703740", "author": "879562744", "created_at": "2019-01-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36487774-estimates-and-proposals", "header": "estimates and proposals", "idea_text": "Allow project name for estimates not automated numbers. Create better options for proposals.", "author": "879077440", "created_at": "2019-01-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36633592-sell-invoicing-as-a-stand-alone-add-on-license", "header": "Sell Invoicing as a stand-alone add-on license", "idea_text": "Rather than selling Invoicing as a Business App within the Business Premium subscription, it should be sold as a separate, stand-alone license. In my case, I have an E3 license. So, in order to be able to get Invoicing, I also have to add a Business Premium license to my account. So, I'm essentially paying for all features except Invoicing twice. $32.50/month for an E3 and Business Premium license.", "author": "710694657", "created_at": "2019-01-25", "votes": 1, "reaction": [], "comments": [{"author": "901858030", "created_at": "2019-05-23", "text": "I have the same problem.  My company gives technical support and advice to small business.  Microsoft Invoicing looks as if it would be a really useful product for some of our clients.  But without being able to install and use it ourselves, so that we can build experience to support them, it's not practical to recommend it.  As we have the top E3 licence I would have thought that you would have automatically included it."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33028720-negative-line-item-amounts", "header": "Negative Line Item Amounts", "idea_text": "-800, - 900 to identify credits against invoice ", "author": "699561859", "created_at": "2018-01-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33139144-business-logo-with-a-clear-background-shows-up-wit", "header": "Business Logo with a clear background shows up with a black background when you create an invoice", "idea_text": "The invoices are automatically generated by the invoicing application of business center.  However, when you upload your company's logo with a clear background, the Microsoft logic creates a black background on the overlay of the logo on to the invoice.  I know the background is clear because I get the checkerboard.  PLEASE PLEASE fix this since I am not a photoshop wizard with abilities to match your white color on the invoices.  This seems super simple.  Thanks!", "author": "747767842", "created_at": "2018-01-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33116509-office365-powerpoint-placed-pdf-file-with-actions", "header": "Office365 PowerPoint, placed PDF-File with actions open on iOS", "idea_text": "Hello,i wanted to open an integrated PDF-File in a PowerPoint Presentation on my iPad with the Office365 App-Pack (PowerPoint).The PDF File is included in the PPT and with the \"actions\" it should be open the File with mouseover or click. On the PC it works, on the iPad it doesn't work.Would be great if you can add this function!", "author": "747035626", "created_at": "2018-01-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33415630-why-am-i-invoiced-for-a-full-month-when-errors-mea", "header": "why am i invoiced for a full month when errors mean i cant use all or part of the service i pay for", "idea_text": "Refund or adjusted payment", "author": "759180325", "created_at": "2018-02-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33416887-invoice-not-working", "header": "INVOICE NOT WORKING", "idea_text": "After purchasing Office 365 for business 2 weeks ago we have been unable to use the invoicing app, as it not only \"blocks\" customers so I am unable to register a payment, but it will not allow me to cancel or edit any invoices.\nWhen trying to delete an invoice: ERROR: You cannot cancel this posted sales invoice because customer Iron Tool & Die is blocked.\nWhen trying to register a payment:\nYou cannot create this type of document when Customer C00040 is blocked with type All.Several days spend on the phone with support and all they came up with was for me to input this feedback and hope the problem gets resolved.", "author": "759223987", "created_at": "2018-02-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33520531-testlio", "header": "Testlio", "idea_text": "Testinggg", "author": "757080307", "created_at": "2018-03-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33520534-us", "header": "Us", "idea_text": "Xx", "author": "757080307", "created_at": "2018-03-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32689522-impossible-to-cancel-subscription", "header": "Impossible to cancel subscription", "idea_text": "Contact me on my email pls as I  didn't get through to you after waiting for 30 minutes a few times. I don't want your subscription any more. I haven't been using your services so pls stop supplying them if you are. I instructed my bank to stop payments to you but can't open my account and can't speak to anyone as waiting time is too long! Thanks ", "author": "728419576", "created_at": "2017-12-20", "votes": 1, "reaction": [{"status": "feedback taken", "author": "398985916", "created_at": "2018-01-17", "note": "Thank you for your feedback. Since it does not apply to the Microsoft Invoicing app, it will be moved to another forum."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34092319-please-make-available-for-download-the-delivery-ac", "header": "Please make available for download the delivery acceptance forms (for Russia) in the office 365 admin control panel", "idea_text": "Now only invoices are available for download. Every time I have to make a request to your support for the getting these documents in time.", "author": "781636339", "created_at": "2018-04-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34422718-why-can-t-we-download-our-invoices-instead-of-anno", "header": "Why can't we download our invoices instead of annoying MScredit emails when they are delinquent in sending invoices", "idea_text": "Why can't we download our invoices instead of annoying MScredit emails when they are delinquent in sending invoices", "author": "774564175", "created_at": "2018-06-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33933148-should-be-able-to-track-invoices-to-be-able-to-see", "header": "Should be able to track invoices to be able to see whether they have been opened, viewed...etc like so many tpa's", "idea_text": "See pandadocs.com as an example", "author": "776476291", "created_at": "2018-04-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34184815-for-uk-business-customers-billing-window-for-bacs", "header": "For UK Business Customers Billing window for BACS transfer payments very confusing...", "idea_text": "As a UK business customer paying by credit card is not a practical solution but using your BACS transfer system is. The only problem is that auto renew is the only option and very confusing for UK cusotmers as the UK does not allow automatic BACS payments which I have just found out!  Can your system be set up to recognise UK based business customers so that the billing window does not show the account subscription as auto renewed (as it will not have been paid automatically) until we physically make the BACS transfer payment to microsoft? Then when microsoft receive our payment, once processed at Microsoft end then your system can update the renewal invoice accordingly for the subscription we have with the new renewal date?", "author": "785027110", "created_at": "2018-05-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34130989-%E0%B9%80%E0%B8%A3%E0%B8%B2%E0%B8%88%E0%B8%B0%E0%B8%9B%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%9B%E0%B8%A3%E0%B8%B8%E0%B8%87%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%AD%E0%B8%AD%E0%B8%81%E0%B9%83%E0%B8%9A%E0%B9%81%E0%B8%88-%E0%B8%87%E0%B8%AB%E0%B8%99%E0%B8%B5-%E0%B8%82%E0%B8%AD%E0%B8%87-microsoft", "header": "เราจะปรับปรุงการออกใบแจ้งหนี้ของ Microsoft", "idea_text": "ซึ้งมันใช้งานได้ดียิ่งขึ้นเพื่อความสะดวกสบายและปลอดภัย", "author": "783049261", "created_at": "2018-05-02", "votes": 1, "reaction": [{"status": "feedback taken", "author": "398985916", "created_at": "2018-05-07", "note": "Thanks!"}], "comments": [{"author": "783049261", "created_at": "2018-05-02", "text": "Very good "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33155035-pay-invoice-with-than-paypal", "header": "Pay Invoice with than Paypal?", "idea_text": "Seems like Paypal is the only option for people to pay. May small businesses already have existing merchant service providers other than Paypal. Can you include way so a business can setup a custom payment gateway URL with template items that can be transferred to the gateway?For example:\nHere, Microsoft Invoicing will replace \"ms_\" is replaced with actual values.To handle paid invoice notification, Microsoft Invoicing need not take return URLs (see API request)", "author": "749125462", "created_at": "2018-01-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36557812-allow-to-create-customized-fields-within-invoice-f", "header": "Allow to create customized fields within Invoice forms in the invoicing app", "idea_text": "if customers want to add new fields within the invoices apart from the existing ones they should get an option to customize the option so that they can design the way they want.", "author": "880416859", "created_at": "2019-01-17", "votes": 0, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31953580-silo-user-views-with-permissions-based-on-mail-ena", "header": "Silo User Views With Permissions Based on Mail-Enabled Security Groups", "idea_text": "It would be useful to be able to silo user views based on permissions so that users view role-appropriate info. Perhaps this can be accomplished with mail-enabled security groups and/or at a user-tenant level.E.g. A user-tenant is able to generate new invoices and register payments, but not view customer totals.", "author": "693249148", "created_at": "2017-10-19", "votes": 1, "reaction": [{"status": "try this instead", "author": "398985916", "created_at": "2017-10-24", "note": "Thank you for your feedback! You might want to sign up for a free trial of Microsoft Dynamics 365 – try it here: "}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31919221-making-your-log-on-easier", "header": "MAking your log on easier", "idea_text": "", "author": "690450037", "created_at": "2017-10-17", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-19", "note": "Thank you for your feedback! You’re not the first to suggest this, so we’re currently investigating what we can do to help."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36438484-additional-fields-on-invoice", "header": "Additional Fields on Invoice", "idea_text": "The invoice is a little too basic as many clients require additional information to appear on the invoice. For example:1. PO Number:\n2. Supplier Number:\n3. Project Name:\n4. Customer Number: \nThe notes section is a work around but isn't as acceptable or useful for recipients\n ", "author": "877991392", "created_at": "2019-01-03", "votes": 14, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32043214-create-rules-for-applying-discounts-automatically", "header": "create rules for applying discounts automatically", "idea_text": "Set up rules that apply discounts automatically to invoice based on dates and customer details (consumer type for eg.)", "author": "700491799", "created_at": "2017-10-27", "votes": 1, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-02", "note": "Thank you for your feedback! We’ll add it to the list of things to consider for a future update, but right now we’re not sure if customer groups or similar are quite right for Microsoft Invoicing."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32341222-monaco-country-code", "header": "Monaco Country Code", "idea_text": "I have a client in Monaco however the Monaco country code is not available and I can't add it. Please can we have the ability to add country codes.", "author": "713428762", "created_at": "2017-11-21", "votes": 1, "reaction": [{"status": "try this instead", "author": "398985916", "created_at": "2017-11-23", "note": "This is indeed a bug that we are working on. We expect to have this fixed in a week or two. But you can add Monaco to the list of countries if you open any of your customers in edit mode – the Country/Region Code field in the customer page does have support for adding a new country or region."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32631388-it-s-not-allowing-my-work-email", "header": "It’s not allowing my work email", "idea_text": "Why won’t it except my work email that I set up my office 365 with?", "author": "726062407", "created_at": "2017-12-14", "votes": 1, "reaction": [{"status": "feedback taken", "author": "398985916", "created_at": "2017-12-15", "note": "Currently, you must log in to Invoicing and the Business center in general using a work or school email account. We do not support personal accounts. As part of your Office 365 subscription, you will have received another email account, and that’s the one you need to use here.\nWe realize the confusion that this can bring. For your information, you can set it up so that it’s your usual email account that is used to send the invoices to your customers."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34443106-add-more-flexibility-in-refund-options-in-case-o", "header": "add more flexibility in \"refund\" options in case of mistakes", "idea_text": "Hi ,I would suggest to add more flexibility in \"refund\" options in case of mistakes , something happens by mistake and you make sure that the service really not used or it used by mistake, you should refund the customer if he asks for refund.godaddy is giving a full refund is something happens by mistake, or you didn't use the service ! ", "author": "795344746", "created_at": "2018-06-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34950601-our-head-office-handles-multiple-sites-with-multip", "header": "Our head office handles multiple sites with multiple domains.  We have users at each domain.  It would be helpful to have the invoice calcul", "idea_text": "Our head office handles multiple sites with multiple domains all in one Microsoft Account.  We have users with exchange accounts for each domain.  Is it possible to split the invoice by how many users at each domain rather than total licences?  It gets very onerous each month trying to calculate how to charge back the different sites especially when you add and delete users.  Subtotal by site or domain would be extremely helpful!  Thanks!", "author": "827819224", "created_at": "2018-07-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35337928-non-profit-invoice-approval-taking-too-long", "header": "non-profit invoice approval taking too long", "idea_text": "I have been waiting for a long time to convert my trial subscription to real and still nothing happens and already got trial expiry warning ...", "author": "847366891", "created_at": "2018-09-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35225866-payment-via-bank-transfer", "header": "payment via bank transfer", "idea_text": "I would like to pay via bank transfer from the company account  after receiving an incoice or a letter of prepayment. Would it be possible?", "author": "842639134", "created_at": "2018-08-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35263720-creating-user-groups-for-inovicing", "header": "Creating user groups for inovicing", "idea_text": "Invoicing allows for the creation of users but not a way to group them or manage them under an umbrella.  It would be nice to be able to group users together and apply templates, settings, etc. for those users.", "author": "845758792", "created_at": "2018-08-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34787110-please-get-three-time-zones-back-into-outlook-2016", "header": "Please get three time zones back into Outlook 2016 64-bit as a regular feature.", "idea_text": "3 time zone feature introduces in the monthly channel on 23rd May which was disabled due to automatic  updates in Outlook. Please get this as a regular feature in ALL channels.", "author": "822123703", "created_at": "2018-07-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36755107-duplicate-ms-office-365-subscription-payments-auto", "header": "Duplicate MS Office 365 subscription payments auto-charged to my credit card", "idea_text": "MS confirmation ref: 146007238 (phone conversation with MS subscriptions 05/02/2019)\nOn checking my £59.99 annual subscription payment automatically taken by Microsoft for Office 365, I have only just realised from auditing my annual accounts records that I have twice paid £59.99 for my Office 365 2018 subscription - once on 8/02/2018 which I'm advised was relative to my old freeserve.co.uk email address registered with Microsoft for my previous MS Office apps (please note that all freeserve e-addresses worldwide were terminated at the end of April 2017 by EE/Orange) and again on 17/02/2018 relative to my current hotmail.com address registered with Microsoft. This duplication is an error as I didn't have the presence of mind to advise Microsoft that my freeserve address had been terminated. I feel this is sharp practice by MS and feel let down by forces beyond my control relative to the complex nature Microsoft's subscription charging system and related terms & conditions. I would therefore like to request a refund of the £59.99 payment made on 8/02/2018. If this is not possible, please treat my misfortune as a complaint.", "author": "883005154", "created_at": "2019-02-05", "votes": 1, "reaction": [], "comments": [{"author": "915788272", "created_at": "2019-08-23", "text": "I have a subscription for one drive including 365 for $8, through one email address and thats what i want, and then another for $9.85 through google pay and another email address. It shows no way to cancel one of them on google pay. marneymobile is the one i want dumped from google pay and marneymobile2 is the one i want to keep. These are gmail addresses. I am totally angry it allows this ."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36873997-drop-the-annual-commitment-for-business-users", "header": "Drop the annual commitment for business users", "idea_text": "Many of our small business customers are already resistant to the subscription model and the confusion caused by Microsoft advertising two prices for the same service acts as a barrier to conversion.  Monthly licensing has the potential to overcome many objections but not when the additional cost per user is perceived as Microsoft profit gouging.  Small businesses are typically very loyal towards their service providers as they often lack the time and expertise to contemplate a migration.  Hence I suspect the premium for monthly licensing ends up costing Microsoft more than it generates. Certainly the choice of commitment makes my life trying to onboard customers more difficult.", "author": "884672710", "created_at": "2019-02-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36879298-costumer-signature", "header": "costumer signature", "idea_text": "", "author": "884735884", "created_at": "2019-02-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36831697-change-payment-terms-for-credit-card-customers", "header": "Change Payment Terms for credit card customers.", "idea_text": "Currently, if a customer uses a credit card, they are charged the next day.  However, the invoice reads, \"Payment Terms: Net 30.\"  If a customer pays by check, they get 30 days to pay.  Wouldn't it make sense for credit card customers to receive the same courtesy and payment terms?  Microsoft's policy is encouraging customers to NOT utilize the auto-payment.  I suggest Microsoft give us credit card payers the same terms as check payers.   ", "author": "884028292", "created_at": "2019-02-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36667207-timer", "header": "Timer", "idea_text": "Could you PLEASE add a timer that you could just hit start and stop and it would automatically take the time and use your hourly rate and place it on an invoice for you?", "author": "882030133", "created_at": "2019-01-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36852208-we-have-a-bill-to-address-but-we-also-need-an-op", "header": "We have a \"Bill To\" address but we also need an option for a second address \"Service Address\"", "idea_text": "Second address option on invoices", "author": "884301193", "created_at": "2019-02-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37617799-paying-for-365-with-paypal-balance", "header": "Paying for 365 with PayPal balance.", "idea_text": "Same as title. I really just want to be able to use my accrued PayPal balance to pay for my 365 subscription", "author": "899796889", "created_at": "2019-05-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36947839-windows-10-business-activation", "header": "Windows 10 Business Activation", "idea_text": "Hello, As an MSP with Microsoft, we are devoted to giving our customers with great service and the best technical support that we can provide them. In any case, there is an issue with trying to activate Windows 10 Business license for M365, there is an environment that we tried to deploy for and it seems that the issues with trying to activate workstations that have Windows 10 Home. The customer had bought a new Microsoft Surface laptop and it had Windows 10 Home, we tried to get it to activate but it seemed that the customer would've had to purchase a Windows 10 Pro license. To us, this makes no sense at all as to why the customer would need to pay for a monthly subscription, and then they need to pay an additional fee for the Windows 10 Pro license. In our opinion, it should not work this way, why would we need to have a Windows 10 Pro? We understand that Windows 10 Home and Pro are two different animals all together, but if that statement is really true, then you shouldn't be able to enter a Windows 10 Pro product key to activate from Windows 10 Home. It should be set and stone that each laptop would be compatible to Windows 10 Pro OR Home. It should work the same way with the licenses when it comes to Windows as a service.Please assist.", "author": "885834289", "created_at": "2019-02-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37763137-microsoft-should-use-peppol-based-e-invoices-when", "header": "Microsoft should use Peppol based e-invoices when sending invoices", "idea_text": "Microsoft support Peppol based e-invoicing in both Navision/Dynamics 365, but Microsoft does not give us the option to receive invoices in that format from Microsoft. This would make life much easier instead of paper based invoices", "author": "894553294", "created_at": "2019-05-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37450375-file-name-pdf-invoice-file-name-should-be-intuiti", "header": "File Name: PDF invoice file name should be intuitive based on service and billing month ex. : Office365_20190423.pdf", "idea_text": "PDF invoice file name should be intuitive based on service and billing month ex. : Office365_20190423.pdf", "author": "896025478", "created_at": "2019-04-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37414918-there-is-a-permissions-report-on-folders-and-subfo", "header": "There is a permissions report on folders and subfolders without sharepoint. It would make it easier when working with inheritance breaches", "idea_text": "There is a permissions report on folders and subfolders without sharepoint. It would make it easier when working with inheritance breaches", "author": "895351351", "created_at": "2019-04-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36920971-allow-invoicing-to-be-available-for-puerto-rico", "header": "Allow Invoicing to be available for Puerto Rico.", "idea_text": "Allow Invoicing to be available for Puerto Rico. It's a large market looking for options besides Quickbooks, Freshbooks or Peachtree.", "author": "885344443", "created_at": "2019-02-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37819915-i-tried-invoice-the-char-limit-in-the-desc-field-i", "header": "I tried Invoice-the char limit in the desc field is prohibitively small for a consultant whose clients require details-FAIL-back to manual", "idea_text": "", "author": "425972941", "created_at": "2019-06-03", "votes": 1, "reaction": [], "comments": [{"author": "425972941", "created_at": "2019-06-03", "text": "Update the limit to 999 char for the description field. Also add a date field, how can you skip the date?"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37840897-subscription-purchase-history", "header": "Subscription Purchase History", "idea_text": "Microsoft, One of our customers wanted to know who bought an Office 365 subscription for Yammer Enterprise licenses. We could not find out via the Admin Center or by logging a request to Microsoft Support. The latter directed us to this website for assistance. I understand this will be a new feature request which is fine. The current issue we have with our customer can be resolved but going forward this may come up again in the future. We require an audit trail of who buys the subscriptions.", "author": "893682484", "created_at": "2019-06-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37870531-your-invoice-date-and-due-date-are-rightly-indicat", "header": "Your Invoice Date and Due Date are rightly indicated as two different dates-some 30 days apart but you have charged me on the day of invoice", "idea_text": "If you do intend to charge in advance then why not make the invoice due date to be the same as invoice date or better still, give the customer 30 day credit as the invoice implies.\nOtherwise it causes confusion to the accounts  department who are reconciling bank statements with invoices.", "author": "904922329", "created_at": "2019-06-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37937791-change-currency-symbol", "header": "change currency symbol", "idea_text": "Allow for on the fly changing of currency symbol and the option to disconnect from microsoft pay.", "author": "901599553", "created_at": "2019-06-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38467681-allow-for-tracking-billable-hours-then-generating", "header": "Allow for tracking billable hours, then generating invoices", "idea_text": "Allow for keeping track of billable hours and generating invoices for customers based on entries per matter.", "author": "916293847", "created_at": "2019-08-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38541610-this-app-have-no-option-to-deduction-of-20-for-a", "header": "This app have no option to deduction of 20% for a tax man , u can add 20% but not  athr  way \nRegards\n\nWhat u want from me now", "idea_text": "", "author": "917472268", "created_at": "2019-09-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38640880-edit-the-template", "header": "Edit the template!", "idea_text": "The default template looks very amateur! Why no customisation on the design seeing as there are 100+ invoice templates included with Word!", "author": "920686450", "created_at": "2019-09-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38623633-invoice-template-requires-po-number-field", "header": "Invoice Template Requires PO Number Field", "idea_text": "The template requires a field for a PO Number, I am currently having to add it into the Notes section on the bottom as none of my clients will accept an invoice without a PO Number on", "author": "920430775", "created_at": "2019-09-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38578186-consolidate-billing-to-have-1-billing-cycle", "header": "Consolidate billing to have 1 billing cycle", "idea_text": "We have over 10 bills a month (all for different products) that then each have their own service periods. Some invoices have 4 or 5 service periods within the one bill as well. For accounting purposes it would be much easier to only have 1 billing cycle for all services.", "author": "919409419", "created_at": "2019-09-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38542408-client-refunds-and-credits", "header": "Client Refunds and Credits", "idea_text": "To my knowledge, there is currently no way to issue a credit or refund after an invoice has been sent. While it's vexing enough that an invoice has to be cancelled rather than modified and resent, there is no way to account for a refund that has been issued or a means to create a credit towards future purchases with the client. This is a small but common need for most businesses and greatly impacts the feasibility of our company to continue use Invoicing as a long-term invoicing solution.", "author": "917483131", "created_at": "2019-09-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37955578-provide-invoices-with-sales-tax-vat-for-subscrip", "header": "provide invoices with sales tax (VAT) for subscription products", "idea_text": "Allow download of invoices for subscription products", "author": "907709809", "created_at": "2019-06-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38004511-rechnungen-an-editierbare-emailadressen-statt-an-a", "header": "Rechnungen an editierbare Emailadressen statt an alle Administratorenrollen", "idea_text": "Rechnungsversand adressen sollten einzeln editierbar sein, statt global rechnungen an alle Adminrollen rauszuhauen, das nervt, ich will Rechnungen z.B. nur an buchhaltung@ schicken lassen, als Adresse meiner Wahl, ohne eine Person zum Admin/Rechnungsadmin zu machen, das ist voll unprofessionell, das man nicht seine Wunschadresse editieren kann, wer denkt sich nur sowas unpraktisches aus, was ist denn wenn ich das an externe Adressen, Verteiler oder freigegebene Postfächer schicken will?", "author": "908469394", "created_at": "2019-06-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34096528-you-have-to-be-able-to-add-text-to-line-items-to-i", "header": "You have to be able to add text to line items to individually show what the variable line item is for. (I. E. Usage fee \"John doe hire\".)", "idea_text": "You have to be able to add text to line items to individually show what the variable line item is for. (I. E. Usage fee \"John doe hire\".) ", "author": "699561859", "created_at": "2018-04-28", "votes": 2, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2018-05-02", "note": "Thank you for your suggestion! Just for clarification, I assume that you mean a separate field to store the more elaborate description, and not just more space in the current description field? \nToday, you can write descriptions of each line item as part of the description field, such as “Usage fee for having John around for an hour”. But if I understand you correctly, you have a need for something like “John’s services” and then “Lawn mowing” versus “Cleaning the roof”. Is that correctly understood? If so, you might want to create separate prices (lines) for “John cutting the lawn” and “John cleaning the roof” plus an entry for “Usage fee”. Would that make sense?Thanks!"}], "comments": [{"author": "890239825", "created_at": "2019-08-22", "text": "I would like to add more context to this.Currently - unless it's just not clear - you cannot have a Product Name and Description show as separate things with more flexibility to the Description field.  This is critical in hourly billing charges.An example would be:ONSITE WORK (the product)\nJohn for Period of 3/1 to 3/6 (the description)Where \"John\" and the two dates are dynamically generated from something else (Ideally).  Otherwise just an empty separate box would be fine to manually enter this data."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34056199-deduction-of-deposits", "header": "Deduction of Deposits", "idea_text": "Team,I have just transitioned from a 3PP invoicing app to Invoicing. My desire is two fold. First, I’d like to have a way to send a customer an invoice that shows when a deposit has been made and then the remaining balance. Second, a way to send an invoice that has been paid and have the invoice show this paid status. Thank you.  ", "author": "780572932", "created_at": "2018-04-24", "votes": 2, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "I agree with this idea. There should be an option of submitting a \"payment received\" notice, and an updated invoice showing \"amount remaining due\". The invoices should also reflect whether they are Draft, Open, Cancelled, or Paid."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33995623-invoice-pricing-from-sharepoint-onedrive-excel", "header": "Invoice pricing from SharePoint, OneDrive: Excel", "idea_text": "When creating an invoice or estimate, it would be great if prices could be linked to an Office document such as Excel from SharePoint, OneDrive, or Excel. Maintaining a static list of prices is time intensive, and prone to error. ", "author": "778502827", "created_at": "2018-04-18", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34921642-allow-microsoft-invoicing-for-indian-customers", "header": "Allow Microsoft Invoicing for Indian Customers", "idea_text": "We have a strong interest in taking your service for our businesses in India. Requesting you to allow the use of this app for Indian users. ", "author": "827017726", "created_at": "2018-07-24", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31208398-other-emails", "header": "Other emails!", "idea_text": "I need invoice app and I don't have microsoft 365 account! I have microsoft account with my yahoo mail! What should i do?!!", "author": "662411140", "created_at": "2017-09-04", "votes": 2, "reaction": [{"status": "feedback taken", "author": "398985916", "created_at": "2017-09-22", "note": "We’re not currently planning to include support for personal email accounts."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34993711-purchase-order-option-should-be-added-to-track-all", "header": "Purchase Order Option should be added to track all processes of a buy/sellcycle", "idea_text": "You have options to 'Sell' items only, however this is not the full picture of what is required to make a sale. 3 steps should be included: Estimates - PURCHASE ORDERS - Invoice. \nExample: If I am buying an item from a supplier to fulfill an order for a client, I need to generate a Purchase Order after I receive the suppliers estimate. This tells them I want to buy the items on estimate.  I will then sell these items to a client and generate an Invoice for payment.  You should add a Purchasing Option so the entire purchasing/selling pipeline can be tracked together.\n", "author": "828799303", "created_at": "2018-07-31", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38485417-please-make-invoicing-available-in-australia", "header": "Please make Invoicing available in Australia", "idea_text": "Invoicing available in Australia, with GST tracking", "author": "916560049", "created_at": "2019-08-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38102743-disable-invoice-description-autocomplete", "header": "Disable Invoice description autocomplete", "idea_text": "If you enter a description value that starts with a number. Then fill in the next description line with the subsequent number (and maintain the rest of the description similar to the previous one), it will autocorrect to the previous number. There should be a way to disable this and let the user enter the description values as needed.", "author": "910256344", "created_at": "2019-07-09", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37948492-developper-ms-invoicing-pour-la-france-tres-vite", "header": "DEVELOPPER MS INVOICING POUR LA FRANCE TRES VITE !", "idea_text": "DEVELOPPER MS INVOICING POUR LA FRANCE TRES VITE !\n", "author": "907604749", "created_at": "2019-06-18", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32148901-managing-expense-items", "header": "Managing expense items", "idea_text": "I provide professional services. Some invoice items I can easily add using the hour, day or specific service structure. However I recharge expenses (travel and accommodation for example). This item will vary on every invoice. At the moment I can create an Expense item and manually change the value. This is okay except that I have to enter the price inclusive of VAT which is annoying. Is this is the best way to handle this item? Other than the VAT issue having an unpriced item that forces a manual value to be entered would ensure I didn't accidentally send out an invoice with £1 as an expense.", "author": "700491799", "created_at": "2017-11-06", "votes": 3, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-07", "note": "Thank you for your feedback!\nWe are considering adding the option of prices exclusive of . You can create that Expense item and mark it as  = 0 and therefore  won’t be calculated in this item.\nRegarding the manual change of value, we don’t see any good alternative right now as the amount (e.g. travel and accommodation) will be different from one invoice to the other."}], "comments": [{"author": "700491799", "created_at": "2018-03-27", "text": "Unfortunately I have to charge VAT on expense items as they are an expense incurred in providing the service."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31883431-2-factor-authentication-enabled", "header": "2 factor authentication enabled", "idea_text": "The application doesn't send emails if you have 2 factor authentication enabled.", "author": "684767506", "created_at": "2017-10-14", "votes": 3, "reaction": [{"status": "try this instead", "author": "398985916", "created_at": "2017-10-17", "note": "Hello again,\nTry this: Create an app password and use that instead. You can see a guide here: "}, {"status": "thinking about it", "author": "398985916", "created_at": "2017-10-17", "note": "Thank you for your feedback! We’re taking a look at the 2 factor authentication situation and will post a follow-up when we’re ready."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32274583-add-to-e-plans", "header": "Add to E plans", "idea_text": "Please make available to E plans.", "author": "710858926", "created_at": "2017-11-15", "votes": 3, "reaction": [{"status": "feedback taken", "author": "398985916", "created_at": "2017-11-16", "note": "Thank you for your feedback! Microsoft Invoicing is currently available to customers who have an Office 365 Business Premium subscription. We do not currently plan to make the app available in other subscriptions."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34888543-identification-of-cancelled-invoices-on-printed-in", "header": "Identification of cancelled invoices on printed invoices", "idea_text": "Although on the invoicing list shows the status of the invoice as cancelled, when printing the invoices there is no clear identification showing that the invoice was cancelled.", "author": "781996768", "created_at": "2018-07-20", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33033553-receive-an-email-when-office365-s-password-will-ex", "header": "Receive an email when Office365's password will expirate", "idea_text": "When office365's password is being expirated, user doesn't receive an email few days before and his account is blocked after\nThis would be great to simply receive an email when Office365's password will expirate", "author": "743731528", "created_at": "2018-01-22", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33043615-multiple-business-profiles-to-be-created", "header": "Multiple business profiles to be created", "idea_text": "My use case is that I have two different wings of the business that provide different services and essentially I would like to have two separate business profiles so the correct one is appended on the invoices", "author": "744141424", "created_at": "2018-01-22", "votes": 3, "reaction": [], "comments": [{"author": "854839759", "created_at": "2018-10-02", "text": "I have an office location doing business as a different entity as well as six different branch offices, the branch offices would like to be able to have their address and logo on the invoice. Having multiple business profiles seems like it would alleviate the current limitation of one business name/address/logo "}, {"author": "759730156", "created_at": "2018-02-23", "text": "I have multiple entities in Bookings and it would be great if I could switch business profiles in the Business center and invoice customers separately similar to my ability to switch entities in Bookings and schedule appointments. Right now, I have 4 entities through which I can book client appointments, but I am only able utilize one of those entities to invoice that entities' clients. Invoicing is a great feature! I would love to see it expanded to the entirety of my corporate umbrella."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33520594-allow-invoicing-to-work-with-quickbooks-accounts-w", "header": "Allow Invoicing to work with Quickbooks accounts without VAT registration", "idea_text": "The need for Invoicing to be able to work for businesses that are not VAT registered has been explained in other posts. However, I have found a new showstopper - Invoicing won't connect with a QuickBooks account that is not set up for VAT. This is a nonsense - Invoicing seems to be aimed at smaller business and many will be below the VAT threshold. I wonder if the Invoicing development team (assuming there still is one as nothing seems to be happening) appreciate that many businesses do not have to apply VAT.", "author": "711931657", "created_at": "2018-03-03", "votes": 3, "reaction": [{"status": "in the plans", "author": "398985916", "created_at": "2018-03-13", "note": "Sorry for the delay in getting back to you, but thank you for your suggestion!\nWe do have an active development team for Invoicing, and your suggestion has just been added to their backlog. We’ll get someone to look into this very soon, and hopefully we’ll get this out in an update within too long.Thanks!"}], "comments": [{"author": "886328545", "created_at": "2019-02-28", "text": "Just come across same issue and would have used Invoicing but I am not VAT registered so the account on Intuit QuickBooks cannot be linked. I see this issue was already mentioned in another comment left in March 2018... one year after same issue still unresolved. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33234523-provide-the-ability-to-sort-invoices-on-columns-ot", "header": "Provide the ability to sort invoices on columns other than recipient", "idea_text": "Provide the ability to sort invoices on columns other than recipient by clicking on the column heading", "author": "752296093", "created_at": "2018-02-06", "votes": 3, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-02-12", "note": "Thank you for your suggestion! We have this on our list of capabilities to add to Invoicing if more people are interested."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33813124-invoicing-app-is-very-limited-and-poorly-designed", "header": "Invoicing app is very limited and poorly designed. Take some ideas from Zoho Invoice. By far a much more advanced software", "idea_text": "", "author": "772449541", "created_at": "2018-03-31", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34029358-give-all-potientiel-users-the-option-to-use-all-te", "header": "Give all potientiel users the option to use all templates and layouts regardless of relationship", "idea_text": "We would like Microsoft word to not only be compatable with all devices but to give all users \"The Option\" to all templates and layouts regardless of their relationship to Word. Due to new updates, it is impossible to operate this software freely with or without an account. Users should not be limited to only one option \"Word\" provides.", "author": "779725582", "created_at": "2018-04-22", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37034047-mobile-payment", "header": "Mobile Payment", "idea_text": "I would like to accept a payment from a customer from the mobile app then send them a paid receipt. \nThere are other invoicing programs that do this and it would be nice to have it fully integrated into Invoicing", "author": "887268895", "created_at": "2019-03-06", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36681661-microsoft-should-not-increase-non-profit-prices-dr", "header": "Microsoft should not increase non-profit prices dramatically and without notice", "idea_text": "We as a non-profit organisation recently received a greater than 50% increase in the price of our subscription without any notice.\n1) Microsoft should recognise that most non-profit organisations are focused on delivering their benefits and such a dramatic price increase has an impact on this\n2) As a very minimum there should be considerable (6 months?) notice of price increases, with the option to cancel subscriptions without penalty, so non-profit organisations can plan accordingly", "author": "882228979", "created_at": "2019-01-30", "votes": 3, "reaction": [], "comments": [{"author": "892940749", "created_at": "2019-04-06", "text": "So totally agree with the other comments that the price increase for us non-profit organisations of almost 50% is unreasonable.  No warning was given either, so we cannot discuss our options moving forward and we seem to be stuck.Why was the price increase so high?  We are non-profit organisations that need to be very careful with our administration costs.  Please assist us.\n"}, {"author": "791869840", "created_at": "2019-03-06", "text": "Same issue here - 84% increase for our licence cost. This is a massive hit for our non-profit, and we had no chance to even budget for this change."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/37201411-south-africa", "header": "South Africa", "idea_text": "Would like to have it available in South Africa for SME's ", "author": "890573584", "created_at": "2019-03-26", "votes": 3, "reaction": [], "comments": [{"author": "919204297", "created_at": "2019-09-10", "text": "It will be great if this feature can become available to SME's in South Africa, it will really help us out a lot."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32043121-integrate-invoide-with-flow", "header": "Integrate invoide with flow", "idea_text": "Enable flow to do things like creation of estimates and draft or send invoices as a flow from other events.", "author": "700491799", "created_at": "2017-10-27", "votes": 4, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-02", "note": "Thank you for your feedback! We’ve added it to the list of things to consider for a future update since workflows like the ones you describe are relevant to several businesses."}], "comments": [{"author": "783575224", "created_at": "2018-06-21", "text": "You would think along with this, the size of file transfer a flow can do would be upped significantly, especially in this case 50 MB will get them about 2% of a file when it comes to these type of things."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34122454-allow-discount-description", "header": "Allow discount description.", "idea_text": "On the discount line there needs to be an option of listing the reason for the discount. ", "author": "782719624", "created_at": "2018-05-01", "votes": 3, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2018-05-02", "note": "Thank you for your suggestion! Just for clarification, do you mean space for an extra description next to the discount, or a separate line below or above?"}], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "I agree with this idea. There is currently a line and header discount, but no direct method to specify the discounts. A current workaround is using the notes, but it would be cleaner to have next to the line. If line notes were possible, I think it would suffice. "}, {"author": "782719624", "created_at": "2018-05-29", "text": "Either next to it or below. Just a place that I can insert a comment of why the discount was given. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32847856-tax-number", "header": "tax number", "idea_text": "I found your product interesting but unfortunately, it seems that we can't enter 2 differents tax numbers ; which is required on each invoice in Quebec, Canada.", "author": "734732944", "created_at": "2018-01-07", "votes": 4, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-01-17", "note": "Thank you for suggesting this! We’re currently investigating the right solution to this."}], "comments": [{"author": "734732944", "created_at": "2018-08-28", "text": "Any update on that suggestion ?!? Thanks !"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34374472-allow-option-to-add-late-fee-percent-if-not-paid", "header": "Allow option to add late fee percent if not paid", "idea_text": "Would be great to allow a late fee (e.g. 1.5%) to the invoice when payment is not received. Then we can manually resend the invoice with the updated amount each term (e.g. NET 30). It might be best to not have it automatically do this because we may forget to mention that we received payment by check in the mail...Or can this all be done manually? I imagine there would need to be enough flexibility with the invoice document to include a late fee and a new date...", "author": "766712116", "created_at": "2018-05-28", "votes": 4, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "I agree with this idea. Having the option to automatically apply a late fee would improve the collections process. Additionally, a reminder email should automatically send based on the payment terms. For example, if you have a customer setup for Net30, a reminder email sends on 25th day. Within the email it would explain the late fee. On Day 30 we should receive a notification email of the lack of payment which would allow us to resend with the late fee applied."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33052498-allow-copying-an-invoice", "header": "Allow copying an Invoice", "idea_text": "Allow us to copy an invoice that has been sent, paid, or cancelled.", "author": "401737321", "created_at": "2018-01-23", "votes": 4, "reaction": [], "comments": [{"author": "882926422", "created_at": "2019-02-04", "text": "Cumbersome system so far guys, provide the ability to copy and paste estimates so we can send to other customers. Better yet allow to send one estimate to multiple customers with anonymity.Allow user to edit an invoice after its been sent. Sometimes Customers come back with other requests.Get er done, thanks."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33399199-allow-invoices-to-be-sent-to-custom-email-address", "header": "allow invoices to be sent to custom email address", "idea_text": "Hi,please allow sending the invoices to other email addresses than the admins. e.g. . Usually the admins are tech people and they are not working in accounting.Thanks!", "author": "120216066", "created_at": "2018-02-21", "votes": 5, "reaction": [], "comments": [{"author": "876508912", "created_at": "2018-12-21", "text": "Confirmed this works. You can setup a shared email \"\". Then go to Active Users and assign a license with Exchange capability."}, {"author": "778303699", "created_at": "2018-04-18", "text": "YES!  I also would like to see this idea developed.  Our bookkeeper wants all invoices to be sent to a custom email address and right now I have to save each invoice as a PDF and email it myself."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33852175-send-invoice-from-a-shared-mailbox", "header": "Send Invoice from a Shared Mailbox", "idea_text": "Instead of sending invoices from a user account, I would like to send from a shared mailbox so that I can scale my accounts receivable team up as necessary.  This is also important as our \"billing\" shared mailbox is an important part of our communication branding for B2B clients.", "author": "710747901", "created_at": "2018-04-04", "votes": 5, "reaction": [], "comments": [{"author": "876508912", "created_at": "2018-12-21", "text": "Confirmed this works. I created a shared email \"\". Then, you'll need to go to Active Users and assign a license with Exchange functionality."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33864661-invoice-companies-as-well-as-individuals", "header": "Invoice Companies as well as individuals", "idea_text": "Although we are a small business, virtually all our clients are major corporates - the fact that we cannot add the Company name to the Contact and Invoice is a major weakness. Until this is resolved and the issue of BACS payment details is sorted we will not be able to use Invoicing", "author": "774296503", "created_at": "2018-04-05", "votes": 5, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "I agree with this idea. There should be a field in the Contacts to allow not only the employee name but also the company name. This not only makes practical sense when dealing with corporate clients, it also allows better searching, filtering, and metrics. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33813127-better-and-more-credit-card-integration-services", "header": "Better and more Credit Card integration services", "idea_text": "", "author": "772449541", "created_at": "2018-03-31", "votes": 4, "reaction": [], "comments": [{"author": "900404941", "created_at": "2019-05-14", "text": "I would suggest Venmo "}, {"author": "876508912", "created_at": "2019-01-02", "text": "Can you expand on this request? What services/features are you recommending?"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34424770-can-change-day-of-billing-account-of-office-365-bu", "header": "Can change day of billing Account of Office 365 Bussiness", "idea_text": "The Office account creating make a fix day for a Billing, but this day is inside a interval o close the bill of my credit card. The support of Office told me the office was make in this way, can't change a day os billing. I would like this change. Thanks, Sorry for my bad english, I'm brazillian.", "author": "793031224", "created_at": "2018-06-01", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36033856-allow-different-payment-methods-at-the-same-time", "header": "Allow different payment methods at the same time (bank transfer + credit card payment)", "idea_text": "I am not really convinced why Microsoft is not allowing end users to choose their preferred payment method on the day of payment.\nIt is so uncomfortable to have these kind of limitations.\nIt will be really great to have below options: 1.\tFor big amounts user to choose wire/bank transfer\n2.\tFor small amounts user to choose credit card payment\nIts just so simple and why its difficult for Microsoft, I really don’t understand.Please support my idea so we can make it happen… \n", "author": "870025666", "created_at": "2018-11-16", "votes": 5, "reaction": [], "comments": [{"author": "884444464", "created_at": "2019-03-14", "text": "I support this. Having to cancel and make a new subscription when I need to change payment method seems crazy. I should be able to give you money however you can accept it."}, {"author": "876508912", "created_at": "2019-01-02", "text": "I support this idea. A customer/client may prefer credit card payments or bank transfers. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36173203-make-it-available-in-austria", "header": "Make it available in Austria!!", "idea_text": "We realy need this!", "author": "873900502", "created_at": "2018-12-03", "votes": 5, "reaction": [], "comments": [{"author": "901515376", "created_at": "2019-09-24", "text": "When it will be available in Austria?"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/38640127-have-bank-account-payment-method-be-available-in-a", "header": "Have Bank Account payment method be available in Australia", "idea_text": "It would be beneficial for small companies that do not apply for a credit card named after the company or for the company.\nSo instead of using one's credit card, it is best to have bank transfer instead.", "author": "904129396", "created_at": "2019-09-19", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36852178-ms-invoicing-in-belgium", "header": "MS Invoicing in Belgium ?", "idea_text": "", "author": "884300896", "created_at": "2019-02-14", "votes": 5, "reaction": [], "comments": [{"author": "903877816", "created_at": "2019-06-01", "text": "I would like to know when Ms Invoicing will be available in belgium?"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31951597-create-stable-version-for-firefox", "header": "Create Stable Version for Firefox", "idea_text": "I am only able to access Invoicing on Chrome.My primary browser, Firefox, does not completely load screens.", "author": "693249148", "created_at": "2017-10-19", "votes": 6, "reaction": [{"status": "try this instead", "author": "", "created_at": "2017-10-24", "note": ""}, {"status": "thinking about it", "author": "398985916", "created_at": "2017-10-24", "note": "Hi Paul,\nIt looks like we may have a problem with the latest version of Firefox. We’re investigating compatability, but please use another, supported browser, such as Chrome."}], "comments": [{"author": "876508912", "created_at": "2018-12-21", "text": "I confirm Firefox usability is stable. One thing to note, I have problems with O365 when cookies and trackers are all blocked."}, {"author": "776056840", "created_at": "2018-04-11", "text": "I have been experiencing this and other issues each time MS tweaks something, or each time Firefox does a security update. Why doesn't Microsoft keep up???"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33065158-a-section-for-bacs-details-for-bank-transfer-payme", "header": "A section for BACS details for bank transfer payments", "idea_text": "I really want to use MS Invoicing but without this feature it's pointless.All our clients pay via bank transfer and to not be able to put these on the invoice makes it unusable", "author": "744898225", "created_at": "2018-01-24", "votes": 13, "reaction": [], "comments": [{"author": "776476291", "created_at": "2018-04-12", "text": "An absolute must.  C'mon MS.  It's 2018!"}, {"author": "756954694", "created_at": "2018-02-17", "text": "Testing the feature for Testlio"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31883437-payment-by-cheque", "header": "Payment by Cheque", "idea_text": "The template includes a line \"please make cheques payable to\"\nMy business doesn't accept cheques so can this be removed?", "author": "684767506", "created_at": "2017-10-14", "votes": 8, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-19", "note": "Thank you for your feedback! That is a valid point, but we don’t have an easy way in which to remove that line. We’re looking into a couple of options, so this will hopefully be avoided in an update later."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31951579-enable-invoice-updating-and-reissuing-to-include-r", "header": "Enable Invoice Updating and Reissuing to Include Registered Payments", "idea_text": "Right now you can register payments received after initial invoice send, but you cannot issue an updated invoice reflecting the balance owed after accounting for said payments.This seems like it would be basic functionality in an invoicing system: The ability to generate on-demand invoices reflecting the current balance of account and any payments made to date.", "author": "693249148", "created_at": "2017-10-19", "votes": 30, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2017-10-24", "note": "Thank you for your feedback! If we read it correctly, you’re asking for the ability to issue reminders to your customers that they still owe an outstanding amount. Is that correctly understood?"}], "comments": [{"author": "915076936", "created_at": "2019-08-17", "text": "When a partial payment is made the invoice needs to reflect this "}, {"author": "900404941", "created_at": "2019-08-17", "text": "After you received the payment, you want to send a receipt. That’s the Invoice with the payments and the new balance. This is really important!\nIn the Competitor products like QuickBooks and Freshbooks customer can get a link and see the updated invoices whenever thay wane.\n"}, {"author": "904348036", "created_at": "2019-06-05", "text": "I'm not even able to edit the overdue amount once it's paid by the customer. So far everything I have in my balance is either overdue or outstanding payment, but so far everything has been paid for.My concern is this, what happens when customers will actually have outstanding payments and that basically it shows that ALL of my customers do. How will I be able to track that down??Fix this bug please ASAP. "}, {"author": "898209004", "created_at": "2019-05-01", "text": "As Mary has stated when partial payment are made and a balance is still due. It shows a outstanding balance due in red, and we are suppose to be able to resend invoice to customer with all the partial payment made, and the amount past due.\nIt's a big BUG!"}, {"author": "786847180", "created_at": "2019-02-09", "text": "Yes.   Each time you place an order you get an invoice monthly for THAT order.   Better reschedule and get them all at once in one invoice and pay once.  Lot of admin now."}, {"author": "882894271", "created_at": "2019-02-04", "text": "I agree with this one. It is basic functionality. I created a $100 invoice for a workshop and then registered a $30 payment since the future attendee had paid the $30 deposit. I see in their invoice that the system recognizes they now only owe $70 but yet even if I manually re-send the invoice, the attendee is still prompted to pay the full $100. This seems like a bug."}, {"author": "864685945", "created_at": "2018-10-31", "text": "What we need is to RESEND the invoice to the customer confirming the full payment or partial payment,  saying \" PAID\"  or PAID AND PENDING X AMOUNT."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33155080-microsoft-invoicing-api", "header": "Microsoft Invoicing API", "idea_text": "A lot of Office 365 API are available.  Will Microsoft Invoicing have an API.\nAt least initially, APIs to change status of an Invoice from Open to Paid will help manage many businesses.", "author": "749125462", "created_at": "2018-01-31", "votes": 18, "reaction": [], "comments": [{"author": "908433289", "created_at": "2019-06-25", "text": "MS Team, what about an effort to get this as a logic app inside of Microsoft Azure. Really from the viewpoint of a developer, the Microsoft Invoicing is just not as useful."}, {"author": "886982059", "created_at": "2019-03-04", "text": "Would love to use this for my client, but without the ability to programmatically create invoices I cannot propose this as a solution."}, {"author": "781570060", "created_at": "2018-04-27", "text": "I would like the API idea expanded.  My billing is very detailed, O365 services, Azure services, professional services, all collected n SQL during the month.  I would like the ability to update the invoice line items via an API.  Alternatively, it would serve just as well to be able to upload a .json file with the invoice details each month.  The ability to change an invoice status via an API is less valuable to me.\n"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/34091488-allow-entering-custom-item-descriptions-not-just", "header": "Allow entering custom item descriptions (not just on price list)", "idea_text": "The requirement to add every invoiced item to the price list makes invoicing unsuitable in scenarios where you're providing a service and your fees will vary with each and every client.How exactly are you meant to be able to invoice this?I should be able to create an invoice, add a new item line, and type an arbitrary description and amount, without having to select that from a predefined price list, or add it to such a list. ", "author": "781598269", "created_at": "2018-04-27", "votes": 7, "reaction": [], "comments": [{"author": "876508912", "created_at": "2019-01-02", "text": "I agree with this idea. Having every possible configuration of item/service in the price list is not practical or efficient. There should be a toggle to allow custom items without adding them to the price list. I recommend a toggle because some may prefer having all items/services listed in the price list "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/36027952-po-number", "header": "po number", "idea_text": "Add a field for customer PO number.", "author": "869899024", "created_at": "2018-11-15", "votes": 7, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33713758-consolidate-aggregate-each-month-s-invoices-into", "header": "Consolidate / aggregate each month's invoices into one", "idea_text": "Each month we get multiple invoices, each of which has to be recorded in our accounting system, paid, reconciled and reported for VAT purposes.  Please find a way of sending a single invoice each month with one line item per service, and taking one payment. ", "author": "401005171", "created_at": "2018-03-22", "votes": 8, "reaction": [], "comments": [{"author": "916068406", "created_at": "2019-08-26", "text": "I agree.  This is what Azure does."}, {"author": "878052658", "created_at": "2019-01-03", "text": "I experience the same problem every month with multiple entries for each subscription. I think Microsoft can consider holding all the bills until a specific date every month and charge them at once. Additionally, provide us just one statement to work with. Many times it gets hard to even identify which charge pertains to what. Amazon Web Services keeps the subscriptions of all services they offer in one place. The third party items in AWS are separate which is understandable."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33178663-allow-business-centre-to-be-used-in-france", "header": "Allow business centre to be used in France!!", "idea_text": "allow business premium users to use business centre in France. After all thats why I signed up for using business premium only to find I couldnt use it.. very dissapointing.", "author": "749980882", "created_at": "2018-02-02", "votes": 8, "reaction": [], "comments": [{"author": "907604749", "created_at": "2019-06-18", "text": "So am i !!!"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/35200360-combined-invoice-for-all-office365-licenses-under", "header": "Combined invoice for all Office365 licenses under the one account", "idea_text": "Currently we need to download several invoices, one for each license type in Office365.  It would help us if all of them were on tthe one invoice.  Perhaps an option for \"Combine invoices\"", "author": "840616063", "created_at": "2018-08-23", "votes": 9, "reaction": [], "comments": [{"author": "884345815", "created_at": "2019-02-14", "text": "We have several subscriptions for Office 365.Currently we need to download several invoices, one for each license type in Office 365. \nIt would help us if all subscriptions are on one invoice.We were also told by Microsoft support that we cannot change our payment method to invoice - check or wire, since it is less than a $1000.Our business payment system is based on invoices. Microsoft is definitely making it difficult for us to continue using Office 365. "}, {"author": "869177488", "created_at": "2018-11-14", "text": "I agree. Should be possible to group the different licenses on one invoice. "}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32043247-allow-invoices-to-be-saved-without-sending", "header": "Allow invoices to be saved without sending", "idea_text": "Invoice cannot be moved out of draft without sending email; for some clients I need to invoice differently but still track so would be useful to be able to save invoice out of draft state without sending an email and then use to track payments.", "author": "700491799", "created_at": "2017-10-27", "votes": 9, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-12-05", "note": "Sorry for the delay in getting back to you, but thank you for sharing your scenarios with us! We’re thinking about a possible solution for both scenarios, but specifically for your needs, would it be good enough if you could generate the  file on your computer and send that?"}, {"status": "tell us more", "author": "398985916", "created_at": "2017-11-02", "note": "Can you tell us a bit more about your scenario? An invoice is a legal document, but as far as we can tell from your feedback, you have a need to not send the document by email, but maybe you print it instead?"}], "comments": [{"author": "919137001", "created_at": "2019-09-10", "text": "With regards to 12/05/2017 comment. If creating a PDF would save/finalize the invoice, that would work. An issue is we don't want to \"send\" an invoice to a client, just because we are now using this program and are entering historical data."}, {"author": "700491799", "created_at": "2017-12-21", "text": "As long as the system doesn't automatically send the invoice then a step to generate the pdf would work fine."}, {"author": "700491799", "created_at": "2017-11-06", "text": "A colleague of mine is required to invoice online directly into a client's system and an email would be ignored at best."}, {"author": "700491799", "created_at": "2017-11-06", "text": "One client requires the invoice and supporting docs to come through as a single PDF. If I switched to using invoice with them they would complain. For this client I would like to raise the invoice but manually sends them the invoice by email in the format they have requested and use invoice to track the payment."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33455914-need-to-be-able-to-disable-vat-entirely", "header": "Need to be able to disable VAT entirely", "idea_text": "There is no option to disable VAT.As a non-VAT registered business, my invoices technically shouldn't make any mention of VAT, and setting it to 0% is technically wrong.Invoicing even puts an (empty) \"VAT Registration No\" at the bottom of every invoice with no way to turn it off.Please make VAT optional so it can be turned off and businesses who aren't VAT registered can use Invoicing efficiently.", "author": "760546111", "created_at": "2018-02-26", "votes": 10, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/30952234-allow-changing-the-units-off-of-per-hour", "header": "Allow changing the units off of per hour!!", "idea_text": "Right now there is a units column that you cannot choose to see until you send the invoice. When you send the invoice, it adds a units column and automatically says per \"Hour\" -- which is not how we invoice! This appears to be a bug in that there is no way to remove or edit the column, and we have to write a note saying essentially, \"Sorry, Microsoft doesn't let us change this units column, so please disregard the part about \"per hour\"!!", "author": "344375905", "created_at": "2017-08-22", "votes": 10, "reaction": [{"status": "in the plans", "author": "", "created_at": "2017-09-22", "note": ""}], "comments": [{"author": "299782012", "created_at": "2017-11-24", "text": "I too often invoice per project and work with others who invoice on a per \"task\" I.e. Rack Server = $100/server + $20/per two Cat6 and $20 per fiber/GBIC"}, {"author": "678617644", "created_at": "2017-10-03", "text": "Thank you. This is good and useful feedback. We will add the unit column to the lines part. If you have tried the phone client, you would notice that we actually do provide it there - albeit the UI is different there."}, {"author": "398985916", "created_at": "2017-09-22", "text": "You're supposed to manage the unit of measure on the item or service itself, not on the invoice. \nBut you have a good point about adding it to the open invoice, so we've added that suggestion to our list of proposed capabilities."}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/32003224-you-need-to-add-a-field-for-the-service-industry", "header": "You need to add a field for the service industry", "idea_text": "Cost per unit, cost per service, ", "author": "699561859", "created_at": "2017-10-24", "votes": 10, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-11-02", "note": "Thank you for your feedback. We’ve added it to the list of things to consider for a future update, if there is a need for tracking cost. Microsoft Invoicing currently aims at making invoicing easy, and cost accounting is not really part of that story. \nIf you need to track your cost, you might want to try out Dynamics 365 instead, perhaps?"}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31941655-allow-me-access", "header": "Allow me access", "idea_text": "When I try to sign in I get a message that this application is only for office 365 but I have this at business premium level so why cant I get in? ", "author": "692652160", "created_at": "2017-10-19", "votes": 10, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2017-10-24", "note": "Hi there, \nMicrosoft Invoicing and the rest of Business Premium is still in preview to a limited number of users. We’ll be generally available soon, so stay tuned!"}], "comments": [{"author": "781743601", "created_at": "2018-04-28", "text": "Where is it ?????"}, {"author": "755150014", "created_at": "2018-02-13", "text": "any news on release time?"}, {"author": "700343197", "created_at": "2017-11-08", "text": "Release date coming anytime soon?"}, {"author": "703358164", "created_at": "2017-11-01", "text": "Yeah I'd really like this to work. Really would be handy for my side business"}, {"author": "698452075", "created_at": "2017-10-21", "text": "Me too"}]}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/33456706-ability-to-change-line-item-fields", "header": "Ability to change line item fields.", "idea_text": "The ability to change the heading and/or meaning of each column in line items.   ", "author": "760582267", "created_at": "2018-02-26", "votes": 8, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2018-03-13", "note": "Sorry for the delay in getting back to you, but thank you for your suggestion!\nYou’re not the first to ask for this, and we’re still thinking about adding it in a later update if interest increases."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600781-microsoft-invoicing/suggestions/31951642-allow-for-automated-scheduling-of-invoice-sends", "header": "Allow For Automated Scheduling of Invoice Sends", "idea_text": "A feature where you automate the sending of invoices to customers based on a calendar date would be great.To have real usefulness, this feature would have to be paired with the ability to send updated invoices which include current balance and payments registered after initial invoice send (please see my other idea @  )Some invoices are paid over a period of time e.g. $10k invoice is to be paid in 4 monthly installments of $2,500.", "author": "693249148", "created_at": "2017-10-19", "votes": 56, "reaction": [{"status": "thinking about it", "author": "398985916", "created_at": "2017-10-24", "note": "Thank you for your feedback! Based on your suggestion, we’re considering adding support for recurring invoiced if there is a general interest in the market."}], "comments": [{"author": "890946481", "created_at": "2019-03-28", "text": "Just switched from Rackspace Email Plus to Office 365 through Rackspace and found Microsoft Invoices. We provide web services on a monthly payment schedule. Recurring Invoices would be great."}, {"author": "881055679", "created_at": "2019-01-22", "text": "Or make all invoices send on the invoice date, not date when \"sent\" button is pressed."}]}
