{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/16544638-personal-hub-as-home-page", "header": "Personal Hub as Home Page", "idea_text": "We have been doing a lot of training on Planner and OneNote recently and had an idea born out of some user frustration. Currently, there are several places that you can create/track tasks and projects that you work on. Thinking along the GTD methodology, it would be great to have a personal HUB in Office 365 that presented you will all of the tasks created/assigned to you across the platform--Outlook, OneNote, Planner, SharePoint. It would be further fabulous if those tasks shared a similar tagging structure.", "author": "260066731", "created_at": "2016-10-07", "votes": 9, "reaction": [], "comments": [{"author": "314137321", "created_at": "2019-05-17", "text": "Saddly, no one from Microsoft ever answered. Even if they now provide a solution to that with To-Do. "}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18856582-let-us-label-office-keys-under-my-account", "header": "Let us label office keys under my account", "idea_text": "I have multiple office keys listed under my account.  It is very difficult to figure out which key goes to which machine when I have to reinstall it for any reason.  It would be nice if I had the option to label them such as kids pc, office desktop, dads laptop, etc.", "author": "354169357", "created_at": "2017-04-06", "votes": 9, "reaction": [], "comments": [{"author": "764228530", "created_at": "2018-03-07", "text": "On the Office Account Installation page (, allow the account owner to change the name of the Used By: which always seems to display \"you\" AND/OR to make a note regarding the computer name which for home users is often just the default computer name from the manufacturer (and when the drive dies and needs to be replaced, you have to check every laptop in the family for the computer name to determine which is the one that should be removed and reinstalled).\nAlso, display not just the installation date, but the expiration date of the license."}, {"author": "691107574", "created_at": "2017-11-09", "text": "Agreed. I have a client that has three Office 2016 retail licenses that they activated on one MS account. Now, if ever I need to reactivate one of their installs, I put in the sign in details and it asks me to choose which license to use, but shows three identical products to choose from with no license number and no way to tell which one is the correct one to use. "}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/10895676-provide-a-search-box", "header": "provide a search box", "idea_text": "provide a search box to access templates so we don't have to browse through everything to find something we want.", "author": "126184857", "created_at": "2015-11-28", "votes": 11, "reaction": [{"status": "thinking about it", "author": "134847336", "created_at": "2016-01-26", "note": "Thanks for sharing your feedback. We are working on some cool new features in this area."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31912498-hide-mark-all-as-read-and-delete-all-buttons-in-ou", "header": "HIde mark all as read and delete all buttons in outlook owa", "idea_text": "Please add a setting that user can hide mark all as read and delete all buttons from office 365 outlook owa and fast. Those button are disaster waiting to happen. And also whi on earth those buttons are next to \"new email\" button which is used all the time. If you don't want to remove those from everyone, please add a setting to owa that user can disable those if wanted.", "author": "689970646", "created_at": "2017-10-17", "votes": 10, "reaction": [], "comments": [{"author": "859833937", "created_at": "2018-10-17", "text": "Please update this!!! "}, {"author": "758434000", "created_at": "2018-02-20", "text": "Los botones \"Marcar todo como leído\" y \"Eliminar todo\" deben poder desactivarse y/o esta acción debe solicitar la confirmación del usuario. Esta es solicitud de muchos de nuestros usuarios"}, {"author": "710943034", "created_at": "2017-11-16", "text": "I fully agree that the buttons  \"Mark all as read\" and \"Delete all\" must be intentionally looked for the user, I mean, not easy to click by mistake; in addition, they must be able to be deactivated, and undo the action.Definitely those buttons are a huge mistake from Outlook programmers, and must be removed ASAP.I presonally use the unread e-mails for organizing the 'pending to do' works, and by clicking the buttons  \"Mark all as read\" by mistake (which has happend to be twice), has made my daily organization to be very hard and risky to manage.Please Outlook programmers, take an URGENT action on this.\n"}, {"author": "710709565", "created_at": "2017-11-15", "text": "I agree. The buttons \"Mark all as read\" and \"Delete all\" must be able to be deactivated or/and this action should ask for confirmation from the user."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38537833-restore-print-detailed-and-agenda-option-in-rede", "header": "Restore \"Print detailed and agenda\" option in redesign of OWA calendars that was present in the previous design.", "idea_text": "In the previous design of OWA when printing a calendar there was the option \"Print detailed agenda and calendar\".  Many of our clients heavily relied on this and trained their teams to use this feature however this is no longer present in the redesign of OWA with no way to switch back to the old design when in the Calendar tab, confirmed by Microsoft Support.Office Online was the best solution for our clients as this met their cost requirements and needs however now features are being stripped we may have no choice but to look at alternative online solutions.", "author": "917412448", "created_at": "2019-09-05", "votes": 16, "reaction": [], "comments": [{"author": "917591209", "created_at": "2019-09-06", "text": "Can we have this back?"}, {"author": "917579875", "created_at": "2019-09-06", "text": "I miss previous version.."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11470944-microsoft-can-also-add-access-online-and-publisher", "header": "Microsoft can also add Access Online and Publisher Online", "idea_text": "I am actually frequent worker. Office online has given me the power to work and carry my documents anywhwere. The only thing that it lacks is access online and publisher online. I hope Microsoft will even make this idea a success. Thanks Microsoft for such assistance.", "author": "137917182", "created_at": "2016-01-16", "votes": 14, "reaction": [], "comments": [{"author": "900352210", "created_at": "2019-05-14", "text": "I have office 365 Home.  The offering of software applications were not sufficient enough or secure enough to do all my work online.  I then purchased office 365 enterprise e5, only to find that my most useful software, Microsoft Access, is not available online or in the App Store.  This is a real problem because I use Access to create numerous databases and I am trying to find a workaround to having my computer being actively being hacked all the time, by the government. How do you create a database without Microsoft Access.  Please respond at "}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37104049-outlook-foto-anhang-nur-im-textfeld-der-e-mail", "header": "Outlook Foto Anhang nur im Textfeld der E-Mail", "idea_text": "Microsoft Ticket: 13323134Hallo, seit dem wir Office365 verwenden, werden Anhänge (speziell Fotos) zum Großteil nur noch im Textfeld angezeigt, was das speichern der Fotos sehr umständlich macht. Obwohl der Absender die Fotos als Anhang und nicht als Textinhalt sendet, werden sie im Textfeld angezeigt. Ist es möglich hier in Outlook eine Einstellung vorzunehmen, welche dies beeinflusst ?", "author": "888655456", "created_at": "2019-03-14", "votes": 12, "reaction": [], "comments": [{"author": "921010693", "created_at": "2019-09-23", "text": "schließe mich Bianca an"}, {"author": "921010357", "created_at": "2019-09-23", "text": "Ich finde es auch äußerst umständlich die Fotos aus dem Text zu speichern - besonders wenn es mehrere Anhänge sind, da die Fotos mit dem Tool \"Alle Anhänge speichern\" nicht mitgespeichert werden können"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/10571742-let-viewers-change-their-background-picture", "header": "Let viewers change their background picture.", "idea_text": "Let viewers change their background picture.", "author": "119149563", "created_at": "2015-11-05", "votes": 14, "reaction": [], "comments": [{"author": "115557675", "created_at": "2015-11-06", "text": "Thanks for the feedback. It is greatly appreciated! This is definitely something we would like to enable in the near future."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19570750-allow-redirect-of-change-password-link-to-adfs", "header": "Allow redirect of Change Password link to ADFS.", "idea_text": "Allow redirect of  to  for Federated Customers.\n", "author": "394186825", "created_at": "2017-06-12", "votes": 18, "reaction": [], "comments": [{"author": "896340505", "created_at": "2019-04-24", "text": "There is any update for this question?"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36843547-ability-to-remove-the-first-name-greeting-for-stud", "header": "Ability to remove the first name greeting for Student licenses", "idea_text": "For education licenses faculty and students are greeted differently when logging into the office home page and student licenses should be updated to match faculty licenses.  Right now in our tenant we have faculty A1 licenses and student A1 licenses.  Faculty and Staff accounts are greeted with \"Good morning\" when they login while students are greeted with \"Good morning, first name\".In order to have these experiences be the same we would like to have student licenses to be greeted with the same \"Good morning\" message with no name.This is important because in Azure the first name field is pulling in the legal first name for students from other systems as I assume many other institutions may be doing.  However, not all students may go by their first name for any number of reasons.  It would be better for the student licenses to act the same way as the faculty licenses.  It is my understanding that faculty licenses were changed because they often go by their last name and didn't want their first name to be displayed on the page when doing a presentation to students.  These same considerations and preferences should be made for student accounts.", "author": "361105765", "created_at": "2019-02-13", "votes": 18, "reaction": [], "comments": [{"author": "889479736", "created_at": "2019-03-19", "text": "I support the improvement proposed by Jeff Rhoades herein.  As he states, not all students go by their legally-assigned first name, especially those who are transgender.  It is a matter of privacy and protection of these students, and indeed a simple matter of courtesy, that their names that they do not go as a matter of course do not get displayed in such a exceptionally simple manner."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36778255-be-able-to-login-on-office-365-with-multible-accou", "header": "Be able to login on office 365 with multible account's", "idea_text": "I have multiple accounts for multiple componies for office 365 but its difficult to manage this seeing that I need a diffrent browser for every account.", "author": "883270180", "created_at": "2019-02-06", "votes": 12, "reaction": [], "comments": [{"author": "912115171", "created_at": "2019-07-24", "text": "see also: "}, {"author": "896875408", "created_at": "2019-04-25", "text": "Terrible waste of time without this."}, {"author": "896578975", "created_at": "2019-04-24", "text": "Yes, it seems ridiculous that you have to \"work around\" with multiple browsers and/or private/incognito modes in order to work with multiple Office365 accounts. I work for three companies and want to be able to use all three accounts in just one browser - MS Edge?\nCome on Microsoft, get this happening. Many companies or moving to O365."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/17410072-delay-sending-emails", "header": "Delay sending emails", "idea_text": "My old out look office 365 / personal not included delay when interest to send an email at specific time , in my prevoiuse outlook: I click on Option then click on: Do not send email before: ( selected time and date ) I want this option added to outlook 2016", "author": "295979602", "created_at": "2016-12-12", "votes": 25, "reaction": [], "comments": [{"author": "867480022", "created_at": "2018-11-08", "text": "They have a feature called ‘Undo send’ but the max is 30 seconds. I found that I need at least a minute before I go, “oh no…” and I also need to have e-mails send right away so I had previously created an exception for when I mark e-mails as high importance to go out right away in Office 2010 & 2013. \n I’d recommend a send delay to everyone. E-mail is our primary means of written communication and we work in an emotional and passionate industry. Neutering my only tool to defend against myself and maintain the highest level of professionalism would be a devastating disservice. Technology is supposed to help us (similar to my delay rule) not hurt us. Additionally, I’ve accidentally hit send or discard multiple times in the Office 2013 interface when I’m trying to “pop out.” \n \nBenefits of delay send:\n•\t\n•\t \n•\tJeff Richards \n"}, {"author": "683405986", "created_at": "2017-10-12", "text": "Microsoft we NEED this in 365 .. a basic feature and pitiful it's not supported."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/12943818-set-default-office-installation-language-to-user-s", "header": "Set default office installation language to user's profile language", "idea_text": "Homepage \"portal.office.com\" / office apps client installation:\n- Use the language from the user's profile for office installation instead of \"English (United States) and/or\n- add a language presetting option in admin area under \"settings for software downloads\"", "author": "151788954", "created_at": "2016-03-15", "votes": 21, "reaction": [], "comments": [{"author": "873186901", "created_at": "2018-11-28", "text": "By using Excel online, with french parameters we see the formulas in Dutch ... A bug I guess .. and could you tell me how tochange the languages settings to be sure that everything in Microsoft office and Excel is in my own language (or the language I choose to use). Thank you"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32864941-create-webpart-to-embed-sharepoint-tasks-list-and", "header": "Create webpart to embed SharePoint Tasks List (and other lists)", "idea_text": "The current webpart to insert a sharepoint list will only work for Custom Lists.  But there are now so many different kinds of lists available under Insert App... they all need to be available to be inserted on pages using webparts.", "author": "297543136", "created_at": "2018-01-08", "votes": 22, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/10403133-remove-the-make-bing-your-search-engine-and-mak", "header": "Remove the \"Make Bing your search engine\" and \"Make MSN your browser homepage\" tickboxes.", "idea_text": "The default page requires two extra click to untick these options.", "author": "115066137", "created_at": "2015-10-26", "votes": 50, "reaction": [{"status": "working on it", "author": "134847336", "created_at": "2016-02-23", "note": "We are working on a fresh new home page with a one-click install button."}, {"status": "thinking about it", "author": "110757015", "created_at": "2015-11-19", "note": ""}], "comments": [{"author": "788070931", "created_at": "2018-05-17", "text": "This is a scandal, the damned skype installer is still surreptitiously trying to \"make bing your default search engine and MSN your home page\".This witnesses once more the diffused dishonesty of the Microsoft company, as its history boldly tells us all. Microsoft has been, is and will be the worst curse of software industry worldwide. Not even a cent of their revenue is earned without tricks, abuses and misleading acts.If a justice existed you would be relegated to the place you deserve: ignored vendors of buggy, bloated and useless software."}, {"author": "780741442", "created_at": "2018-04-25", "text": "2 years ago and nothing changed!!! Nobody wants Bing, if they did, they can Google it"}, {"author": "749667445", "created_at": "2018-02-01", "text": "This case is a window to the rotted inside of Microsoft."}, {"author": "424544641", "created_at": "2017-07-28", "text": "WANT NO BING AT ALL"}, {"author": "419497393", "created_at": "2017-07-20", "text": "Skype installer is STILL trying to do this..can't believe this is still the case in 2017."}, {"author": "170193426", "created_at": "2016-05-26", "text": "I completely agree with this.  It is mind blowing that Microsoft would make this the default option.  Junk apps try to trick you into installing a toolbar, Microsoft should not.  Considering this is an enterprise solution, I can't imagine any enterprise would want users installing more toolbars and resetting their search options.  Also the inability to customize what apps are installed from this page makes the whole thing pretty useless.  We do not use Skype or the SharePoint designer, and thus the only way to deploy is through a custom package.  It would be nice to be able to direct people to this portal, but without these options we can not."}, {"author": "147615690", "created_at": "2016-02-24", "text": "I really really want this gone. We are a very large enterprise organization. We will never use BING or BING search bar in our organization as toolbars and search engines are already standardized. I would also like you to remove the Install office part as well. But still leave the ability to do this in each users individual settings. The more customizable this page is the more people will use it!"}, {"author": "147393084", "created_at": "2016-02-23", "text": "I'm appalled that these settings are on the office install page. They are not related to the product (office suite) and alter settings in 3rd party programs. I consider that malicious software."}, {"author": "84487222", "created_at": "2016-02-15", "text": "I think it is totally inappropriate and highly unprofessional, annoying and pretty pathetic that Microsoft is trying force MSN homepage and Bing search engine on ENTERPRISE CUSTOMERS in this SNEAKY manner. Our laptops are configured with our own site, we do not want employees to accidentally change this to MSN. Also, most of our employees prefer Google for their search engine."}, {"author": "144258915", "created_at": "2016-02-09", "text": "Besides, MSN as a homepage is something no one ever wants... I really wonder how much that site makes them. Would there be any Microsoft employee that has that monster of a webpage as his homepage?"}, {"author": "138174828", "created_at": "2016-01-17", "text": "Browser tick boxes should not be on Office365. We will use the apps we want. Quit trying to force us to use things we don't like. We are not using, it but Microsoft is further alienating the IT professionals by \"PUSHING\" the garbage. By the time I download office I have already set up my browsers and if I miss the tick you have just cost me more time."}, {"author": "135950373", "created_at": "2016-01-08", "text": "Peter and Richard, both great ideas.Being able to customize the default portal is the best and fastest way to get Office 365 adoption. The page is currently way too busy.  Also most enterprise environments want to specify their own homepage like a federation server, intranet page or business home page, not a search engine."}, {"author": "135029472", "created_at": "2016-01-05", "text": "Hear hear! But not only that, also enable us to hide the whole \"Install Office\"-section on the start page, but still allowing installs via .For more details, see my comment on ."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/15107286-password-reset-custom-page", "header": "Password Reset Custom Page", "idea_text": "We have our Active Directory synced via DirSync to Office 365. The login page is customized via AzureAD settings.  It would great if there was a way to either remove the \"Can't Access Your Account\" link or have the ability to customize the text on the passwordreset.microsoftonline.com page.", "author": "187062993", "created_at": "2016-07-07", "votes": 21, "reaction": [], "comments": [{"author": "919651429", "created_at": "2019-09-13", "text": "Seria muy bueno que se habilitara la opcion de customizar el link de restablecimiento de contraseña, ya que si no se posee el ADFS esto es imposible para las empresas e instituciones educativas."}, {"author": "756358711", "created_at": "2018-11-30", "text": "For organizations that do not have Azure AD Premium and are federated with ADFS, why not have all password change requests be redirected back to the organizations ADFS server by default. There is already functionality built into there to handle the password changes with a known URL. Optionally provide the ability for the tenant admin to specify a location where a user should go to change their password to provide more flexibility for the tenant admins. Giving the user an error message to contact their administrator is frustrating for users and gives users the impression that something is broken because they couldn't change their password."}, {"author": "723156271", "created_at": "2017-12-27", "text": "I completely agree with Braden.  We have over 4000 users in our tenancy and the cost to purchase Azure AD Premium P1 is quite high, and certainly isn't warranted just to get rid of license error message it shows our users.  ADFS is not an option for us at this time, so a simple customization of this page/error would greatly reduce the number of questions/trouble tickets we receive on a regular basis.I am also requesting that MS allow us to customize the \"licensing error\" message that is shown when an on-prem user (with sync'ed passwords) tries to reset their password or use password recovery within the O365 portal. "}, {"author": "401793517", "created_at": "2017-07-27", "text": "Implement ADFS and you can have a custom login/reset screen."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11666427-the-space-bar-needs-to-make-a-blank-space-after-th", "header": "The space bar needs to make a blank space after the cursor. Why doesn't it?", "idea_text": "I don't like that the cursor doesn't show a blank space between itself and the last word when you press the space bar. You can't tell if you pressed the space bar or not. It's very confusing.", "author": "141874185", "created_at": "2016-01-31", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18664300-show-which-product-keys-have-been-used", "header": "Show which product keys have been used", "idea_text": "On the \"My Account\" page there are a list of products registered to the account, with \"Install\" links, but no way to know which ones have already been used. Would be great if there was a way to flag which products have been installed (and on which machines).Since the only way to change an Office product key is to uninstall/reinstall, I've just had to uninstall/reinstall Office on 3 machines because our work account has a number of products and the users just selected the first key in the list when prompted at their first run.", "author": "345704137", "created_at": "2017-03-19", "votes": 5, "reaction": [], "comments": [{"author": "912678406", "created_at": "2019-07-29", "text": "Product key for office 2013 home and student."}, {"author": "912678406", "created_at": "2019-07-29", "text": "How do I enter my product key for office 2013 which I have always used and is good enough for me."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13310328-why-does-my-word-online-document-have-a-gray-backg", "header": "Why does my word online document have a GRAY BACKGROUND, and how to make it a WHITE BACKGROUND?", "idea_text": "When I start a new document at Word Online, I see a document with a gray background. I want a document with a WHITE BACKGROUND! How do I make all my documents show up with a WHITE BACKGROUND!!!???", "author": "156694626", "created_at": "2016-04-04", "votes": 5, "reaction": [], "comments": [{"author": "887611408", "created_at": "2019-03-08", "text": "What a mess..."}, {"author": "874288228", "created_at": "2018-12-05", "text": "Same here, the background is \"bug gray\". What a **** of a product."}, {"author": "827596168", "created_at": "2018-07-26", "text": "same here"}, {"author": "780478678", "created_at": "2018-04-24", "text": "Any suggestions? I'm experiencing the same issue !Thanks"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35856466-service-request-option-to-add-attachments-and-cal", "header": "Service request, option to add attachments and call", "idea_text": "I would like to be able to add attachments, while the case is working to send the necessary information from where I generate the request for service. Not at the first moment when the service request is generated.\nIn the same way when requesting telephone assistance, the call button is not activated if the telephone number contains letters in the case of telephone extensions.", "author": "861734296", "created_at": "2018-10-29", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33147484-make-it-possible-easier-to-sign-in-with-multiple-a", "header": "Make it possible/easier to sign in with multiple accounts.", "idea_text": "Yes, this is technically possible. If I sign out of every single account I have. But it has taken me 30 minutes to not add a new account. ", "author": "748835677", "created_at": "2018-01-31", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34876783-administrative-tile-pinning", "header": "administrative tile pinning", "idea_text": "Allow administrators to pin tiles (custom tiles included) to app launcher for all users or users belonging to certain groups. ", "author": "825340321", "created_at": "2018-07-19", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36882382-uniformize-links-behaviour-across-office-365", "header": "Uniformize links behaviour across Office 365", "idea_text": "It's really difficult to predict what is going to happen when you click on an Office 365 link ! : Is it going to open a new tab/window or display in the same tab ?Just as an example: clicking on \"Outlook\" in the page opens a new tab, clicking on Outlook in the Office launcher menu displays Outlook in the same menu !!!This remark is valid across all Office 365 tool. Are you sure you don't use a random function ? ;-) This is what it looks like.Please uniformize and/or publish clear rule in order for us to be able to explain it to our users.\n ", "author": "791647429", "created_at": "2019-02-18", "votes": 5, "reaction": [], "comments": [{"author": "854667964", "created_at": "2019-02-27", "text": "Would add consistency with sharing links and opening in either client app or web app."}, {"author": "328755847", "created_at": "2019-02-18", "text": "We can extend the suggestion to the behavior of links to documents. It sure feels like flipping a coin everytime I click on a link. Will it open in the fat client or on the web..."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11461779-remove-the-oh-hey-message", "header": "Remove the \"Oh, hey\" message.", "idea_text": "It's overly familiar and should at least be customizable.", "author": "137730684", "created_at": "2016-01-15", "votes": 6, "reaction": [{"status": "in the plans", "author": "", "created_at": "2016-03-01", "note": ""}], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36584629-add-aggregated-news-view-on-office-com-much-like", "header": "Add aggregated news view on Office.com, much like the Sharepoint-root web page", "idea_text": "I love the top/root web page for sharepoint, where i get an aggregated view of all my news. Add a row on office.com to show the most recent sharepoint news. (perhaps with the possibility to individually filter out sharepoint sites)", "author": "880844977", "created_at": "2019-01-21", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36142555-change-the-office365-com-home-page-from-otthoni-v", "header": "Change the Office365.com home page from \"otthoni verzió\" to \"üzleti verzió\" for Hungerian Office 365 users", "idea_text": "When your O365 language settings are set to Hu-hu, the home page of Office365 shows \"otthoni verzió\" in the browser bar.  It translates to \"Home version\".  This is confusing for users that expect to be working on a business platform rather than on the consumer platform.\nIt should be changed to \"Microsoft Office kezdőlap\" or another meaningfull name.", "author": "873405844", "created_at": "2018-11-29", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11613057-connected-services", "header": "Connected Services", "idea_text": "End user have alot of Employee Office 365 users having SharePoint License and using Office Desktop Applications. Admin wants to hide the Connected Services from Office Application. Admin still wants to keep the Internet connection active. Please add this feature", "author": "140984766", "created_at": "2016-01-27", "votes": 6, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/17716525-tile-for-o365-groups-on-startscreen-and-app-launch", "header": "Tile for O365 groups on startscreen and app launcher", "idea_text": "We miss a tile for O365 groups on the home screen and app launcher. Users have no chance to go directly into a group, they must always first select an application and then go to the group view.", "author": "306535600", "created_at": "2017-01-13", "votes": 6, "reaction": [], "comments": [{"author": "728219092", "created_at": "2017-12-28", "text": "I recommend looking at Workspace 365. We created a workspace on top of Office 365 which gives you the flexibility to show/hide app (or app groups) based on their roles."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33994915-outlook-search-for-folders-not-just-messages", "header": "Outlook Search for Folders, not just messages.", "idea_text": "Search for FOLDERS not just messages, in Outlook 365/2016When I have items in a particular subject, I create a Folder and drag everything into it.   However, Finding the items again is a needle in a huge haystack !    Currently Outlook only searches for messages, in the; Current folder, Subfolder, Current Mailbox, All mailboxes, or All Outlook Items.   We need to be able to search for a FOLDER, and have the hierarchy-tree scroll up to that folder, without changing view (like as if you click on it).Then items in the view pane can be dragged to that folder, or, you can click on the folder to change the view-pane to those messages.\n", "author": "778481617", "created_at": "2018-04-18", "votes": 6, "reaction": [], "comments": [{"author": "656465269", "created_at": "2019-04-12", "text": "Outlook for Mac allows you to search for folders when moving items to it, but not Windows. I have to use the Mac version as I can't spend all day remembering where one of many folders is located!It would be awesome if you could search for a folder perhaps at the top of the sidebar maybe (a little search field)."}, {"author": "875064874", "created_at": "2018-12-11", "text": "I'd like to have an option to search for folders - and additionally the option to search for a target folder when moving mails to specific folders."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38336320-display-logo-images-for-azure-ad-non-gallery-appli", "header": "Display Logo Images for Azure AD Non-Gallery Applications", "idea_text": "Logo images for non-gallery applications are displayed correctly on the MyApps access panel (myapps.microsoft.com), but office.com just displays the default application logo for all non-gallery applications. Gallery applications display the correct logo on myapps.microsoft.com and office.com. Non-gallery applications should have the same functionality.", "author": "139119093", "created_at": "2019-08-08", "votes": 6, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/10838760-fix-the-go-back-to-your-last-spot-in-word-2016", "header": "Fix the \"Go back to your last spot\" in Word 2016.", "idea_text": "That awkward moment when Word 2013 is better able to find where you left off a One Drive document better than Word 2015.", "author": "124982541", "created_at": "2015-11-23", "votes": 3, "reaction": [], "comments": [{"author": "124982541", "created_at": "2015-11-23", "text": "I meant Word 2016."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/10864536-ability-to-remove-or-hide-your-recent-online-docu", "header": "Ability to remove or hide \"Your recent online documents\"", "idea_text": "The landing page automatically displays \"Your recent online documents\". There should be an option to hide these from being displayed permanently or temporarily. I don't want other people seeing my business when I start Office 365 :-)", "author": "125481225", "created_at": "2015-11-25", "votes": 135, "reaction": [{"status": "thinking about it", "author": "134847336", "created_at": "2016-01-26", "note": "Thanks for sharing your feedback about the recently used documents. We are working on making this feature better in our future releases."}], "comments": [{"author": "921252931", "created_at": "2019-09-23", "text": "Can Microsoft please provide an update on the progress of this item ? "}, {"author": "920409955", "created_at": "2019-09-17", "text": "Please disable this - it is very big and takes up a lot of space, especially when you open excel on a smaller monitor (I'm talking about the recommended files on the \"Home\" page.). Just provide us with an X to hide it. We already see the recent files, and pinned files and shared files. Recommended never shows me the files I need and doesn't help in any way other than pushing the important stuff (Recent / Pinned / etc) further down the page. You could also move Recommended into a tab (at the same level as Recent / Pinned / Shared). That would also be nice. "}, {"author": "912877786", "created_at": "2019-07-30", "text": "Hey, you CAN remove the documents you don't want anyone to see. Hover over the document's name or tile, click on the 3 dots (...) and select \"Remove from List\""}, {"author": "672801544", "created_at": "2019-07-30", "text": "It is a compliance issue for my organization. It would be very helpful if we could turn this off!"}, {"author": "897929275", "created_at": "2019-07-23", "text": "Gee, people have only been asking to disable \"recent files\" and \"recommended\" for years.Obviously MS doesn't care what people want; their feature developers are apparently just cubicle creatures that never worked in the real world.  Witness the \"focused inbox\" default view in Outlook online.  Yeah, they know which email I should look at.  Oh, while they're at it, they might consider not wasting so much space in their user interfaces.  Small, compact, fast, interfaces are what is needed in the business world."}, {"author": "911747764", "created_at": "2019-07-22", "text": "PLEASE let users turn on/off the recent and recommendation panes.\nBecause of GDPR and such this is a huge pain.Thanks!"}, {"author": "910282396", "created_at": "2019-07-09", "text": "this is nuts, my confidential docs are there on any team meeting when I go to Sharepoint?  ARRGGGHHH!"}, {"author": "908758057", "created_at": "2019-06-27", "text": "Hi, can we get an update on this. The option to remove recent documents and email attachments is a must have. Im pushing to use delve as our main employee directory but I cant due to management not wanting there recent documents and email attachments being displayed.Its been three years and no update, whats going on?"}, {"author": "903236242", "created_at": "2019-05-31", "text": "This is not just about recent documents.  Thre has been for the ast year a \"Recommended\" section right at the top.  Why is Microsoft recommending to me files to look at?  It is utterly inappropriate and presumptuous of MS that they should know what is a file that should be recommended for me to look at.Every section on that age must have an edit option and an ability to hide.  Continuing to ignore your customers in this way only shows contempt"}, {"author": "902057737", "created_at": "2019-05-24", "text": "WOW.. everyone can see my employee assessment graphics when I accidentally un-minimize my office apps screen when I'm hooked up to the meeting room's screen.  And they have known for 3 years.  Way to go Microsoft.As one famous person would say, SAD. "}, {"author": "711218863", "created_at": "2019-05-13", "text": "This is causing confidentially problems. FIX IT! "}, {"author": "898882147", "created_at": "2019-05-05", "text": "you guys have been thinking about this for 3 years. When is something going to be done about it ? "}, {"author": "898727788", "created_at": "2019-05-04", "text": "There might be a GDPR breach in the names of the files traveling from local machine's recent documents to Office 365 home page... how Microsoft doesn't see it as such? Are they waiting for an official complaint?"}, {"author": "898513918", "created_at": "2019-05-03", "text": "This new Home Page experience does not work for our company.We have a group of users, that should only have access to email, can now see documents created by administrative staff. We shouldn't have to change our current workflow to accommodate a change in functionality that we didn't request."}, {"author": "898507399", "created_at": "2019-05-03", "text": "This new Home Page experience does not work for our organization, especially given that our group of Kiosk users, that should only have access to email, can now see documents created by administrative staff.  We shouldn't have to change our current workflow to accomodate a change in functionality that we didn't request.  "}, {"author": "897929275", "created_at": "2019-04-30", "text": "Obviously, Microsoft isn't listening to any of this, or just doesn't care what their users want.  This is such an obvious \"feature\" needing an on/off toggle."}, {"author": "882462877", "created_at": "2019-02-01", "text": "You can improve by removing the Recommended Documents feature from showing up on Office 365's homepage. Even if I download my SharePoint documents (& not open them), it still shows up to me & others as opened by you, on this date; or edited by you, on this date... not a good feature Microsoft."}, {"author": "882288256", "created_at": "2019-01-31", "text": "The solution is that \"recommended\" documents only shows documents that you (and therefore your colleagues) have access to. Therefore your colleagues will only see \"your confidential document\" if they have permissions to do so. \nIf they shouldn't be able to see it then you are storing it/working on it in the wrong place.\nThe place that is secure to you is your \"OneDrive\". I recommend that people use their OneDrive and share only with the people that they need/want to see it."}, {"author": "882102460", "created_at": "2019-01-29", "text": "So what is the solution????remove or hide \"Your recent online documents\" "}, {"author": "880200955", "created_at": "2019-01-16", "text": "Being able to remove the \"Recommended\" list on the Documents page would be a very nice option to have."}, {"author": "877772206", "created_at": "2019-01-01", "text": "hieven though it can be removed, theres always \"Recommended Documents\" displayed. how to remove that as well??"}, {"author": "873170026", "created_at": "2018-11-28", "text": "Bad \"feature\" which allows others to see confidential documents. This should be an option we can disable."}, {"author": "829237996", "created_at": "2018-08-01", "text": "It would be extremely useful if there was the option to be able to selectively remove items from \"Recent\" in OneDrive.  Thanks."}, {"author": "790069195", "created_at": "2018-05-23", "text": "Has this been sorted yest - it causes so much confusion when using the app - I DONT want to see ANY recent documents.  Very flawed system. "}, {"author": "786152938", "created_at": "2018-05-11", "text": "Please remove my recent documents from others logged in users. I don't want my familty to know about recent documents im working on."}, {"author": "784578328", "created_at": "2018-05-06", "text": "I strongly agree!  I prefer documents should not be \"shared\" and viewed by the rest of the users.  You should have the ability to enable/disable \"Recent Documents\" feature to personalize my own setting."}, {"author": "769807792", "created_at": "2018-03-23", "text": "I agree something has to be done for this. It is easy, at least should allow manually the user to delete history."}, {"author": "769155091", "created_at": "2018-03-21", "text": "MSFT has been \"thinking\" about this for two years now. This HUGE banner section is virtually useless and takes up valuable real estate on the screen. It sure would be nice, as a user, to be able to opt out of this section. Optionally, make the icons tiny thumbnails and stick them down the bottom of the page where they would no longer be a nuisance."}, {"author": "761768701", "created_at": "2018-03-01", "text": "Hello Microsoft. Any updates on this? This is a very bad \"feature\" for us and a nogo for out poc. This is the only showstopper. We dont want, that the metadata of our Sharepoint on Premise Documents are automatically uploaded to Office 365. are you serious about this....?"}, {"author": "751530883", "created_at": "2018-02-05", "text": "Wow now everyone can see my confidential timesheet I sent to my boss! great!"}, {"author": "721988422", "created_at": "2018-01-26", "text": "I agree there should be setting for this available on the Office 365 Portal Page setting."}, {"author": "745532260", "created_at": "2018-01-25", "text": "I have now uninstalled Office 365 and I still have a list of recent documents in \"My online office\". I am a home user and do not need the cloud. I have an external hard drive to backup any sensitive files. It is appalling that I can not delete my personal information from this same list. My husbands will is listed there, the last place id put any personal files is up in the cloud. It's frustrating that I can not delete this recent file list. I now use Google docs it all free and I can download and save files when im done. I also now have chrome and my next computer is going to be a chrome book. Microsoft sucks. \n "}, {"author": "740838994", "created_at": "2018-01-14", "text": "user viewing the office files saved in sharepoint onprem on landing page . Also onedirve personal files . which is not related to office 365 . they get confused and assume it security issue.asking why sharepoint on premise files reflecting in o365 "}, {"author": "728219092", "created_at": "2017-12-28", "text": "You can do this using Workspace 365. In our digital workspace which is built on top of Office 365 we allow people to show/hide app groups. This way you can hide your sensitive data like recent documents, power bi tiles and much more. Have a look to see how we strengthen Office 365: "}, {"author": "710661109", "created_at": "2017-11-15", "text": "Related the ability to ensure this doesn't show in the App launcher is also something organizations should be able to do. It leads to considerable scrolling when a user has more than the default number of apps in the Office 365 app launcher and for some organizations may not add value. Not to mention that even more than here - if a user goes to NAVIGATE to a different app it now can break privacy because it shows the names of recent docs they worked on. I think you need to accelerate the resolution here. @Angapparaj.Kalimuthu "}, {"author": "701291890", "created_at": "2017-10-28", "text": "I'm not sure how many ways this issue manifests itself, but it seems to be akin to the issue I had, regarding the \"Get Office\" (365) app indefinitely retaining a list of \"Recent Documents\" (even after they are no longer 'recent'). This list is due to the \"permanent\" storage of 4 registry entries per each item on the list, with no way to delete them w/o editing the registry (which is the absurd way Microsoft left us with to deal with this issue). At your own risk, here's what worked for me:\n> Install the free version of Revo Uninstaller\n> Select \"Tools\"\n> Select \"Microsoft Office Cleaner\"\n> Check all the boxes\n> Click \"Clear\". \nThe list should be cleaned the next time you run \"Get Office\" (365)"}, {"author": "138587805", "created_at": "2017-05-03", "text": "Just check the girl in the right of the photo....i think she's laughing at us all."}, {"author": "363719815", "created_at": "2017-04-26", "text": "i love you nick nixon you my babe"}, {"author": "363719815", "created_at": "2017-04-26", "text": "you rock"}, {"author": "338191705", "created_at": "2017-03-09", "text": "It would be cool if Delve was more consistent, and this type of feature lived there, rather than cluttering the home page."}, {"author": "309787879", "created_at": "2017-01-20", "text": "About \"Your recent online documents\"\nOffice365 on the web (In this instance I've Microsoft Office365  installed on my home laptop and linked to my work account for Ofifice365) shows a list of documents that have been deleted or moved so their links won't/don't work.\nThere has to be some way to remove this list of bad links.\nDid you guys just pull Office365 out of your a**es solely to inflict it on the rest of the world?\nSeriously asking.  What did we ever do to Microsoft to deserve this?\nI'm about 2 more p***es off from removing Office365 from everything and just going back to Libre Office; which works just fine by the way."}, {"author": "303374095", "created_at": "2017-01-04", "text": "I never use online word. I am an admin and when I go to the landing page of O365 it shows documents in the \"your recent online documents\". This seriously needs to go away!!!! "}, {"author": "303346852", "created_at": "2017-01-04", "text": "Absurd that these listings cannot be deleted."}, {"author": "300916693", "created_at": "2016-12-27", "text": "Just landed here after being annoyed for the very same thing.This is privacy 101, so I find hard to understand why this has been in \"Thinking about it\" status for more than one year.I used to defend Microsoft as the only choice in the enterprise world, until recently with all this invasion of private, personal life."}, {"author": "300751237", "created_at": "2016-12-26", "text": "The idea of having your most recent documents listed on the landing page is ridiculous added to the fact of having no way to remove them is even more absurd. This one lone issue makes the use of the program worthless. Stop the data mining and get down to the technical issue. "}, {"author": "299266672", "created_at": "2016-12-21", "text": "We recently considered moving our organisation over to Office365 and Skype for Business.  The inability to remove documents from this list meant we couldn't so went elsewhere.\n"}, {"author": "230480445", "created_at": "2016-09-23", "text": "Additionally, the Recents list continues to hold document titles that have been deleted, changed, or moved off of OneDrive for business, so being able to clear the Recent List actually makes it more accurate and usable."}, {"author": "205748268", "created_at": "2016-07-31", "text": "I have to agree, It is annoying to have all documents displayed on your Landing Page.  The ability to delete the unwanted items is essential.  Microsoft 365 auto saves your document as document or some such title.  So when you change the name of the document you get a display with both the original name and the name you really want.  Please advise on how to delete the unwanted item.  Right clicking it only gives you basic information and no way to delete or remove from the list."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11666634-how-can-i-have-the-status-bar-show-the-word-count", "header": "How can I have the status bar show the word count of where the cursor is, like Word used to be able to do?", "idea_text": "", "author": "141874185", "created_at": "2016-01-31", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18653356-note-field-for-each-individual-software-license", "header": "Note field for each individual software license", "idea_text": "Can't you supply a note field for each copy of office in MyAccount so that it can be tied to an asset number?", "author": "345190591", "created_at": "2017-03-18", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18902635-a-notification-of-spec-change-should-be-made", "header": "A notification of spec change should be made", "idea_text": "Before the file with over 14 full-width characters downloaded from SharePoint would miss parts of the name from the 14th character\nBut the issue seems resolved now, cause the full name can be displayed even the file’s name is over 14 characters\nIf the spec really change, please give a notification to the users.", "author": "354738535", "created_at": "2017-04-11", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18490060-skype-web-client-on-all-office-365-pages", "header": "Skype Web Client on all Office 365 pages.", "idea_text": "Currently if you are in the Outlook.com (Mail, people or Calendar) section of Office 365 you get a Skype Client option on the top navigation bar next to alerts.This would be tremendously useful if it was an option no matter where you were navigating within Office 365 and especially in SharePoint.", "author": "334067593", "created_at": "2017-03-01", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11003874-very-hard-to-find-how-to-enter-office-home-subscri", "header": "Very hard to find how to enter office home subscription key", "idea_text": "\"Account settings\" in outlook takes to microsoft account which doesn't have an entry for office subscription\"View account in OneDrive takes to microsoft account which doesn't have an entry for office subscriptionHaving a link to microsoft account in Office is good, however having link to office account would be more helpful. I find it very hard to find an easy way to enter subscription key for office 365 home subscription. Users have to go through these steps to find a place where to enter activation code for office 365 subscription: \n1) Click on office tile or type office.com in the browser \n2) Click sign in and the page will refresh with your name. Why not show up right away with name? \n3) Click \"My account\" and the rest is simpler.", "author": "128586294", "created_at": "2015-12-08", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37852648-ms-outlook-calendar-function-has-unwanted-autoproc", "header": "MS Outlook Calendar function has unwanted autoprocessing that prevents user from being notified of minor meeting changes.", "idea_text": "I have worked with multiple Microsoff Premium Specialist only to find out that the Outlook Calendar has an unintended feature that prevents user from seeing minor update from meeting updates.   If you have accepted a series of meeting and the originator makes a minor update (adds text or a file) but does not change the date, time or locatin, Outlook will send this is a NO RESPONSE required and automatically put this update in the DELETED items.  It will update the calendar but will not timestamp when the update arrived.   Without the update going to the inbox, you are not notified of information the organizer is sending out and if you do happen to notice the change to the calendar entry you have no time stamp to advise when the meeting text/file was changed.    Need to have a programming change that prevents NO response update from going automatically to deleted items.  It is causing more problems than whatever efficiency it is suppose to provide.", "author": "904619749", "created_at": "2019-06-07", "votes": 3, "reaction": [], "comments": [{"author": "909173146", "created_at": "2019-07-01", "text": "Agreed.  I'm totally missing out on meeting updates, only to find them as unread email messages in my DELETED ITEMS folder!  This is completely unwanted behavior and is not increasing productivity or efficiency whatsoever!  Please leave these items in my INBOX and let me deal with them as they come in."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36855133-add-site-setting-back-to-the-gear-icon-in-modern-p", "header": "Add Site Setting back to the gear icon in Modern Pages", "idea_text": "Site Settings\" link was recently removed from gear drop-down and placed w/in a new gear drop-down \"Site Information\". Given how frequently site admins need to access Site Settings during their daily work, we are extremely disappointed at this development!We would LOVE to see set setting back on the gear icon.  ", "author": "884338798", "created_at": "2019-02-14", "votes": 3, "reaction": [], "comments": [{"author": "884339815", "created_at": "2019-02-14", "text": "I second this."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38609950-allow-admins-to-change-which-fields-are-being-disp", "header": "Allow admins to change which fields are being displayed under the My account menu", "idea_text": "Currently, under the My account menu under the outlook.office.com portal homepage, the users first name, last name, and account are displayed; please make these fields editable by a global admin so that either alternative names can be displayed and also so that a users alias can be displayed.", "author": "920205697", "created_at": "2019-09-16", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33146929-ability-to-remove-or-hide-discover", "header": "Ability to remove or hide \"Discover\"", "idea_text": "The landing page automatically displays \"Discover\". There should be an option to hide these from being displayed permanently or temporarily.", "author": "721988422", "created_at": "2018-01-30", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11091549-office-keeps-losing-file-associations-with-it-s-ow", "header": "Office keeps losing file associations with it's own file types and the only way to fix it that works is to reinstall it.  Fix this problem!", "idea_text": "Make it so office doesn't arbitrarily lose file association.  Trying to ressociate them doesn't work and you have to reinstall the entire office suite.  This should not happen.  Please fix this issue.", "author": "130225437", "created_at": "2015-12-14", "votes": 4, "reaction": [], "comments": [{"author": "887588014", "created_at": "2019-03-08", "text": "Happens on latest monthly o365 as well, not on every machine, just totally random!"}, {"author": "816579289", "created_at": "2018-06-20", "text": "yeah, how do you mess up file associations?  My god.  Stop installing candy crush on all my computers and get this right.  "}, {"author": "224851549", "created_at": "2016-08-21", "text": "It's hard to believe after 26 years we are still dealing with these bugs. It's very clear Microsoft has stopped serving customers and has become completely self-serving. Windows 8 and 10 are examples of a company that has completely lost it's focus. This is what happens when there's no competition. "}, {"author": "141059931", "created_at": "2016-01-28", "text": "I have the same problem. Very annoying!"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33400066-improve-student-signup-for-free-software", "header": "Improve student signup for free software", "idea_text": "I went through the process of signing up my son Adrian for free Microsoft Office 365 on one of these sites:\n\nor\n\n(sorry, don't remember which one)I entered his birthday: June 17th, 2003. He is over 14 years old.I received the code from his school\nFinally, a message showed up that he does not have the legally required age to sign up for an online service. That is age 13 in Germany.Why did this happen?", "author": "758629651", "created_at": "2018-02-21", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33147769-custom-tiles-displays-in-app-launcher-working-with", "header": "Custom tiles displays in app launcher working within Office Online", "idea_text": "Custom tiles displays in app launcher working within Office Online- Add custom tiles working with Excel, Word, OneNote, Powerpoint Online.", "author": "748843204", "created_at": "2018-01-31", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32489581-correct-apa-style-formatting", "header": "Correct APA Style formatting", "idea_text": "Please enter the correct APA Style formatting tool in Word.  My students use it, but I have to take points off their research papers because the citations and references are not formatted in APA. ", "author": "720128173", "created_at": "2017-12-03", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33468037-give-up", "header": "Give up.", "idea_text": "You clearly don't know how to build websites so can you just give up and hire somebody that does to do it for you?Your office 365 admin portal is the worst thing anybody has ever made, it's just shockingly bad. What on earth is the new \"Sign in experience\" about? It's ruined everything. I need to log out and log in as numerous different administrator accounts, because the admin partner portal is beyond a joke, but to change the sign in name takes about 5,000,000 clicks. The odl sign in experience was abd - this is terrible.. It's not even fixed the problem. If I click \"sign out\" I expect it to actually sign me out of the tenant? I guess there's a reason why it currently doesn't work?How can one of the largest tech organisations in the world provide such terrible services to its customers. It's just shocking. Absolutely shocking.", "author": "760977529", "created_at": "2018-02-27", "votes": 2, "reaction": [], "comments": [{"author": "904103965", "created_at": "2019-06-03", "text": "Agreed, I can never get signed out properly. I have multiple Tenants and multiple logins. I go to office.com. It takes me in with one login. I click sign out, I see the stupid \"You signed out of your account. Its a good idea to close all browser windows\" message. I close and reopen chrome, go back to office.com and its still signed in with the same account! Why is it that every other site I go to I click sign out and I get prompted to sign in again but with M$ I get this idiotic dialog box which means nothing, forcing me to do something asinine for me to log back in. How about copy google again and make a drop down for all accounts allowing you to switch seamlessly between them all? Please fix it. Thanks  "}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/10560684-customization-of-office-365-home-page", "header": "Customization of Office 365 Home page", "idea_text": "Have customization possibilities for customization of the Home page (portal.office.com/home);\n - Possibility to add mandatory tiles\n - Possibility to remove tiles for users\n - Add custom tiles (with a link)Like the App Launcher customization possibilities.", "author": "118841781", "created_at": "2015-11-05", "votes": 313, "reaction": [{"status": "thinking about it", "author": "110757015", "created_at": "2015-11-19", "note": "Thanks for sharing this with us. The team is looking at how to improve the O365 homepage. These are helpful details. Others should please comment with specifics as well if they have ideas on customization improvements. – Jay Waltmunson (O365 Program Manager)"}], "comments": [{"author": "920353252", "created_at": "2019-09-17", "text": "I recently requested to have a custom theme created for the Office.com 365 portal for my organization's tenant and was informed by Premier support that the \"Developer Team may not look into this kind of ask\".  I'm hoping this simple ability to adjust theme for corporate communications branding will be available in some future releases.  "}, {"author": "917148562", "created_at": "2019-09-04", "text": "Can I set tiles linking to Quarantine and Exchange on the home page - its links like this that would help get to where admins need to be !"}, {"author": "910834663", "created_at": "2019-07-15", "text": "We would like to make the Flow app available from the 365 launcher, but without showing the Dynamics 365 app. Adding my vote to make the Dynamics 365 app icon optional on behalf of 100+ people in the email domain"}, {"author": "906917188", "created_at": "2019-06-12", "text": "Like the App Launcher customization possibilities."}, {"author": "904048828", "created_at": "2019-06-03", "text": "It would be good to be able to add custom tiles to the home page as this makes it more immediately obvious how to get to additional sites. Not sure why this hasn't been done already but if nothing has been done yet and the post was originally created in 2015, then I doubt it ever will."}, {"author": "897551548", "created_at": "2019-04-29", "text": "Currently we have TWO portal pages. Our primary with all our internal services, including a link to our secondary - all our )365 services.Confusing for users and it would be so nice to only have ONE.\n"}, {"author": "822799333", "created_at": "2019-04-10", "text": "Allowing the user the ability to create their own individual page similar to the Modern Home page in Office 365 Groups would be great. In this way the user can customize by adding from a list of Web Parts (or for the developers creating their own) to create a page containing everything they need for their own individual daily work. It would surely help trying to sell the concepts of O365 Groups to the user too when they can play around creating their own individual work area with a variety of Web Parts."}, {"author": "892615663", "created_at": "2019-04-05", "text": "I'd like to be able to hide/remove the recommended documents as it presents a GDPR / Compliance related issue.EG All members of a team have access to HR Policies and it exposes the fact that someone in that team has been accessing HR documents to everyone else in their team.  This potentially exposes a confidential issue that someone is having to all the members of their team."}, {"author": "848795650", "created_at": "2019-03-12", "text": "Make the links in the search result clickable! As it is now, even if the organization's Customized tiles shows up in the result, nothing happens when clicking on the link."}, {"author": "885308311", "created_at": "2019-03-04", "text": "It would be great to have the option to add shortcuts to other SaaS applications directly to the home page, in much the same way you can with custom tiles and the launcher. With the appropriate security wrap around this could quickly become a replacement for traditional VDI."}, {"author": "877433833", "created_at": "2018-12-29", "text": "I’m a Microsoft partner and i can till you that I’m getting the same question from customers for every project,,  we need to have more ability of customization. "}, {"author": "774061225", "created_at": "2018-09-19", "text": "I'd rather the Dynamics button not show, as we don't have a single license for those products. We happen to have a few users using Flow, but even for them, the Dynamics button is unnecessary and confusing. Thanks."}, {"author": "825090850", "created_at": "2018-09-12", "text": "Why don't we have the ability to remove certain icons / links from the Office 365 Home Page as a Global Administrator.  I don't want Bookings to show up for any of my users and there's no way to do this.  I've removed all user licenses for bookings, turned the bookings feature totally off in the admin panel under Settings > Services & Add-ons and it still shows up for everyone.  Even when I setup a brand new user account and only assign an Exchange license, nothing else, bookings is still on the Home Page.  I know they can't user the bookings feature, but why can't we have control over removing the icon?  The same is true for the Business Center icon on the home page, which I don't want there and none of my users will access.  Again, all licenses turned off for Business Center, and all apps that are part of it, but Business Center icon still shows on the Office 365 Home Page, confusing users after they click on it to see what it is and the notice says to ask their administrator..  We need more control!!"}, {"author": "823342225", "created_at": "2018-07-12", "text": "Yet another homepage with very limited customization. It would be fantastic to have the O365 apps with corporate links, web and legacy apps all in the one place ! One feature in the right direction."}, {"author": "817835953", "created_at": "2018-06-25", "text": "Agree, must have! any progress on this issue? "}, {"author": "816829141", "created_at": "2018-06-21", "text": "Absolutely agree. Customizations for enterprise are key to ensure proper deployment.\nThis is a must-have."}, {"author": "363718930", "created_at": "2018-05-18", "text": "We are implementing Office 365 at our school so we would like to customize the O365 based on the group (i.e. student vs. teachers).  We would also like an easier way to brand the pages."}, {"author": "788239459", "created_at": "2018-05-18", "text": "I agree, I have our route SharePoint site set up so all the subsites are accessible through navigation menu and sidebar...staff that click the Sharepoint icon on their 365 Home Page are expecting to see this custom homepage but are instead getting the frequent and suggested page site which is confusing them."}, {"author": "742103485", "created_at": "2018-05-10", "text": "I would agree with this, but it seems  that the App Launcher customization has been removed. A step backwards."}, {"author": "764985811", "created_at": "2018-03-09", "text": "Would love to see this as well. We have different users at different levels of sophistication and I would like much more admin control over what a user sees on their homepage (e.g. being able to remove apps, remove the option to install local office software etc.)"}, {"author": "761339878", "created_at": "2018-02-28", "text": "Yes!  Agree with this request.  I want to remove apps from my user's home page that they don't need.  I want to add/remove apps from my homepage.  Oh and I like the boxes better."}, {"author": "350688823", "created_at": "2018-02-15", "text": "I was trying to find a way of dropping a link onto the home page to direct users to our own help Sharepoint, so I was disappointed to find the functionality is so limited. I don't want to have to ask users to go and find things - I want to present what they need right in front of them when they login. "}, {"author": "261912886", "created_at": "2018-02-05", "text": "Now with the launch of the new app launch bar I had hoped to have this custom behavior and admin settings to manage the launcher & start page."}, {"author": "750109078", "created_at": "2018-02-02", "text": "Agree with other commenters. Why is the App Launcher customizable but not the homepage? Is 365 is meant to be a single point of login for businesses we need more options to customize the landing page. This is a particular problem now that the app launcher is no longer available from mobile devices. Custom links are inaccessible unless accessing from a laptop or desktop computer."}, {"author": "749991256", "created_at": "2018-02-02", "text": "I see there is much discussion here and you have responded to everything that involves tweaking MS product placement.  However, the major blocker to take up for my clients is where they want to use Office 365 as an intranet.  They primarily want to deliver a corporate navigation and news to users at point of logon.  Suddenly entering a complete MS world, is a step too far for them.\nAn intranet home page can be built in SharePoint Online for sure, however, you cannot make SharePoint Online the default landing page, nor can you deliver it as a Content Tile on the O365 homepage. It would really help with uptake if some part of  the Home Page was customisable by admins, to tailor it so that users their own employers information and not Microsofts when they first land in the Office 365 world."}, {"author": "736938508", "created_at": "2018-01-12", "text": "I agree with others regarding the tiles.  I would also like to see the ability to customize content on the page, such as the ability for the Admin to add alerts/notices to the page."}, {"author": "728219092", "created_at": "2017-12-28", "text": "We do this using Workspace 365. You can easily set up a home page with (live) tiles and all your applications. To do this, we integrated Office 365 and Azure. Have a look at Workspace 365, I'm sure this will help you reach your goal while using Office 365:  "}, {"author": "721379158", "created_at": "2017-12-04", "text": "We have added custom tiles to the App Launcher. Is it possible to add custom tiles to the O365 Home Page (landing page) in addition to the App Launcher?"}, {"author": "721187848", "created_at": "2017-12-04", "text": "Our Vision is to move everything to the cloud and use single sign on through AD to really enhance the user experience. Sending our people to the office portal with tiles for all their apps would greatly enhance this experience.  I am 100% behind the above and believe it is a bit hooky that I can add custom tiles to the \"Waffle\" but they don't show up on the home page..."}, {"author": "185322015", "created_at": "2017-11-16", "text": "Create an Office 365 Training Center tile and either put it on the home screen for end users OR allow us to add it on the home screen. Another option would be to add it to the help screen, but I think front and center works best usually. What better way to increase the adoption of your programs? I saw that you added this in the admin area, but not where end users will see it."}, {"author": "706809631", "created_at": "2017-11-07", "text": "Allow users to rearrange tiles. Really miss having all tiles display and now have to click link to Explore all apps. Ability to make tiles mandatory or to delete tiles would also be very helpful."}, {"author": "699435436", "created_at": "2017-10-24", "text": "It's a little odd anyhow that you can rearrange the tiles in the dropdown but not the homepage."}, {"author": "297678406", "created_at": "2017-10-19", "text": "Is there an update on the Customization of the Office 365 Home page please?"}, {"author": "683362933", "created_at": "2017-10-12", "text": "So it's been two years, any new updates on this?"}, {"author": "672701791", "created_at": "2017-09-21", "text": "I like the customisable tiles and ability to pin them to the App Launcher, however it would be \"Much Better\" to either allow customisation of the Apps on the Home page or reflect the changes which have been made on the App Launcher on the homepage"}, {"author": "655842637", "created_at": "2017-08-29", "text": "NEED to be able to add mandatory tiles, as well as add them to the start page.. the start page needs a lot more customizability!"}, {"author": "283542007", "created_at": "2017-08-28", "text": "Agree with many others that Admin should be able to hide and expose tiles on the default Portal for an organization, and that users should be able to arrange the order of the tiles on their Portal as they can in the Launcher."}, {"author": "656289466", "created_at": "2017-08-23", "text": "Our users doesn't understand why they can't add their own (custom) tiles to the home page.\nThey love the customisation of the app launcher but keep requesting to add it to the home page."}, {"author": "80029215", "created_at": "2017-07-24", "text": "Would love the ability to present announcements via a banner or even a dedicated spot on the home page to put an announcement."}, {"author": "414996415", "created_at": "2017-07-14", "text": "Add new option \"My Apps\" as Start Page in my personal settings"}, {"author": "160392768", "created_at": "2017-06-23", "text": "I also agree with the request to remove the \"Install...\" link. We're a managed service provider. Our clients' users shouldn't be able to install stuff, nor even be presented with the option of doing so."}, {"author": "160392768", "created_at": "2017-06-23", "text": "The worst offender is the SharePoint landing page. We need to be able to customize it so it goes to the intranet home page for our clients. The universal feedback we're getting (and we agree) is that the SharePoint landing page linked to from the SharePoint tile and the app launcher is gruesome, incomprehensible, and useless for users and provides no business value."}, {"author": "84526372", "created_at": "2017-05-08", "text": "I'd like customization on this page.  Allow me to modify this page and add my company news feed from Sharepoint, an announcement section, launch tiles for each of my departments, and a link to my helpdesk.  If we can't do this, then give me an option to change the Office365 Start page to a page of my choosing on my Sharepoint Online site."}, {"author": "360835159", "created_at": "2017-04-19", "text": "I agree with Rikard regarding the Add custom tiles with a link to the O365 Home Page not only on the App Launcher. I can create a work around for my users, but I shouldn't have to do that if that feature was available."}, {"author": "360582469", "created_at": "2017-04-19", "text": "My team is looking to make the portal.office.com the primary homepage for our company. We would like to remove the unused tiles and add tiles for other web applications in addition to adding web parts from our current SharePoint homepage. This way the users have 1 place for easy access to all the web-based applications. "}, {"author": "358150948", "created_at": "2017-04-13", "text": "Really frustrating how something so simple can't be managed for the business."}, {"author": "283110043", "created_at": "2017-03-28", "text": "Simply let us choose what apps to present to the end user on the portal page. Our choice not Microsoft.\nYou've been thinking about this for a long time, please provide an update."}, {"author": "733671154", "created_at": "2017-03-28", "text": "When are we going to be able to remove apps from users start page globally from the Admin portal? Way too many apps that my users will never use and we don't want them experimenting with them on their own. Some of these are not usable in our line of work and we would like to remove them from everyone's start page."}, {"author": "349014769", "created_at": "2017-03-28", "text": "Please do add customization to move/add tiles on the Office 365 homepage !\nThere are a bunch of Apps which will never be used by most of our users...\nThanks."}, {"author": "348668758", "created_at": "2017-03-27", "text": "Add customization to move/add tiles again, I used to be there, now it's gone. Please bring it back."}, {"author": "153136797", "created_at": "2017-03-23", "text": "In our organisation we too would like the ability to add custom links in the startpage of any (or preferably the members of a security group) users.\nIt's pretty unbelievable that this is not possible.\nAren't there any powershellscripts for this?"}, {"author": "344062084", "created_at": "2017-03-15", "text": "We really need the ability to customize the Home screen allowing us to add our own tiles.  Thanks "}, {"author": "343169926", "created_at": "2017-03-13", "text": "This really needs to be addressed. Lots of our customers want to move to O365 but asking how and why such simple things like customizing the homepage isn't possible."}, {"author": "338191705", "created_at": "2017-03-01", "text": "The customized tiles are great. The promotion of \"most used\" (AKA newest) apps is not helpful, especially for less power users in our organization."}, {"author": "297139894", "created_at": "2016-12-15", "text": "the Huge BLOB \"Welcome to\" is far to big, takes half the screen, how do you turn this junk message off. Would mean that ypu don't have to scroll to see the options available? "}, {"author": "283110043", "created_at": "2016-11-22", "text": "We need to ability to turn off these new apps, like bookings, dyamics365, flow,  power apps until we are ready to use them if ever. Having these default to on for all users is causing a lot of problems for IT. Microsoft can't dictate what apps our  users can see and\\or use. \nPlease fix this ASAP"}, {"author": "285525473", "created_at": "2016-11-20", "text": "Install link makes the page unusable in an corporate environment. Needs to be configurable to still allow for unmanaged machines."}, {"author": "253542304", "created_at": "2016-10-24", "text": "We would like the ability to add custom tiles to the home page, e.g. with a link to our intranet"}, {"author": "239548228", "created_at": "2016-09-12", "text": "It would be good to have the option to customize how your unread emails are displayed. "}, {"author": "186410604", "created_at": "2016-07-05", "text": "Yes - I am surprised to see that the admin can't change the home page for the Users"}, {"author": "135029472", "created_at": "2016-05-23", "text": "Good point re migration. I've also discovered that Office 365 home page doesn't consider if the user has mailbox migrated to Exchange Online. If the Exchange Online license is activated for the user, the icons are shown. And when user selects the icons they get error message b/c the mailbox isn't migrated yet.We're currently in Exchange Hybrid mode and it would make things easier to simply switch on the full E3-license for all users and not having to manage the Exchange sub-license separately. So please, only show Outlook-icons if user a) has required license and b) has mailbox in Exchange Online."}, {"author": "169257213", "created_at": "2016-05-23", "text": "It would be great to be able to only give the users specific tiles at the point of migration.  This would cut down on confusion and make initial end user training/adoption of service easier"}, {"author": "138946278", "created_at": "2016-04-18", "text": "Add Possibility to create tiles for a whole tenant (or by security groups) (ex. : links to a special \nLMS for a school, or links to school others webservices)Possibilty to show a specific text for a group of user when they connect.\n \nAdd a way to be able to add a video embed or iframe on the homepage (for a tutorial or other useful information specific for an entreprise)"}, {"author": "156592203", "created_at": "2016-04-04", "text": "Totally agree - If we can’t get customization possibilities and choose who should se what on the landing page (including the install option) then we at least want to be able to hide (not disable!) the install option all together and then point the user to  from elsewhere.I don't want my enterprise users installing from the portal, but my home users need to be able to do this - I don't want this as the first thing everybody sees on the portal page!"}, {"author": "151828326", "created_at": "2016-03-15", "text": "As the company Network Administrator and software deployment go to person, I'd like to have the ability to remove the \"lnstall Office\" and the \"Get Setup Fast\" sections. We will not be allowing our users to install on their own and many of them are confused when they see it and they are clicking and installing unauthorized software. I agree too that we should be able to customize which apps our users see under Collaborate with Office Online. "}, {"author": "147615690", "created_at": "2016-02-24", "text": "I agree with Richard Nilsson! That has to be removed. Especially as we run an enterprise E3 organization. We deploy Office via image. This page would be amazing if you could remove that while maintaining the ability for users to install via their own personal settings page. Also being able to centrally manage the tiles and maybe the welcome message would be amazing. We have culture programs in place and the welcome message would be a great daily tip or weekly."}, {"author": "71462152", "created_at": "2016-02-17", "text": "Our Kiosk K1 user get lost when they navigate from our intranet to the Office 365 Homepage. It would be nice if you can change the tile 'Team Site' with the big white ball (K1 Licence) to another tile name and logo.\nThanks,\nPeter"}, {"author": "135029472", "created_at": "2016-01-05", "text": "This feedback has been out there ever since 2011:\nI agree with general customization possibilities to make the landing page a better UX with more relevant information for the user. However, the priority for us is to be able hide the \"Install Office 2013 on your PC\" section, especially since you decided to put it above the \"Collaborate with Office Online\" section (same feedback as SB below).I have a customer with 25 000 managed PCs and this is not how we will install Office ProPlus on these devices. We will do that using SCCM. We still want to allow Office ProPlus click-to-run installs initiated by the user on BYODs though, so we can't disable the download option. This \"all or nothing\"-scenario is a problem for us.So currently we've blocked CTR-installs on managed PCs using AppLocker. But it's not a pretty solution because users on managed PCs still get the install option in-the-face, they click it, and get the AppLocker restriction message. Nor is it pretty on BYODs because the install-option in-the-face does not go away even after the installation is performed on the device.If we can’t get customization possibilities and choose who should se what on the landing page (including the install option) then we at least want to be able to hide (not disable!) the install option all together and then point the user to  from elsewhere.Thanks,\nRichard\n"}, {"author": "127500459", "created_at": "2015-12-15", "text": "Recently the layout of the page was recently changed to put the \"Install Officer 2013 on your PC\" section above the \"Collaborate with Office Online\" section.I don't need to access the links to software installation everyday, but I do use the tiles everyday.Can someone change the layout back to the way it was?"}, {"author": "129202959", "created_at": "2015-12-10", "text": "Please make Home (portal.office.com/home) and MyApps (portal.office.com/myapps) pages responsive to mobile devices.   The tiles scroll off the right side of the page.   Would be great to be able to scroll through the apps vertically and launch with my thumb. I would hope that that the custom tiles that we add would also appear on these pages if the user has access/is licensed.  Now if the user and/or administrators could customize the order or grouping of the apps...I love that the Home page has links to download the available apps for the device.  This would be another opportunity to allow us (as administrators) to add our own app(s). "}, {"author": "118841781", "created_at": "2015-11-19", "text": "Some other cool possiblities would include:\n * Fetch Yammer feed (or at least top 3 new entries from Yammer)\n * Live tile with information from a web service (for example newest information from helpdesk system or news feed - or similar)"}, {"author": "122253207", "created_at": "2015-11-14", "text": "HP Pavilion Entertainment nick name is (4 Sale)"}, {"author": "115557675", "created_at": "2015-11-06", "text": "Thanks for the feedback! We will add this to our list of items to consider in an upcoming release."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33125743-outlook-tasks-is-weak-and-i-need-it", "header": "Outlook Tasks Is Weak!!!!!   And I need it!!!!!", "idea_text": "Outlook needs “projects” with below tasks, sub tasks, and subtasks.     It should be a good project management tool.   There are many plugins out there but none are good.  Call me and I’ll help!!! ", "author": "747486292", "created_at": "2018-01-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33546781-tell-customers-to-go-to-office-com-setup-when-they", "header": "Tell customers to go to office.com\\setup when they buy a new product.", "idea_text": "Office Home & Student Instructions on the card purchased at a retail store says to go to office.com/myaccount. Nowhere does it explain how to change the past version of Office Home & Student displayed. There was no why I could load the new office 2016 version just purchased. It only listed Office Home & Student 2013, my previous purchased software.Also, I did not want Office 365 because I travel to remote Alaska where there is no internet connectivity. I did not buy Office 365 I bought what I think is Office Home & Student FULL version. I hope that's correct.", "author": "763687432", "created_at": "2018-03-06", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33607273-stop-the-try-edge-nagging-on-microsoft-com", "header": "stop the \"Try Edge\" nagging on *.microsoft.com", "idea_text": "Microsoft products like Office 365 and then it is hard to avoid visiting microsoft.com websites. Every time we do, we get a \"Try Microsoft Edge\" pop-up.You can click \"No thanks\" 11837 times, but it keeps coming back. The irritation this causes started to negatively affect our appreciation of Microsoft products in general.When we switched to Windows 10, my company thoroughly evaluated the Edge browser and concluded that it does not meet our needs. With every Windows 10 feature update we do a quick check if it did improve, but until now we decided to stay with Firefox which comes the most close to our ergonomic champion Internet Explorer.", "author": "343251610", "created_at": "2018-03-12", "votes": 2, "reaction": [], "comments": [{"author": "343251610", "created_at": "2018-03-12", "text": "I started with: \"We use many Microsoft products like...\" but the first 3 words got lost in posting."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35800354-autocomplete", "header": "Autocomplete", "idea_text": "8% of data leaks are caused by autocomplete errors.  Why not highlight autocompleted entries in RED in the To/CC/BCC fields as a reminder?", "author": "861667741", "created_at": "2018-10-23", "votes": 2, "reaction": [], "comments": [{"author": "916366423", "created_at": "2019-08-28", "text": "Or why not Highlight Autocomplete names that are in the GAL in Green and the ones not found in the GAL in RED - This way the user would double check who they are sending to if they see a name in RED."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34475614-shared-mailbox-outlook", "header": "shared mailbox outlook", "idea_text": "Add shared mailboxes to the Outlook in Office365 online", "author": "798864139", "created_at": "2018-06-07", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34332193-add-slide-sorter-view-to-office-365-powerpoint-onl", "header": "Add slide sorter view to Office 365 Powerpoint online", "idea_text": "In order to organize any realistic talk, with more than 10 slides, it is important to have the slide sorter view. This feature is present in any presentation software, including PowerPoint for Desktop, but not on Office 365 online and also not on Office for iOS", "author": "790248673", "created_at": "2018-05-23", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32384146-make-a-viable-offer-for-single-households-with-a-s", "header": "Make a viable offer for single households with a stationary Windows computer and a Windows Laptop!", "idea_text": "I can not understand how Micosoft is thinking with it's offer for home and private. First some statistics:\"The proportion of one-person households increased by 10 percentage points between 1970 and 2012, from 17 percent to 27 percent.\"\n\"In 2014, the Bureau of Labor Statistics reported that 124.6 million Americans 16 years and older were single, or 50.2 percent of the population, compared with 37.4 percent of the population in 1976.\"Microsoft has no viable offer for all those millions (US) or billions (WW) of single households! A very normal Windows user has BOTH a stationary Windows computer AND a laptop Windows Computer.Microsofts Office 365 Personal allows for installation on ONE computer only - completely ridiculous and not understandable:\n- Does Microsoft want Windows enthusiasts to give up on a Windows laptop (like surface et al) and only use iPads or Android?\n- Or does Microsoft want Windows enthusiasts to throw away their stationary computer?\n- Microsoft promotes iPad and Android with its offeringYou give mobile Android and iOS users a licence on the move but you deny it to Windows users? \nHow are you thinking???I have no need whatsoever to step up to have 5 licences with the Office 365 Home offering.\nPleas don't suggest that to a single household that would be an insult.Why is Microsoft making it so VERY HARD for the few persons that still try to like Micosoft, Windows and Offce?Best regards\n", "author": "715538677", "created_at": "2017-11-26", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11517609-make-it-easier-to-figure-out-how-to-change-my-offi", "header": "Make it easier to figure out how to change my office.com password", "idea_text": "How about a nice tab or link for changing office.com password?", "author": "138980568", "created_at": "2016-01-20", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11667300-why-does-the-thesaurus-have-to-block-out-some-of-t", "header": "Why does the Thesaurus have to block out some of the text? It's annoying to change the window to accommodate it.", "idea_text": "", "author": "141874185", "created_at": "2016-01-31", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/12557631-make-it-actually-function-when-i-go-to-my-accou", "header": "make it actually function.  when I go to \"my account\" only get \"page loading\" message", "idea_text": "your account page and intall software page do not load properly.  just get message \"page loading\" for hours and nothing every happens else.", "author": "149047872", "created_at": "2016-03-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34265914-sync-100-of-onedrive-for-business-files-to-the-lo", "header": "Sync 100% of OneDrive for Business files to the local drive", "idea_text": "Please, need to be able to sync 100% of OneDrive for Business files to the local drive.  Then I can give up my network drives.  Many times, I need to work offline.", "author": "787686724", "created_at": "2018-05-16", "votes": 2, "reaction": [], "comments": [{"author": "828363763", "created_at": "2018-07-30", "text": "+1 on this. Very frustrating to have to set up syncs folder by folder. "}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38695309-remove-image-hyperlinks", "header": "Remove IMAGE hyperlinks", "idea_text": "Would like to see a shortcut to remove all IMAGE hyperlinks in a Word or Excel document at one time.   Instead of having do it individually  by using   right click/remove hyperlink     one     at     a     time .", "author": "926424934", "created_at": "2019-09-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/16871296-allow-users-to-drag-and-drop-files-within-jumplist", "header": "Allow users to drag and drop files within jumplists", "idea_text": "Please allow users to change the pinned and unpinned file sequence in jumplists. Also allow users to set the width of the jumplist so that we can see full file names. While these maybe Windows rather than Office problems, they are REALLY ANNOYING.While here, please note that there is no category of feedback that relates to general users like me. ", "author": "273032596", "created_at": "2016-10-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11489109-how-about-time-and-date-and-maybe-a-news-feed-w", "header": "How about time and date - and maybe a news feed? Weather???", "idea_text": "", "author": "138326844", "created_at": "2016-01-18", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13389219-renewal", "header": "Renewal", "idea_text": "You sent me an email reminding me my subscription renewed in May, encourging me to renew now. I did only to find you adjust my renewal date from May to April. The result I lost a month paid for last year. This seems unfair and inconsistent with good customer service. Please recify this for me and advise. Thank you Brian.", "author": "158867454", "created_at": "2016-04-11", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/14927367-counldn-t-instal-error-code-30125-1011-404", "header": "Counldn't instal - Error code 30125-1011 (404)", "idea_text": "The link in this error message should link to directions for uninstalling previous versions of Microsoft Office. Currently it only links to information about firewall settings and such.", "author": "180160551", "created_at": "2016-06-23", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/17129980-change-powerbi-tile-color", "header": "Change PowerBI Tile Color", "idea_text": "The PowerBI App tile is Yellow with White text, this makes it very difficult to read and fails to meet the web accessbility guidelines. Please change this color combination and review all of the color combinations in O365 to ensure web accessbility guidelines are met.", "author": "61605762", "created_at": "2016-11-16", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18836776-include-task-list-in-the-outlook-app", "header": "Include task list in the outlook app", "idea_text": "Include the task list on the mobile app so you know what you need to get done on the go. ", "author": "296634811", "created_at": "2017-04-04", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/17636998-notification-bubble-on-tiles", "header": "Notification bubble on tiles", "idea_text": "Portal.office.com can be a great start page, a hub where you can overview all your office apps.\nBut to make it useful, we need to see notifications on each tile/app, like it would display on an iPhone for instance.\nOutlook showing the nb of unread emails, yammer notifications, etc", "author": "253965976", "created_at": "2017-01-05", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18837148-when-i-created-column-by-calculated-the-items-c", "header": "When I created column by “Calculated”, the items cannot be displayed totally", "idea_text": "After I created column by “Calculated” in the List on classic experience, the item cannot be displayed totally by filtering. Even it can be all displayed on new experience, It would be really helpful if the item can be displayed extended on classic experience.", "author": "347063014", "created_at": "2017-04-04", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/20036299-allow-custom-tile-to-be-put-on-home-screen", "header": "Allow 'custom tile' to be put on home screen", "idea_text": "Allow 'custom tile' to be put on home screen", "author": "411695992", "created_at": "2017-07-11", "votes": 2, "reaction": [], "comments": [{"author": "275169844", "created_at": "2018-08-02", "text": "I agree.  Please make this happen microsoft.Why have the users have to go to All Apps and Other to find it?  Seems like a pretty simple request too."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/17380459-ability-to-have-2-different-site-collection-urls", "header": "Ability to have 2 different site collection URLs", "idea_text": "Similar to on-premise where you can extend the site collection to create another site collection with a different URL within the same SharePoint Environment.  We were wanting to be able to have two site collections with different URL that use the same AD.", "author": "294661810", "created_at": "2016-12-09", "votes": 2, "reaction": [], "comments": [{"author": "362999785", "created_at": "2017-04-25", "text": "I agree, I need this option as well for clients as I would rather them not really know our URL but I need to set up portals to store all their documents and QA reports. The 'Share\" feature is just to cumbersome for the amount we would need to use it. I also really wouldnt want to have to setup another on premise SP server just for this but looks like I may need to."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38062324-branding", "header": "Branding", "idea_text": "I had waited for the implementation that MSFT touted about being able to upload an SVG instead of simply bitmap's. When it finally happened I couldn't believe what I saw ... a limitation of 10k!!!! I understand dimension constraints (width and height) but the great thing about vector graphics are the ability to scale. Please force us to adhere to dimension constraints but not size!!!! Otherwise the best feature of SVG's are lost.", "author": "909409057", "created_at": "2019-07-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38072902-stella-excel-password-recovery-freeware-tool", "header": "Stella excel password recovery freeware tool", "idea_text": "With taking the help of Stella excel password recovery freeware tool excel user can quickly recover lost excel file password without any data lost of XLSX file. Try best excel password remover utility that is really excellent option to remove password protection from all version of excel file as:- 97, 98, 2000, 2003, 2007, 2010, 2013, 2016 and 2019. \nRead more:- ", "author": "908735110", "created_at": "2019-07-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38150551-%E4%B8%80%E8%88%AC%E3%81%AE%E3%83%A6%E3%83%BC%E3%82%B6%E3%82%82%E3%83%9B%E3%83%BC%E3%83%A0%E3%83%9A%E3%83%BC%E3%82%B8%E3%81%8B%E3%82%89%E5%90%84%E3%82%B5%E3%83%BC%E3%83%93%E3%82%B9%E3%81%AE%E6%AD%A3%E5%B8%B8%E6%80%A7%E3%81%AE%E3%83%9A%E3%83%BC%E3%82%B8%E3%82%92%E8%A6%8B%E3%82%8C%E3%82%8B%E3%82%88%E3%81%86%E3%81%AB%E3%81%97%E3%81%A6%E3%81%BB%E3%81%97%E3%81%84", "header": "一般のユーザもホームページから各サービスの正常性のページを見れるようにしてほしい。", "idea_text": "管理者しか見えない、各サービスの正常性のページを\nホームページから一般のユーザも見えるようにしてほしいです。", "author": "910942741", "created_at": "2019-07-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38196244-stop-us-english-overriding-the-default-proofing-la", "header": "Stop US English overriding the default proofing language", "idea_text": "This shouldnt require over an hour and a half with tech support to stop my documents being marked with wrong spelling because O365 seems to have US English on override.  \nMy whole computer is set to UK English but why is there not a simple setting in the O365 account options to let us choose WHICH English we proof in?  \nWhy does the install default to English only?  why cant we choose on install our version of English to avoid this entire issue?  \nThis is a massively simple fix which will avoid a lot of problems for a lot of people who dont use US English.  Because amazingly for a global product you seem to forget that there are other versions of English other than US.", "author": "911673046", "created_at": "2019-07-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38359327-the-new-outlook-has-lost-functionality-for-our-use", "header": "The new outlook has lost functionality for our users. They can no longer print details of their calendar events or choose date ranges.", "idea_text": "The new outlook has lost functionality for our users. They can no longer print details of their calendar events or choose date ranges.", "author": "914409469", "created_at": "2019-08-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38336950-web-app-notification-subfolder", "header": "web app notification subfolder", "idea_text": "sub folders in the web app should have a notification setting.", "author": "897896512", "created_at": "2019-08-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38342347-logging-to-the-portal-by-multiple-users-on-same-co", "header": "Logging to the Portal by Multiple Users On Same Computer", "idea_text": "I am an IT Consultant managing many clients.  Some of the clients have shared computers; that is multiple users use the same PC in a warehouse or manufacturing floors.  They use a cloud-based ERP using the browser.  We have trained them to use OWA for email, and log out and close the tab, when they walk away from the station.  Only during the past 4-6 weeks, when a 2nd user opens a new tab and accesses portal.office.com, and AFTER s/he provide her/his own credentials, because the get prompted for those information, it still brings up the email account of the person who LOGGED OUT!\nThings were different before.  This is a major security flaw.  \nKeep in mind, because of the need for the ERP tab and many other vendors' portals being open all the time, closing the browser completely is not an option.", "author": "914089162", "created_at": "2019-08-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38417164--microsoft-office-wondering-why-when-i-print", "header": "@Microsoft   @Office   wondering why when I print out my calendar, so I have a convenient monthly view, the smaller calendars on the top rig", "idea_text": "@Microsoft\n \n@Office\n  wondering why when I print out my calendar, so I have a convenient monthly view, the smaller calendars on the top right are of the current and next month? Why? Why not have the previous and next month? Please change this odd feature. 🤔", "author": "915457300", "created_at": "2019-08-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38425099-html-headings-do-not-follow-accessibility-best-pra", "header": "HTML Headings do not follow accessibility best practices", "idea_text": "The heading structure on the office.com homepage does not follow a logical order, making it confusing for screen reader users. There are headings at level 1 and 3, but none at 2. The page skips from the greeting at heading level 1 to \"Recommended\" in the Documents region at heading level 3 (It would help with navigation if \"Documents\" itself was a heading). Similarly, the OneDrive and SharePoint regions begin with a heading 1 and skip to heading 3 for the immedieately following content.", "author": "915577807", "created_at": "2019-08-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38541241-zaplogix-ost-to-pst-converter", "header": "ZAPLOGIX OST to PST CONVERTER", "idea_text": "To do a complete conversion of OST to PST I propose you Zaplogix OST to PST Converter application that has different features that make it most dependable and accommodating for the change. Utilizing it you'll be able to change over a single as well as more than one record at a one time without making any trouble. It also converts the multiple file format like PST, EML, MSG, RTF, TXT, MHTML, and office 365 formats. Download its free trial version and convert the first 25 items per folder.\nIt cost you $ 49 USD only for a home license.\nFor more info visit here: ", "author": "912886561", "created_at": "2019-09-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38522176-365-should-allow-other-email-programs", "header": "365 should allow other email programs", "idea_text": "With the new update I cannot send a doc from Word with another email program I am forced to use outlook. So I will leave office 365", "author": "917219431", "created_at": "2019-09-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38500090-autosave-to-local-pc", "header": "autosave to local pc", "idea_text": "Autosave to local pc. Some of us work on documents we *are not allowed* to save to the cloud. !!!!!! Other users just don’t *want* to. No local autosave is opposite of useful. Local autosave was a great, key, vital differentiator from google docs.", "author": "916838335", "created_at": "2019-09-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37984342-how-to-check-the-last-login-details-like-google", "header": "how to check the last login details like google?", "idea_text": "like google its easy to scroll down to footer and check the last login details and users, i.p location, device and place, it will be good if this option available on main email page top-left or top-right corner of the page, isnt it better option?", "author": "908133919", "created_at": "2019-06-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38518537-make-all-options-live-in-word", "header": "Make all options live in Word", "idea_text": "I would like to see comments in balloons, but when I found the place in the menu to turn them on, it's gray. This is not the first time Word won't let me select an option I want.", "author": "917169337", "created_at": "2019-09-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38427997-area-code-682-not-displayed-when-creating-new-o", "header": "Area code (+682) not displayed when creating new Office 365 tenant", "idea_text": "Area code (+682) not displayed when creating new Office 365 tenant", "author": "915632011", "created_at": "2019-08-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36724646-allow-auto-save-to-autosave-work-onto-my-hard-driv", "header": "Allow auto save to autosave work onto my hard drive, NOT ONLY THE CLOUD. LIKE IT USED TO.", "idea_text": "Allow auto save to autosave work onto my hard drive, NOT ONLY THE CLOUD. LIKE IT USED TO.", "author": "882608186", "created_at": "2019-02-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36948610-spell-checking-issue", "header": "spell checking issue", "idea_text": "encountered an issue when spell checking a block or two on a 60 page document. spell check does not focus on the particular block, it goes through it and checks the rest of the document. this has been going on since build version 1809 of the monthly channel. I changed the channel to semi annual February 2019 release date version 1808 build 10730.20280 - this works perfectly.", "author": "875098537", "created_at": "2019-02-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37085227-outlook-journal-is-not-accessible-in-office-365", "header": "Outlook Journal is not accessible in Office 365.  Please enable the Outlook Journal functionality in Office 365 (web access to Outlook).", "idea_text": "Outlook Journal is very useful but it is not accessible in Outlook on he web (Outlook in Office 365).  So currently, I can only access on my desktop.  Please enable the Outlook Journal functionality in Office 365 (web access to Outlook).  ", "author": "888351061", "created_at": "2019-03-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37133263-oliver-semys-s-gay", "header": "oliver semys s gay", "idea_text": "gayyyyy", "author": "889295677", "created_at": "2019-03-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36918505-the-mobile-portal-office-com-is-not-matching-the-l", "header": "The mobile portal.office.com is not matching the layout boundaries and format of my phone screen", "idea_text": "The mobile portal.office.com is not matching the layout boundaries and format of my phone screen.", "author": "102204669", "created_at": "2019-02-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37082278-make-the-customized-links-in-the-search-result-cli", "header": "Make the customized links in the search result clickable", "idea_text": "As it is now, even if the organization's Customized tiles shows up in the result, nothing happens when clicking on the links.", "author": "848795650", "created_at": "2019-03-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37201960-simple-option-to-exclude-groups-from-an-outlook-se", "header": "Simple option to exclude groups from an outlook search", "idea_text": "A simple toggle button to be able to exclude groups from an outlook search", "author": "890584615", "created_at": "2019-03-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37104034-grafik-bei-e-mail-druck-skalieren", "header": "Grafik bei E-Mail Druck skalieren", "idea_text": "Microsoft Ticket: 13323618\nHallo, seitdem wir auf Office365 umgestellt haben, werden Grafiken in unseren E-Mails, welche wir in A4 drucken wollen, abgeschnitten. Dies war bei unserem alten Outlook nicht der Fall. Hatte man die E-Mail mit den Grafiken auf A4 gedruckt, wurden diese entsprechend skaliert. Kann man dies einstellen ? Die Drucker und deren Treiber haben sich seit dem nicht verändert und sind in Ordnung. Die E-Mail im Anhang zeigt zum Beispiel solche Grafiken im Textfeld. Ein Druck im Querformat hilft ebenfalls nichts. ", "author": "888655456", "created_at": "2019-03-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36710887-hide-deleted-folders-from-filing-in-outlook-for-ma", "header": "Hide deleted folders from filing in Outlook for MAC", "idea_text": "When I bring up the Move / Other folder option and type the name of an existing directory, among the options given are the “deleted” folders.I do the deleting by “command backspace” and do not need to move a mail into a deleted folder. The way those options are set up is confusing and time consuming.There is no need for “deleted” folders need to Show when filing an e-mail.", "author": "882475048", "created_at": "2019-02-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37343212-fix-the-spellchecker-for-non-us-residents", "header": "Fix the spellchecker for non-US residents", "idea_text": "I live in Australia. As much as I love the US, I am not from the US and I do not use American English. But try to get Microsoft Word to default (and stay on Australian or US spelling) - just try! Some people like to be precise about the language they use. Do you realise (not realize!) what a problem this is in an organisation (not organization!) like mine?As well as trying to fix this problem myself on numerous occasions (searching on Google for a solution - following all of the advice), on numerous occasions, and then spending about 2 hours with Microsoft Support staff (who are wonderful), I have come to the realisation (not realization!) that the problem is simply unfixable. It is a Microsoft Word fault, and a serious one, that people just live with. One (very lovely) Microsoft Support person even suggested to me that English is becoming the universal language. Of course I've heard that before, but this was the first time I realised (yes realised, not realized!) the scary implications of what that means! In the US (and Microsoft) there is a US-centric view to this. But I live in Australia and our English is close to that of the UK (England, where English began) and I've always assumed that the universal language would be UK English, but go figure.Please can you fix this fault. If I set all (and I mean all) the defaults to English (Australian) why am I always forced back into using the US Spellchecker. As my Microsoft Support person explained, every time (yes every single time!) I have a new document sent to me that is not in Aus English (and they never are because everybody has this same problem) I will need to highlight the entire document and (again) set the language to Aus English.And even with Aus English as the (repeated) default in all possible ways (and doing everything I can to remove US English as an option), US English still appears in my spell checker as an option next to Aus English. And of course it is shown first! And a lot of the time the Aus English spell checker doesn't seem to work, so I am forced again to use the US Spellchecker.Please can you fix this fault.", "author": "893763787", "created_at": "2019-04-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36020254-mi-crosoft-offi-ce-2000-pro", "header": "MİCROSOFT OFFİCE 2000 PRO", "idea_text": "Microsoft Office 2000 Profesyonel CD sahibiyim ve Ürün Anahtarı Neden Kullanılamıyor?", "author": "869257396", "created_at": "2018-11-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37197673-attachments-won-t-open-in-personal-archive-in-outl", "header": "Attachments won't open in personal archive in Outlook Mail beta (web)", "idea_text": "Attachments in personal archive emails in \"The New Outlook\" beta version do not open. Emails in Inbox with attachments work OK as does standard Outlook Mail web client.  ", "author": "890508556", "created_at": "2019-03-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35896501-myapps-is-going-away-in-december-say-it-isn-t-so", "header": "MyApps is going away in December!  Say it isn't so!", "idea_text": "Microsoft is moving the MyApps Portal () to the O365 Gallery.  I think this is a horrible idea. Companies spend a lot of time and money training users (that honestly have no clue sometimes) on how to use the existing portal.  The current portal is so simple and smooth for the users.  It makes for a great user experience.   Office.com is no where near as smooth and easy to use.  The new interface will be so clunky and horrible to use compared to the current portal that is as simple as it could possibly be.  I am hoping enough people see and respond to this and convince Microsoft to keep the MyApps portal.", "author": "865677334", "created_at": "2018-11-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37446931-use-custom-images-for-the-cover-photo-on-your-prof", "header": "Use custom images for the cover photo on your profile", "idea_text": "Ability to post a custom image (such as company/department logos) to your profile page - similar to LinkedIn et al.", "author": "896131579", "created_at": "2019-04-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35636443-by-far-the-worst-product-on-the-market", "header": "By far the worst product on the market", "idea_text": "By far the worst product on the market", "author": "855546886", "created_at": "2018-10-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36188983-will-outlook-support-oauth-ability-at-t-will-s", "header": "Will Outlook support \"OAuth\" ability?  AT&T will soon require it to log into with Outlook.", "idea_text": "Please see Chat ticket number: HS-172385. Will Outlook support \"OAuth\" ability? AT&T will require it to access AT&T email in the next month.  I have been unable to log into my AT&T personal email account for the last several days.  AT&T has built a website to provide users of older email client software a \"Secure Mail Key\", however that AT&T website is broken. AT&T said it will take about a month to fully test this system.  For now I have to go to the AT&T Web mail to check my personal email, but I would rather use some email client software. If Microsoft Outlook will not support \"OAuth\", then I will have to use another email client software that is \"OAuth\" compliant.  You might want to look into this.Best regards,\nDouglas Jones\n", "author": "874157983", "created_at": "2018-12-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35798677-64-bit-installation", "header": "64-bit Installation", "idea_text": "On the Office 365 Installation page it should default to 64-bit instead of 32-bit. I think a lot of people install the wrong version by accident as most people want the 64-bit version. ", "author": "836778532", "created_at": "2018-10-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36239635-usps-mailing-labels-and-envelopes", "header": "USPS Mailing Labels and Envelopes", "idea_text": "Allow creation and printing of USPS mailing labels and envelopes directly from Outlook … similar to the functionality in Word.", "author": "874956094", "created_at": "2018-12-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35403586-provide-a-basic-web-page-option-for-hosted-domains", "header": "provide a basic web page option for hosted domains.", "idea_text": "Currently my domain says it is parked.  Not ideal for any business.  My current subscription should easily cover the provision of a basic 1 page web presence - like a web business card.", "author": "850395898", "created_at": "2018-09-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33995023-cannot-send-to-a-group-of-501-recipeints-with-trac", "header": "Cannot send to a group of 501 Recipeints with tracking, and send an update to them.", "idea_text": "If you send to groups totaling more than 500 receipients and have tracking turned on, you cannot update the text, links, or anything in the message, as it errors out with too many recipients. Furthermore, if you remove groups from the message, it starts sending out cancellation notices to everyone.   We had an executive sending out a big announcement company wide to 6 Distribution Groups, and the tracking expanded the message to over 500 recipients thereby making changes impossible.  It had an an incorrect link, and updating the message was disallowed.  Plus the recreating the meeting during the same time, was also a CONFLICT to the previous message, and the confusion was just awful.THIS NEEDS TO BE FIXED !!!!", "author": "778481617", "created_at": "2018-04-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33912580-powerpoint-total-slide-count-for-page-numbering", "header": "PowerPoint Total Slide Count for Page Numbering", "idea_text": "We are required to show the total slide count in our business presentations but PowerPoint does not have the ability to show the total slide count so we have to manually enter it into the slide template and remember to update it after we edit the slide deck.  Please add the ability to show Slide # of Total as a feature in Slide Numbering.", "author": "775865431", "created_at": "2018-04-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34133422-single-sign-on-for-office-and-linkedin-would-be", "header": "Single sign-on for Office and LinkedIn.  Would be great for LinkedIn to be in the \"waffle\", more useful than the email marketing feature!", "idea_text": "At the moment I have to log into LinkedIn separately from my Office 365 applications.  It would simplify the desktop if it was an icon in the Office 365 waffle in the Office home page.", "author": "728296606", "created_at": "2018-05-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34353556-use-it-as-an-office-new-tab-page-for-browsers", "header": "Use it as an Office new tab page for browsers.", "idea_text": "This is for users, not just admins. OK, so I have office 365 for school. It is a great experience, and I love being able to launch my office apps swiftly, but it feels like a missed opportunity as a replacement for traditional new tab pages in browsers like chrome or edge. Either as an extension, a setting, or just through URL, the page should be enhanced to function as a new tab. By default, all users should be able to add tiles to the launcher from any url or maybe even files, as connected service. The reasons this would be a good idea is because it has a really nice design that uses space well and allows for some customization, as opposed to the usual locked down new tab screens or the often cluttered custom extensions.", "author": "790893358", "created_at": "2018-05-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34409311-use-more-kid-friendly-words", "header": "Use more kid-friendly words", "idea_text": "I can not understand what these words mean. I am in middle school.", "author": "792629317", "created_at": "2018-05-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34690276-significantly-all-the-update-dialogue-windows-a", "header": "Significantly....all the update dialogue windows are missing and the applications quit with no notification", "idea_text": "This feedback page has too many options. I'm trying to get back to work. I use Office Home edition. Where is the option for feedback? 1. 16.14.1 quit with no notification\n2. There are no dialogue window updates indicating that software updates are necessary.\n3. There are no dialogue windows indicating that a file conversion is necessary from an old version to the new version.\n4. 16.14.1 had a missing Picture Format menu tab...then after it was found, missing Cropping Tool among other tools.\n5. That software update was half-baked.\n6. Now on the third day of tech support calls, more than 3 hours wasted.", "author": "818736097", "created_at": "2018-06-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35018527-outlook-journal-is-was-one-of-the-most-brilliant", "header": "Outlook Journal is (was) one of the most brilliant ways to track the progress of projects ...", "idea_text": "Outlook Journal is one of the most brilliant ways to track the progress of projects ... Please Don't kill it off as seems to be happening ... Expand it to better include links to other current project files of any type.. with better task integration this should be a killer business app .. wheras at the moment its a hidden bit of flotsom on an otherwise great email progam ", "author": "829536334", "created_at": "2018-08-02", "votes": 1, "reaction": [], "comments": [{"author": "888351061", "created_at": "2019-03-12", "text": "Agreed.  It is very useful for documenting notes related to calendar entries, conversations, etc.  Presently, I can only access it on by desktop, not on Outlook on the web in my Office 365 account.  I would appreciate having access to it on the online platform, just like the other functionality such as address book, notes, calendar, etc."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34514173-add-inbox-and-calendar-view-to-the-portal-front-pa", "header": "Add Inbox and Calendar view to the portal front page", "idea_text": "The portal page should be an overview to my overall experience, not just a file-oriented landing spot. Customization, with the ability to add these modules would be very helpful.", "author": "805598872", "created_at": "2018-06-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34740055-ability-to-re-order-animation-triggers", "header": "Ability to re-order animation triggers", "idea_text": "In PowerPoint it is simple to change the order of animations. But if you use 'triggers' to fire the animations, the triggers cannot be moved. Sometimes while working on a slide with several triggers you realize you would like to add another. By default it will be added to the bottom of the triggers and your animations may not play in the proper sequence. ", "author": "820174984", "created_at": "2018-07-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34580374-additional-sound-options-under-ease-of-access-fo", "header": "Additional sound options under \"ease of access\" for Word & Excel application in Office 365", "idea_text": "I noticed recently that the sounds in Office 365 Home Excel application had changed. By calling Microsoft I learned that the Ease of Access option provides only two sound options - Modern or Classic - and I don't care for either one. They both sound very electronic or like the sounds you'd hear on pinball machine. I'd like some options where the sounds are more soothing ", "author": "815441236", "created_at": "2018-06-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34740088-make-the-registration-mark-automatically-supersc", "header": "Make the ® registration mark automatically superscript", "idea_text": "When typing in MS Office and needing to have the ® registration mark, it would be great if it was created in superscript when you use (R). Similar to (TM). For some reason other 'marks' such as (TM) are in superscript but the ® isn't. Takes a lot of time to select it then select 'superscript' from fonts. Especially when you work with documents that use this symbol a lot. ", "author": "820174984", "created_at": "2018-07-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35044486-possible-new-design-for-homepage-logged-off", "header": "Possible new design for homepage (logged off)", "idea_text": "I thought it'd be great if the Office.com homepage, when the user is logged off, would look like this: That way, it'd be pretty simple, and each of the icons would redirect to the appropriate app, be it Outlook, Word, PowerPoint, OverDrive, etc.", "author": "830544826", "created_at": "2018-08-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35144263-i-don-t-know-how-you-do-it-but-its-freakingly-sl", "header": "I don't know how you do it , but its freakingly slow today and yesterday (17th Aug 2018). if you click on forward you have to wait so long", "idea_text": "I don't know how you do it , but its freakingly slow today and yesterday (17th Aug 2018)\nIf you click on forward it takes years to show you the forward screen, and also if you click show from it also take freaking time to show you .why its getting slower and slower.", "author": "836811028", "created_at": "2018-08-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35208424-outlook-prompt-if-more-than-n-addresses-in-to-or", "header": "Outlook: prompt if more than n addresses in To or Cc", "idea_text": "If the user enters more than n email addresses in the To or Cc fields suggest they move them to Bcc. Many reasons for this but malware loves to collect email addresses comes to mind. Also reducing the mail header is another - too many addresses displayed is fluff and Reply All is very annoying. ", "author": "841186996", "created_at": "2018-08-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35355280-i-like-many-others-paid-a-yearly-subscription-expe", "header": "I like many others paid a yearly subscription expecting Publisher to be available on all my devices.  No where in the sale of this package d", "idea_text": "I like many others paid a yearly subscription expecting Publisher to be available on all my devices. \nNo where in the sale of this package do you state Publisher is NOT available on a mobile smartphone. \nIf I had of known this I would not have brought the yearly package. \nThis is misleading people. \nThis should be boldly stated on the package or told to customers when buying your product. \nVery bad I even asked the sales person when I brought the product they told me it was so vary disappointed. ", "author": "847884922", "created_at": "2018-09-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35204413-i-have-a-colleague-who-is-blind-and-navigating-the", "header": "I have a colleague who is blind and navigating the home page is a nightmare", "idea_text": "My colleague needs to be able to focus on the content rather than the apps in terms of what her screen reader (Jaws) reads. It is also exceptionally difficult to work on the basis of search - pretty central. Also, are there ways to make scrolling through browser headers more viable using keyboard shortcuts? ", "author": "840858067", "created_at": "2018-08-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32051929-how-does-one-clear-the-very-old-list-of-recent-do", "header": "How does one clear the very OLD list of \"Recent Documents\" from the \"Get Office\" app?", "idea_text": "", "author": "701291890", "created_at": "2017-10-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32219887-minimize-skype-for-business-immediately-instead-of", "header": "minimize Skype for business immediately instead of having to minimize manually each time it starts first time", "idea_text": "minimize Skype for business immediately instead of having to minimize manually each time it starts first time.I don't want to have to manually minimize this every time I restart my computer.  It is really annoying.  Please either forward this request to the developers or please tell me where I can post this so that they will see it.", "author": "708628387", "created_at": "2017-11-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32331415-make-the-stay-signed-in-option-actually-work", "header": "Make the 'stay signed in' option actually work", "idea_text": "I have to hop between different accounts a fair amount, and on the same workstation I am continually asked once I log in if I would like to stay signed in to reduce the number of times I must authenticate. 'Do not show again, and no' I say, over and over again, and yet I continue to be asked.\nPlease fix this incredible annoyance.", "author": "712987225", "created_at": "2017-11-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32362975-compatibility-issues-with-office-and-high-sierra", "header": "Compatibility issues with Office and High Sierra (Mac)", "idea_text": "The currently available patch that is available for download does work and resolves the problems with Outlook. However, Mac usres are used to seeing the 'box' package icon appear with some text to let them know that the patch is running. When I used this patch nothing appeared on the screen and I mistakenly assumed it was not working. It was, but it took a while (several minutes on my machine). So maybe add a note to people to say that they need to give the package time to operate?", "author": "714453529", "created_at": "2017-11-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32518336-unable-to-create-links-on-the-sharepoint-homepage", "header": "Unable to create links on the SharePoint Homepage", "idea_text": "Unable to create links on the SharePoint homepage (Unable to create links on the SharePoint Homepage () since the last update.Please bring the option back, especially when working with several sitecollections in one tenant.", "author": "721522633", "created_at": "2017-12-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32537053-true-sso-for-portal-office-com-myapps", "header": "True SSO for portal.office.com/myapps", "idea_text": "currently we can access myapps.microsoft.com/domain.com without prompt for email.  However, portal.office.com/myapps required prompt for users to click on the email.  The portal.office.com/myapps has better look and feel than myapps.microsoft.com panel.", "author": "722293192", "created_at": "2017-12-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32410747-add-site-settings-back-to-gear-drop-down", "header": "Add \"Site Settings\" back to gear drop-down", "idea_text": "\"Site Settings\" link was recently moved from gear drop-down and placed w/in a new gear drop-down \"Site Information\".  Given how frequently site admins need to access Site Settings during their daily work, we are extremely disappointed at this development!", "author": "716726488", "created_at": "2017-11-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32826427-how-to-contact-dell-printer-technical-support-team", "header": "How to Contact Dell Printer Technical Support Team", "idea_text": "Dell printer can be counted as one of best printer in the world as it has multi-functional features which can be utilized by the users. Dell printer can not only print but it can scan, photocopy and even fax. What else the users need in a single product. In case the users face some technical issues in that case, the users should not worry as we have a tech support system which has the capacity to resolve every kind of issues they face through Dell printer tech support number +1-800-236-5725 where they will be assisted by our well qualified and skilled technicians who will resolve the issues within a short period of time.Read More- \n", "author": "731270695", "created_at": "2018-01-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33021229-add-an-english-to-spanish-translator-feature-for-i", "header": "Add an English to Spanish translator feature for iMac", "idea_text": "Add an English to Spanish translator feature for iMac", "author": "743189044", "created_at": "2018-01-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33054574-office-365-should-work-on-safari", "header": "Office 365 should work on Safari", "idea_text": "MacOS 10.13.2 and Safari 11 throws javascript console errors after logging into the site, starting with:TypeError: undefined is not an object (evaluating 'Object.getOwnPropertyDescriptor(e,t)')\ngetOwnPropertyDescriptor — zone.js:1173\ni — zone.js:1173\no — zone.js:1261\nS — zone.js:2536\nT — zone.js:2567\n(anonymous function) — zone.js:2867\n__load_patch — zone.js:86\n(anonymous function) — zone.js:2866\n(anonymous function) — zone.js:3014\n(anonymous function) — zone.js:3014\n1gdr — vendor-bundle.js:4865\nr — \nsgr6 — vendor-bundle.js:58245:86\nr — \n(anonymous function) — vendor-bundle.js:4872\nr — \nofficehome_webpackJsonp — \nGlobal Code — vendor-bundle.js:1\nInitialize — sharedscripts.js:1:116", "author": "744535828", "created_at": "2018-01-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31700968-allow-several-images-to-be-used-as-image-for-the-l", "header": "Allow several images to be used as image for the logon page (maybe also based on department)", "idea_text": "Today you can change the default background image in a custom background image. That's already a good thing, but it would be great if there would be an option that several images can be used random and/or based on the user who will logon. For example a company has 2 departments, you upload 2 images and based on the department you select an image.", "author": "437263765", "created_at": "2017-10-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32653885-notifications-sidebar-should-open-into-full-applic", "header": "Notifications Sidebar Should Open into Full Application", "idea_text": "The notifications sidebar should open into a full application. The notifications sidebar has a ton of useful information--basically all Office items (calendars, email, tasks, etc.) that have a recent due date. It seems to make sense to be able to view and work with this data on full page. This would also be true of the Outlook Desktop \"Reminders\" window, which is a tiny little window that cannot be expanded to see the full list of items--completely under utilized data.", "author": "108071772", "created_at": "2017-12-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33118903-print-emails-in-the-draft-folder", "header": "print emails in the draft folder", "idea_text": "currently you can't print emails in the draft folder.  Seems like something that would be easy to fix and I would be very appreciative", "author": "747191668", "created_at": "2018-01-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18705589-a-grammar-correction-error-in-spanish-for-alguna", "header": "A grammar correction error in Spanish for \"alguna imbécil\".", "idea_text": "MS Word grammar correction in Spanish marks \"some he-idiot reads\" as wrong, and instead suggests \"some she-idiot reads\", as correct option:\n\"algún imbécil lea\" - marked as wrong.  Suggested: \"alguna imbécil lea\".  It should be allowed for both genders.", "author": "347282986", "created_at": "2017-03-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18731659-set-by-default-to-be-text-oriented", "header": "set by default to be text-oriented", "idea_text": "Homepage \"portal.office.com\" or \"outlook.office.com/owa\"The user name entry box should be set by default to be text-oriented from left to right even if the browser is Arabic or any other languageAs in Hotmail and Outlook", "author": "348238114", "created_at": "2017-03-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18837100-metadata-navigation", "header": "Metadata Navigation", "idea_text": "Currently the new document library experience does not support Managed Navigation, so I have been using Managed Navigation on classic document library. \nWhen I set the Group By setting as follows, some items were expanded.\n-        First group by the column: managed metadata column\n-        By default, show groupings: ‘Collapsed’\nWe love the new experience however we need to get navigation right before we can do this. ", "author": "347063014", "created_at": "2017-04-04", "votes": 1, "reaction": [], "comments": [{"author": "361602604", "created_at": "2017-04-21", "text": "The issue with Modern Libraries not supporting Metadata Navigation is a huge issue in our environment.  Users are getting confused as to how to navigate when some libraries are set to classic while others are modern.  NOT GOOD for user adoption.  When is this getting fixed?"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18822130-move-old-items-from-clutter-folder-to-inbox-after", "header": "move old items from clutter folder to inbox after disabling clutter feature for all users", "idea_text": "i need script powershell : move old items from clutter folder to inbox after disabling clutter feature for all users without any problems", "author": "348238114", "created_at": "2017-04-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19539319-office-365-splash-page", "header": "Office 365 splash page", "idea_text": "On the splash page is a graphic which says \"connect\" in several different languages. The one for Hebrew is incorrect. It says: להתחבר. Instead it should say: תתקשר. Please make the correction.", "author": "392649400", "created_at": "2017-06-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19514170-is-there-a-way-to-customize-office365-portal-or-on", "header": "Is there a way to customize office365 portal or online email? So user could see the part of one drive, team chat without switching around fr", "idea_text": "Is there a way to customize office365 portal or online email? So user could see the part of one drive, team chat without switching around from waffle or may be make a link for each application and when you click on active app link it take major portion still making smaller view of other services visible?\n", "author": "391291525", "created_at": "2017-06-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19703263-prioritize-support-articles-over-forum-posts-in-su", "header": "Prioritize support articles over forum posts in support.office.com", "idea_text": "Recently, the search function on support.office.com appears to have been changed to prioritize forum posts from answers.microsoft.com over actual support articles.  I used to be able to search for an issue and find what I need right away, but now I get thousands of search results and have to wade through pages and pages of forum posts to find useful information.", "author": "399446332", "created_at": "2017-06-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19952833-add-a-new-picture", "header": "add a new picture", "idea_text": "It would be amazing", "author": "405619882", "created_at": "2017-07-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19963252-add-customize-a-displayname-on-the-welcome-page", "header": "Add/Customize a Displayname on the Welcome Page", "idea_text": "Would like to have the ability to add/customize a displayname on the welcome page. (i.e. Good Morning John, Doe; Good Afternoon John, Doe)", "author": "406672615", "created_at": "2017-07-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19805827-more-clouds", "header": "More Clouds", "idea_text": "There are numerous clouds in which people store their data. With OfficeOnline you can use only 2 Clouds. This is not conducive! Please allow users to access other Clouds and the hard drive of their computer.\nFor example, I use at least 5 Clouds. It makes no sense for me to constantly move files back and forth, just because access is not possible through Office Online.", "author": "402348352", "created_at": "2017-06-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/12505188-i-want-to-reduced-the-size-of-home-page-on-wordpre", "header": "i want to reduced the size of home page on wordpress.", "idea_text": "", "author": "148382343", "created_at": "2016-02-28", "votes": 1, "reaction": [], "comments": [{"author": "148382343", "created_at": "2016-02-28", "text": "i want to reduce the size of home page on MS word plz let me out here."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18654952-pfortner48-gmail-com", "header": "pfortner48@gmail.com", "idea_text": "$ how much money ?? Per month or year ", "author": "345261058", "created_at": "2017-03-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13007433-fix-the-bug", "header": "Fix the bug", "idea_text": "OK so every time i try to edit or create a new doc it will not let me saying it has a problem ", "author": "152389233", "created_at": "2016-03-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13100148-when-i-go-to-create-a-document-how-about-being-ab", "header": "when i go to create a document, how about being able to create one?", "idea_text": "I'm supposed to try again later because word couldn't create my new document? Can you tell my boss please?", "author": "153830358", "created_at": "2016-03-23", "votes": 1, "reaction": [], "comments": [{"author": "153830358", "created_at": "2016-03-23", "text": "Hide formatting!!!!!"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13746741-dupicate-the-word-desktop-client-app-s-object-met", "header": "Dupicate the Word Desktop client App's  Object method of \"ShowHiddenText\"", "idea_text": "In the desktop Office Word app is the method to hide or show text and I am wondering if the Web version of Word has a similar method?  If not then it needs it.Small example use on desktop client:             Me.application.ScreenUpdating = False\n                Me.application.ActiveWindow.View.ShowHiddenText = Not ", "author": "164826375", "created_at": "2016-05-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13332402-offline-installer-for-office-2013", "header": "Offline Installer for Office 2013", "idea_text": "We have a computer that needs its copy of Office 2013 installed. All available options at this time are for an on-line installation. That DOES NOT WORK for the offline computer.\nWORST SERVICE EVER! Pay money for a product that cannot be used.", "author": "157181814", "created_at": "2016-04-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/14814783-restore-basic-functionality", "header": "Restore basic functionality", "idea_text": "I work on a Mac running El Capitan.  When establishing or changing any meeting with WEBEX the program freezes.  Forcing the program closed does not solve the problem.   Rebooting the machine does work.  Our contracted computer support says, \"This is a known issue.  Check back in a few weeks and maybe Microsoft will fix it\".  Its been a week.  \nI loved working on a Mac.  Using Microsoft software is making this experience just as poor as working on a Windows Machine.", "author": "176040972", "created_at": "2016-06-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13318032-add-a-powerapps-icon", "header": "Add a PowerApps icon", "idea_text": "I recieved my invite to power apps, put in my e-mail address and was greeted with an 'Oh, we know you' message.  When I clicked to continue, I was redirected to the normal office 365 screen with no way to continue to use power apps that I can find.", "author": "156878262", "created_at": "2016-04-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13197147-bring-back-the-microsoft-office-mobile-applicati", "header": "Bring back the 'Microsoft office mobile' application for iphone/andriod", "idea_text": "bring this back please it allowed the use of editing on documents and easier to use one app for all. ", "author": "149530035", "created_at": "2016-03-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/15042468-give-option-to-remove-all-sounds-from-online-offic", "header": "Give option to remove all sounds from online Office 365", "idea_text": "Currently there is no way to remove all sounds, or notifications, from the Office 365 websites and online applications. Give the customers the option to turn off all the sounds. There are a few option to remove the notifications, but those are only display notifications not sound.", "author": "184534200", "created_at": "2016-06-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13189386-email-survey-about-office-360", "header": "email survey about Office 360", "idea_text": "I have received an email twice from Microsoft requesting participation in a survey about Office 360.  Each time I click the link to take the survey, it triggers an error message \"An error has occurred and has been logged by our system.\nThank you. \" I run Windows Vista at present.  You might want to fix that error.  Of course I can pay for Office 360 subscription, but am not able to run it on a Vista machine, apparently.", "author": "154882650", "created_at": "2016-03-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/15832465-fix-reviewer-filtering-in-word-2016-mac", "header": "Fix Reviewer Filtering in Word 2016 Mac", "idea_text": "Reviewer filtering works in 2011 but not 2016.  Cannot show selected reviewer and no checkmarks appear as they do in 2011.  Printing removes all reviewer names.", "author": "228527749", "created_at": "2016-08-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/15200463-add-unread-messages-fo-to-the-top-of-the-toolba", "header": "Add 'UNREAD' messages fo to the top of the  toolbaru, not just in 365 but also office.com wthout having to customise - it should be standard", "idea_text": "Add 'UNREAD' messages to the top of the toolbar, not just in 365 but also office.com without having to customise - it should be standard", "author": "190938561", "created_at": "2016-07-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11589873-mak", "header": "Mak", "idea_text": "Need by default an option to store every thing in the hard drive, And upload as and when I have a stable internet via Wi-Fi and or carrier data. I am from a developing country. I am lucky at least I can afford cost of Data. Still the connection when it is there slow and many times in an hour or two it goes on and off as monkeys are playing with on and off switch .For those who can not afford to be on and connected to the cloud you strategy is a failure. ", "author": "140484963", "created_at": "2016-01-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11293533-check-compatibiltiy-with-older-versions", "header": "Check compatibiltiy with older versions", "idea_text": "I've been having a lot of complaints that people can not open word / ppt files I have saved since I updated my Office 365 - I've had to save as older version which I did not have to do before upgrading.  This is very annoying as the option is to save to 97 and quite a few more features doing this.  ", "author": "134594391", "created_at": "2016-01-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/12346944-about-the-web-page-of-office", "header": "About the web page of office", "idea_text": "In this web page it shows the recent document don't show the deleted item in recent document thank you at advance", "author": "145722102", "created_at": "2016-02-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/12358047-have-microsoftoffice-let-you-add-friends-and-work", "header": "Have microsoftoffice let you add friends and work  together", "idea_text": "-add your friends that have Microsoft.\n-Talk to each other while working on the same project.\n-Example: If you have something due tomorrow you click on your friend and it will call you both work together at the same time boom your done.", "author": "145930659", "created_at": "2016-02-16", "votes": 1, "reaction": [], "comments": [{"author": "145930659", "created_at": "2016-02-16", "text": "I love this idea"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11662749-i-just-bought-office-home-and-business-2016-after", "header": "I just bought Office Home and Business 2016--after logging in needed to change password--and then everything disappear Product Key gone--!!!", "idea_text": "I just bought Office Home and Business 2016--after logging into the Microsoft account--nothing came back to help me set up Office---just office 365 offering free trials.....what happened!!!! 1/31/2016", "author": "141840660", "created_at": "2016-01-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19272991-too-confusing-365-is-one-out-of-five-stars", "header": "Too confusing.  365 is one out of five stars!", "idea_text": "Too confusing.  I don't know how many times I have installed software to get everything I want.  Then, I find out I must create a domain to use Skype for Business.  I still haven't figured that one out.  So, I have the program, but can't use it.  Not cool!  Now, I can't send the feedback!  Way too hard!", "author": "374464420", "created_at": "2017-05-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/19042165-multiple-s-n-under-the-same-email-address", "header": "multiple s/n under the same email address", "idea_text": "My company uses the same email account for multiple s/n of Office 2016. Instead of sending the users to create there own list of s/n (which s/n is in use on which computer) why should'nt you guys add an option for notes/comments. Then we the users could add a comment in the portal knowing that s/n ***-***-*** belongs to \"Computer1\" for example. ", "author": "362939281", "created_at": "2017-04-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/12362358-would-kindly-like-know-if-ms-publisher-2013-still", "header": "Would kindly like know if MS Publisher 2013 still supports - Website publication. Thanks", "idea_text": "", "author": "146019390", "created_at": "2016-02-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/16077280-need-to-update-the-information-on-open-and-use-a", "header": "Need to update the information on \"Open and use a shared mailbox in Outlook on the web for business\"", "idea_text": "The information regarding adding and sending e-mail from a shared mailbox in Outlook web needs to be updated.The link:\n* How do I send email from the shared mailbox?\nOn step 2 when you click on the three dots and click \"Show from\" it needs to be added that you have to right-click and choose to remove your own username and then search for the shared mailbox so it can be added and then be able to send e-mails from a shared mailbox.I had to contact the support to figure this out.", "author": "242509204", "created_at": "2016-09-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/16986013-microsoft-office-app-mobile-app", "header": "Microsoft Office App & Mobile App", "idea_text": "What if Microsoft succeeded to develop an Office App & a Mobile App (I call it ChatosApp) that can deal with different social media apps. like facebook, twitter, ...etc\nIn such a way that a person can check messages coming from social media applications & can reply to them from 1 microsoft office/mobile app & the senders can see the person's replies on their own applicationsFor example the ChatosApp can receive a post from a facebook friend and can receive a tweet from another twitter friend & ChatosApp can respond to the post in such away that facebook friend can see the reply within his facebook app & the twitter friend can do the sameThis ChatosApp will make it easier for users who have headache of moving across apps to respond to their friendsPlease check the possibility of deveoloping the a/m idea & please let me know\nThanks\nEmad Eddeen Mohamad Hefny Abdel Naby\nAlexandria, Egypt ", "author": "278192665", "created_at": "2016-11-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/16114345-insert-inking-and-draw-capabilities-to-office-365", "header": "Insert inking and draw capabilities to Office 365 so that tablets can be used with it for document markups.", "idea_text": "Insert draw and inking capabilities to Office 365 so that document markups can be performed by the user and with other devices as Wacom Intuos Pro.", "author": "245042341", "created_at": "2016-09-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/17410432-create-rule-on-mac", "header": "Create rule on Mac", "idea_text": "Creating rule using office 365 / personal is very complex I have 23 000 emails and unable to organise it to create rules and subfolder . Old versions was much easier to use. Hope to update create rules to easier procedure ", "author": "295979602", "created_at": "2016-12-12", "votes": 1, "reaction": [], "comments": [{"author": "349406116", "created_at": "2017-03-29", "text": "We also need to share rules between Mac and Windows versions of Outlook."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18566392-too-slow-with-updating", "header": "too slow with updating", "idea_text": "when I put in my profile picture it still hasn't loaded 3 hours later\n", "author": "341043481", "created_at": "2017-03-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/18504094-distinguish-licence-for-a-device", "header": "Distinguish Licence For A Device", "idea_text": "Add a txt box so I can tag which licence was registered against which device, or maybe list the device that was used to install licence on...\nMy issue is that i have 20 odd MS Office licences registered against my account but am unable to distinguish between them from the site.  I am currently having to keep records separately of date installed and which device, but even this is proving difficult as I may install several on the same day..... also the date does not correspond to the actual date I installed due to time difference for Australia.", "author": "339344686", "created_at": "2017-03-02", "votes": 1, "reaction": [], "comments": [{"author": "366991765", "created_at": "2017-05-03", "text": "I like this idea - just do it!!!  If I need to redo a clean install - I do need to know which license was with what device."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/17818246-remove-sharepoint-from-connected-services", "header": "Remove Sharepoint from connected services", "idea_text": "I would like sharepoint option removed from Word and Excel 2016.  I cant stand Sharepoint one bit.", "author": "311160535", "created_at": "2017-01-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/20373202-if-after-loging-out-at-the-left-top-corner-d", "header": "if after loging out. '->' at the left top corner disapear it will be more beeter for security for once account", "idea_text": "just disappear the sign '->' at the top left corner of the searching browser. better for security of Microsoft account\n", "author": "427511659", "created_at": "2017-08-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/30934141-home-page-subscription-renewal-for-keys-already-pu", "header": "Home Page Subscription renewal for Keys already purchased without autorenew with credit card", "idea_text": "Expiration data should be more visibile next to each product in O365 on the individual home page.People that buy subscription keys like employees, gifts to people, online should also be able to Enter Key (Visible button) or Option to Auto-Renew based on which way they acquired key.  Sometimes they could have been gifted or a family member could have added them as part of 5 users or sometimes they might want to  autorenew with their credit card.  User should have that option to enter.  I was on the phone for over an hour (no fault of customer care rep).  She was one of the best you have.  We talked about this and I am entering this as well.  Also, I am a Microsoft Employee and have same concerns from a lot of my friends and family.", "author": "655364599", "created_at": "2017-08-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31218016-location-aware-app-tiles", "header": "Location Aware App Tiles", "idea_text": "Allow the creation of tiles that either appear or not based on where you log in from. For example we have a web app internally that is accessed by 5k+ staff at any one time. Externally the access is only a few hundred. I don't want to push everyone through the AADProxy but I do want everyone to use MYAPPS as their landing page. \n", "author": "662612353", "created_at": "2017-09-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31494082-allow-the-admin-home-page-to-be-modified-when-dirs", "header": "Allow the admin home page to be modified when DirSync is enabled", "idea_text": "Per support, the reason I cannot modify the layout of my admin home screen is because DirSync is connecting my on-premise Ad to Office365/Azure. I can think of no reason that these should be related. I'd just like the ability to move panels around on my admin page so the most relevant items are at the top of the page. Please change this to allow customization even with DirSync enabled", "author": "671624152", "created_at": "2017-09-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31465546-i-like-this", "header": "i like this", "idea_text": "", "author": "670966186", "created_at": "2017-09-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31179712--installer-office-2016", "header": "\"Installer Office 2016\"", "idea_text": "When on the office 365 home page, if the language is french, the \"Installer Office 2016\" link should download the Setup.x86.fr install instead of the Setup.x86.en-us install", "author": "661696129", "created_at": "2017-09-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34298941-onenote-provide-a-change-text-case-command", "header": "OneNote Provide a Change Text Case Command", "idea_text": "Why Doesn't OneNote Provide a Change Text Case Command, is not fair to go to Word to correct this, a feature like this must come included in One Note 2016 o above", "author": "789181198", "created_at": "2018-05-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33128668-norton-customer-support-phone-number-1-800-884-036", "header": "Norton Customer Support Phone Number 1-800-884-0365", "idea_text": "What if the users face the error due to dangerous cyber threats? This is just not the situation which everyone wants as they failed to access even their system or any other devices. We have a solution in the form of Kaspersky antivirus through which the users can remove all kind of dangerous viruses, malware, or spyware. In case the users face some technical issues while using Kaspersky then they have not to worry as we can assist them in resolving those issues through Norton tech support number +1-800-884-0365.Read More:  \n", "author": "747571780", "created_at": "2018-01-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33237598-fire-all-your-web-developers", "header": "Fire all your web developers", "idea_text": "Start from the bottom and build a web portal that actually works properly. Fire your current developers and poach some from a decent company like Apple or Google. That way your website will work and your customers won't kill themselves - meaning you'll sell more subscriptions.The new sign in \"experience\" is horrific, it has not fixed the problem just made the login more frustrating. Why not show the username and password field at the same time?MS is supposed to be a legitimate organisation, please sort this out. Everybody I've ever spoken to that has to use the admin portal for 365 hates their life as a direct result of the horrific design and implementation\n", "author": "675366190", "created_at": "2018-02-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34286926-allow-search-folders-across-multiple-mailboxes", "header": "Allow Search Folders across multiple mailboxes", "idea_text": "The Search Folders tool is great for finding and grouping emails, however this is not available across all mailboxes. We have staff that administer shared mailboxes and make extensive use of categories. The ability to create a Search Folder across all mailboxes would be a really useful tool", "author": "788278030", "created_at": "2018-05-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31503508-add-description-title-to-installs", "header": "Add Description Title to installs", "idea_text": "When I am looking up my account and I have multiple installs of Office. (store.office.com/myaccount)  Would be great to be able to add a description as to what PC this is loaded on.  Just in case I ever have to go back to it I can find the exact install for that system.  Currently I have to print out the key so I can store in a folder for that PC.  ", "author": "671920159", "created_at": "2017-09-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35666680-search-and-share-for-pdf", "header": "Search and Share for PDF", "idea_text": "I really like the ability to search across all my access folders and with office documents, I can very easily share anything I find via onedrive. However that does not seem to exist in the case of PDFs it would be nice to be able to do that same sharing with a PDF from search results. ", "author": "856867447", "created_at": "2018-10-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33204607-terrible-customer-support-and-stop-lying-about-rea", "header": "Terrible Customer Support and Stop Lying about Read-Only Sharing Ability", "idea_text": "I have yet to receive any real assistance in resolving my concerns, despite hours and hours of effort.1.  My scheduled call for 11am is now more than 1.25 hours late.  This is not acceptable, especially after having to wait 3 hours to receive a call the previous day after being told it would be only a 10 minute wait time.2.  Also received a completely useless email from another engineer, Lars Peterson, pointing me to the following thread that provides nothing but a list of complaints similar to mine, but no solution for Read-Only sharing, as quoted below.\"Also, currently the only way to restrict permissions at this time, is via SharePoint, as answered by this technician who answered another person who was looking for the same functionality.3.  Specifically told in a pre-sales call that the option to share a document as read-only (no printing, downloading, sharing, editing allowed) was possible.  I have not found this capability, support was unable to show it to me, and no one has called me as promised, or even emailed me with a link, to provide a solution.  At this very moment, I am on hold with Office 365 support, because I called in after Microsoft did not honor its commitment to call me.  WAS I LIED TO IN MY PRE-SALES INQUIRY THAT THIS OPTION EVEN EXISTS?4.  Also promised to fix the fact that No Users are showing up on the Active Users page of my Admin Center.  This issue still remains unresolved, and no update as to its status has been provided.  See attached screenshot with Time Stamp for evidence.This is all highly unacceptable.  If the quality of service does not improve immediately, we will be forced to look elsewhere for a working solution.", "author": "751025272", "created_at": "2018-02-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36185875-admin-ability-to-push-apps-to-the-home-page", "header": "Admin ability to push apps to the home page", "idea_text": "Ability to push apps to the home page\nThere is already a uservoice entry to give admin the ability to pin apps for everyone (app waffle).  Currently, the admin portal has absolutely no ability to customize the Office homepage apps at the top. We would like the ability to add custom apps to the home page (not just the “frequently used Microsoft apps”).  And have those apps displayed based off of AAD groups.\nExamples:\nAAD group for staff, have the “Service Desk” app displayed on the home page (a custom app we have that takes them to SCSM portal) \nAAD group for students, have a “Discovery Ed” app displayed on the home page (another custom app)The admin center should have customization of the homepage for at least:\n- The apps that can & cant show up in the top.\n- Adding custom apps.\n- The sort order, (or at least have the “forced” apps show at the front or end of the frequently ordered apps).\n", "author": "847627933", "created_at": "2018-12-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33667015-customize-navigation-bar", "header": "Customize Navigation bar", "idea_text": "Until just recently you could pin 3 apps to the navigation bar. I just spent about 45 min on line with support trying to figure out why the apps I had pinned there were removed. He finally figured out that this ability has been removed.  I remember seeing it on my portal in the last 2 weeks.  \nPlease bring back this option   In addition,  it would be great to not be limited to 3 apps.  ", "author": "767744764", "created_at": "2018-03-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33243481-onenote-button-default-open-to-list-of-all-noteboo", "header": "OneNote Button Default Open to List of All Notebooks", "idea_text": "Please make the OneNote button on the office.com home page default to open a list of all notebooks available in Office 365, instead of opening one notebook. I sometimes want to find a notebook for a group, and it would be easier to click the OneNote button than going to the group and then to its notebook. Thanks.", "author": "108071772", "created_at": "2018-02-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33252637-office-365-entry-point", "header": "Office 365 entry point", "idea_text": "I find it confusing to find the correct login page for Office 365. Im often at a new computer and just want to type \"office.com\" or serarch for office and the login page should be the first hit. I also often hit the private outlook login page that look identical to 365 and can't login! Also, the login url is over 500 characters long...Please give us a simpler way to login.", "author": "753063628", "created_at": "2018-02-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33398659-add-documents-opened-online-to-recent-online-docum", "header": "Add documents opened online to recent online documents", "idea_text": "When I open a document online via the Web Apps, these documents do not appear in the recent online documents list (at least in Office365 Germany). They only appear when I open them via Office Apps / Programs on my PC.They should also appear in the recent online documents when I open them online.", "author": "757663660", "created_at": "2018-02-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33864199-make-the-version-of-onedrive-desktop-app-on-the-so", "header": "Make the version of OneDrive desktop app on the Software page the latest", "idea_text": "If I try to install the OneDrive desktop app from the Software page at: it gives me the 2013 version, which no longer works well. Make it download the latest version instead.", "author": "774283900", "created_at": "2018-04-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36251200-sync-folder-to-one-drive-for-business-without-make", "header": "Sync folder to One Drive for Business without make a copy or move document to One Drive local folder", "idea_text": "Sync folder to One Drive for Business without make a copy or move document to One Drive local folde", "author": "875081374", "created_at": "2018-12-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35355295-publisher-for-mobile-smartphone-i-like-many-othe", "header": "PUBLISHER FOR MOBILE SMARTPHONE   I like many others paid a yearly subscription expecting Publisher to be available on all my devices.  No w", "idea_text": "PUBLISHER FOR MOBILE SMARTPHONE I like many others paid a yearly subscription expecting Publisher to be available on all my devices. \nNo where in the sale of this package do you state Publisher is NOT available on a mobile smartphone. \nIf I had of known this I would not have brought the yearly package. \nThis is misleading people. \nThis should be boldly stated on the package or told to customers when buying your product. \nVery bad I even asked the sales person when I brought the product they told me it was so vary disappointed. ", "author": "847884922", "created_at": "2018-09-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36252331-print-print-preview-issue-when-upgrading-office-36", "header": "Print/print preview issue when upgrading office 365 V1807 Build 10325.20118 to V1810 Build 11001.20108. Can't print custom range.", "idea_text": "Office 365 version update bug issue. Tech support helped by reverting back to an older version (V1807 Build 10325.20118). Newer version and build still does not resolve the issue.", "author": "875098537", "created_at": "2018-12-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36885508-let-office-365-for-android-open-multiple-files-at", "header": "Let Office 365 for Android open multiple files at the same time.", "idea_text": "Guys, me like many people are spending more time working on our mobile devices in my case i use DEX For the Samgung galaxy note 9 when i work in my office and much more while outside, and it is frustrating that on none of the cases i can work on multiple Excel books at the same time, even with my paid Office 365 subscripion.", "author": "884859403", "created_at": "2019-02-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36885511-let-office-365-for-android-open-multiple-files-at", "header": "Let Office 365 for Android open multiple files at the same time.", "idea_text": "Guys, me like many people are spending more time working on our mobile devices in my case i use DEX For the Samgung galaxy note 9 when i work in my office and much more while outside, and it is frustrating that on none of the cases i can work on multiple Excel books at the same time, even with my paid Office 365 subscripion.", "author": "884859403", "created_at": "2019-02-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36298162-no-microsoft3-0", "header": "no  Microsoft3.0", "idea_text": "", "author": "875894902", "created_at": "2018-12-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36393763-office-com-note-of-issues-merging-to-accounts-mi", "header": "office.com - note of issues merging to accounts.microsoft.com", "idea_text": "after you have merged office.com subscriptions to accounts.microsoft.com there is an issue that on the main page of accounts.microsoft.com a user will see the followingcategory: subscriptionstry out Office 365...despite the account should actually show up the running O365 home / personal subscription or redirect to the subscription page this is highly irritating and should be changed for any account with a valid O365 subscription or a share O365 subscription. If you have any further questions plz reply ot this change request.\n", "author": "422288878", "created_at": "2018-12-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36476305-be-able-to-drop-an-email-onto-the-calendar-and-cre", "header": "Be able to drop an email onto the calendar and create an invite with attendees from the email", "idea_text": "I want to be able to drop an email into the calendar and have all the \"To\" people show up as Required.  All the \"cc\" peole show up as Optional and the body of the email show up in the Body of the Calendar invite.", "author": "878864068", "created_at": "2019-01-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36545371-stop-ms-office-365-from-making-suggestions-this", "header": "Stop MS Office 365 from making suggestions.  This is worse than \"clippy\" because I can't figure out how to stop this nonsense.", "idea_text": "Stop MS Office 365 from making suggestions.  This is worse than \"clippy\" because I can't figure out how to stop this nonsense.", "author": "880248463", "created_at": "2019-01-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36273388-pb-d-activation-des-produits-office-365-sur-win10", "header": "PB d'activation des produits Office 365 sur win10.1809", "idea_text": "Il y a de gros pb d'activation et de connexion réseau sur la derniere version de windows 10.1809\nPour activer un office 365, nous sommes obligé de reinitialiser tous nos postes.\nA quand une solution viable !!!!!!!!!!!!!!!!!!!!", "author": "874252603", "created_at": "2018-12-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36423262-outlook-visual-upgrade-issue-row-width-too-large", "header": "Outlook Visual Upgrade ISSUE: Row width too large now", "idea_text": "The latest OUTLOOK 365 upgrade (Todays date is 1 January 2019) increases the row size.  Unread mails also now have a Solid blue vertical line.  Visually this is very different from before and now you have fewer lines you can view on one screen.  Add in the Grey lines for day separation and you have less and less data on the screen.  Visually is harder to work through your mails. Please provide an option to reduce the size of the row and remove the blue vertical unread line", "author": "877741168", "created_at": "2019-01-01", "votes": 1, "reaction": [], "comments": [{"author": "877741168", "created_at": "2019-01-01", "text": "When sending an email the TO: Fields are way to big and take up too much screen space.  The box has been removed so there is no seperation between TO and BCC.   Please create an option to revert back"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38329441-cloud-access-only-as-an-option-during-the-installa", "header": "Cloud access only as an option during the installation of the office, especially for OneNote", "idea_text": "OneNote used to work on local machines. Now Microsoft is pushing it to be a cloud software. That might work for some users, but it would be good to add it as an option during installation. \nOur documents are on a local server (and they will stay there), in addition, relying on cloud makes OneNote useless while someone doesn't have the Internet access.", "author": "913881526", "created_at": "2019-08-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38181877-bring-back-drop-down-menus-to-office-365", "header": "Bring back drop down menus to Office 365", "idea_text": "Bring back drop down menus to Office 365 on the PC - File, View etc. as it's far easier to find something from a list than the icon ribbon and both could co-exist. Indeed, they still do on the Mac!", "author": "872028853", "created_at": "2019-07-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36685744-office-365-home-page-default-opt-out", "header": "office 365 home page default opt-out", "idea_text": "Road map ID: 45971 says (starting March 2019) you will be redirected to office.com if you log in to another Office 365 service.We have a default customized SharePoint page for our users and want them to start there. Please add an option to opt-out from the default page Office.com.", "author": "373290607", "created_at": "2019-01-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36393787-bug-o365-home-personal-new-subscription-will-sh", "header": "BUG: O365 home / personal new subscription will show wrong expiration date", "idea_text": "after entering a code to renew a subscription the page will check the code and display a end of subscription datethis date is wrong.current\nend of new subscription date = date of issued a new key + 365 dayscorrect\nend of new subscription date = end date of previous subscription + 365 daysthe correct date is only shown in the account details for the subscription, not on the page where you can enter the subscription key e.g. from a boxed package.\n", "author": "422288878", "created_at": "2018-12-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37586884-ive-been-hacked", "header": "Ive been hacked", "idea_text": "Can someone tell me how to access my accoun..a close person had hacked and completely compromised it. I've had tthe account before we became friends.. it goes to my business my credit cards contacts etc..I've tried everything I mean everything.PLEASE PLEASE PLEASE SOMEONE HELP", "author": "899468017", "created_at": "2019-05-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36488791-i-want-to-prevent-breakage-of-excel-in-advance", "header": "I want to prevent breakage of EXCEL in advance", "idea_text": "【phenomenon】\nFile corruption occurs when multiple people collaborate on the EXCEL file listed in the SharePoint library.【Cause】\nWhile multiple people are editing Excel, only part of the character string is changed in one cell.\nEasy to break: Change only the part of sentences, such as text color and bold type.[Workaround]\nWhen multiple people are editing at the same time, do not do some formatting work. (Simultaneous editing is limited to work in the scope that can be done with ExcelOnline)\nPartial format change is done by one person. (It can be surely done by downloading to the client PC)\nIf the file is corrupted, try to repair the file on the client PC.【Task】\nIt is too redundant to force the above operation, so please do the following measures.\n· The above operation also works without problems.\n· Issue a warning during operation.", "author": "879103987", "created_at": "2019-01-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37553002-login-live-com-login-microsoftonline-com-sign-in", "header": "login.live.com & login.microsoftonline.com Sign In Page improvement", "idea_text": "it's really confusing for user to use @(Microsoft Windows Live ID) or @(O365 Business ID)the reason is because \nwhen page to login.live.com or login.microsoftonline.com, it's the same background, therefore, objective sometimes might be confusing for what's the account should I use,for personal use and business use, I think it's better to distinguish the sign in portal background more meaningful ", "author": "898764202", "created_at": "2019-05-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37607956-delay-sending-emails-on-browser-outlook", "header": "Delay sending emails on browser outlook", "idea_text": "Even if the Outlook programm does have this option, Outlook on the browser does not. I recommend to put on the send button a little option to schedule the delivery of an specific email. (Gmail just made this change and it´s very simple) \nMost people answer emails at night or need to answer after sometime, it would be better if we have the option to be delivered at a specific time.", "author": "899662612", "created_at": "2019-05-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37632169-ticket-no-13967108-training-videos-should-be-avai", "header": "Ticket No 13967108  Training videos should be available to USERS from this page not just to admins fro m the admin  page", "idea_text": "It would be useful to make the link to the users training videos available here rather than just from the ADMIN page? ", "author": "853075912", "created_at": "2019-05-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37505905-possible-typo-error-at-web-help-page-of-chisq-inv", "header": "Possible typo error at Web help page of CHISQ.INV", "idea_text": "It seems Excel function help page on Web () shows incorrect result 5.318520074 instead of 3.283020287 for the formula =CHISQ.INV(0.93,1). Though the result 5.318520074 would be correct for CHISQ.INV(0.93,2).\nI am sorry if I am posting at the incorrect site for such subject. Thank you for your attention.", "author": "897609175", "created_at": "2019-04-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37701229-provide-an-option-to-stay-permanently-logged-in-wi", "header": "Provide an option to stay permanently logged in with  Outlook 365", "idea_text": "stop outlook 365 repeatedly logging me out. I will decide if and when I should do so. ", "author": "901546303", "created_at": "2019-05-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38557600-program-in-office-365-only-open-on-current-tab-not", "header": "program in office 365 only open on current tab not opening on new tab", "idea_text": "Used to be able to open app from 365 portal to a new tab but now it only open on the same page.", "author": "919068400", "created_at": "2019-09-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38562139-dark-mode-for-office-com-on-safari", "header": "Dark mode for office.com on Safari", "idea_text": "The dark mode on office.com seems broken. Check the attached image for more details.\nNote: I am using Safari", "author": "919138330", "created_at": "2019-09-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38664685-two-dark-mode-bugs-no-means-to-enable-dark-mode", "header": "Two dark mode bugs; no means to enable dark mode.", "idea_text": "Bug: (1) Outlook 365 page does not use darker colors when \"dark mode\" is \"on\" using the \"Quick settings\" menu.  (2) A dark mode widget is presented in the \"All Outlook settings > General > Appearance\" menu but the widget does not respond to the mouse click events.  Both these bugs are present when using either Microsoft Edge Beta and Chome.", "author": "921287803", "created_at": "2019-09-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/38689897-password-strength-indicator", "header": "password strength indicator", "idea_text": "Please add the password strength indicator and the password requirements info on all O365 products login pages so that the users know if the password meets the requirements when they type it in the field during the initial account setup or password change process.", "author": "857072332", "created_at": "2019-09-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/20160058-possibly-inaccuracy-in-office-365-business-pricing", "header": "Possibly Inaccuracy in Office 365 Business Pricing Page", "idea_text": "One of the bullet points described here:   states that \"web versions of Outlook\" are included in Office 365 Business.  Unfortunately, upon purchasing, there does not appear to be a web version of Outlook included.  A call to support confirms that, contrary to the Microsoft Outlook pricing website, there is no web version of Outlook included in Office 365 Business.  Recommendation: revise the 365 Business Pricing Page to reflect that the web version of Outlook is not included.  Thank you.", "author": "417733435", "created_at": "2017-07-18", "votes": 2, "reaction": [], "comments": [{"author": "404919280", "created_at": "2017-08-19", "text": "Please read \n"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/31106110-fix-issue-with-intermittent-failure-to-load-login", "header": "Fix issue with intermittent failure to load login credentials from iCloud KeyChain on Safari", "idea_text": "The new Office login page often does not allow Safari to auto-load credentials from the KeyChain. The little key drop-down is there in the (blank) password field, but no credentials are available to select as opposed to there always being such on the previous (old) login page. Solution is to either always use the old login page until forced to move to new, or revert to old, to retrieve credentials and then change back to new. ", "author": "659836843", "created_at": "2017-08-30", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32062153-powerapps-on-edge", "header": "powerapps on edge", "idea_text": "doesn't load on edge", "author": "692724496", "created_at": "2017-10-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32213794-bring-back-auto-selection-of-items-subject-fro", "header": "Bring back auto selection of items \"Subject\", \"From\", \"Keyword\" in Outlook search box", "idea_text": "The current version of Outlook in Office 365 and 2016 has removed a very powerful function that was available in Office 2013 Outlook.  When you typed in the search box in Outlook, three options appeared that allowed you to select \"Subject\", \"From\", or \"Keyword\". When pressing the arrow down, the options appeared again in case you didn't chose them before. This made search very efficient.  The latest version of Outlook in Office 365 removed this feature. Now, every time you want to search on a subject, you need to write: Subject:(xxxx).  Please bring back the feature.", "author": "708382291", "created_at": "2017-11-10", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32101741-option-to-note-what-machine-office-is-installed-on", "header": "Option to Note what machine Office is installed on", "idea_text": "Instead of just a cryptic list of office 2016 licenses, or whatever version, There should be an option to Create a Note, or select a Dropdown that notes what machine it is installed on.This way you aren't trying to remember when you purchased office and what machine it was for, Instead you put \"Stacy Laptop\" or something in the notes, this way unintentionally installing the same office copy on 2 pcs can be easily avoided, vs right now I try to remember if I was down to the third or fourth install on the list. Months later there is no way of remembering which licenses are used or not without going back to each machine.", "author": "703419214", "created_at": "2017-11-01", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35810422-align-languages-throughout-the-product-suite", "header": "Align languages throughout the product suite", "idea_text": "There is good language support in some of the Office 365 suite such as SharePoint. But the Office.com interface and other features this doesn't have the same options. For example Welsh, is only shown partially on some of the Office 365 interfaces.", "author": "293929690", "created_at": "2018-10-24", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35962345-menu-with-drop-down-in-the-ribbon", "header": "Menu with drop down in the ribbon", "idea_text": "Menu with drop down in the ribbon of Home page in Office 365, just to connect all websites, SharePoint sites, OneDrive, Teams, Planer, People, Gorups...etc.   Prt.Sc. ", "author": "867460654", "created_at": "2018-11-08", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35893501-attach-an-image-when-configuring-the-mail-signatur", "header": "ATTACH AN IMAGE WHEN CONFIGURING THE MAIL SIGNATURE", "idea_text": "Please Allow To Attach An Image When Configuring Mail Signature", "author": "865136143", "created_at": "2018-11-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36620866-provide-setting-to-disable-autosave-at-the-desktop", "header": "Provide setting to disable Autosave at the desktop and mobile versions", "idea_text": "The default autosave setting can destroy a spreadsheet if you open a complex one, do some modifications for test and realize that autosave has overwritten your file with a useless version. It should have a global setting that will turn this feature off to all files. The option of changing registry entries is ridiculous to ask to a normal user to do and it will not work on an iPad or other mobile platform at all", "author": "881350159", "created_at": "2019-01-24", "votes": 2, "reaction": [], "comments": [{"author": "904049562", "created_at": "2019-06-03", "text": "Yes, please disable the Auto Save, it is incredibly dangerous, as well as annoying.\n"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36822382-show-additional-security-verification-settings-f", "header": "Show 'Additional security verification' settings for users with Azure MFA setup", "idea_text": "Show 'Additional security verification' settings for users with Azure MFA setup because currently it only shows if you have a O365 MFA setup", "author": "883901680", "created_at": "2019-02-11", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37177882-change-description-of-you-recently-opened-this-i", "header": "Change description of \"You recently opened this\" in the Recommended section", "idea_text": "When a user browses search results, viewing a file's thumbnail will access the file. These files will then appear under the \"Recommended\" section as a file opened by the user, causing confusion.Example: \"You recently opened this, Mon at 1:34 PM\"I would suggest removing this information or at least describe it as an item that appeared in a search result.", "author": "418407295", "created_at": "2019-03-22", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37294627-make-a-default-option-never-under-your-event-rem", "header": "Make a default option \"Never\" under your event reminders in Outlook settings online.", "idea_text": "When using the web version of Outlook, creating an event will include the default reminder. There is no \"never\" option in settings, so every event you create online you have to edit it later with the desktop edition in order to remove the annoying reminder.", "author": "892502410", "created_at": "2019-04-04", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/14891673-date-format-should-be-localised-based", "header": "Date format should be localised based", "idea_text": "Date format should be localised.  Especially for subscription expiration information.", "author": "179015601", "created_at": "2016-06-21", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37197655-include-never-as-option-for-default-reminder-in", "header": "Include \"never\" as option for default reminder in Calendar", "idea_text": "Include option to select \"never\" as a Calendar reminder. When adding a new event in Calendar the default time for notification in settings starts at \"immediately\". When creating an event it is possible to select \"never\" as a reminder option, but this can't be set as a default.", "author": "890508556", "created_at": "2019-03-25", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37984396-will-it-be-possible-to-export-entire-office-365-em", "header": "Will it be possible to Export entire office 365 emails to local from online?", "idea_text": "How to Export Microsoft Office 365 email database to local machine?\nWill it be possible for users that they would be able to take their database to local machine desktop/laptop into possible format like .eml .pst .ost or .mbox these are well known propritary format extensions and almost IT users have unknowledge about these format. Purpose - is to take email data base to local machine and can easily access email database on any email client like Outlook, thunderbird eudora etc.Trusted Microsoft OST to PST converter Software for more than 43000 Download and recommended by users.Download Best OST to PST Converter Software, This is one of the best program to Convert OST file to PST format. ", "author": "908133919", "created_at": "2019-06-21", "votes": 2, "reaction": [], "comments": [{"author": "907858645", "created_at": "2019-06-27", "text": "Thank this OST to PST Converter, I had recover our 63000 email in few steps. Download - \n"}, {"author": "908611234", "created_at": "2019-06-26", "text": "I suggest you this best program to export ost emails to pst format.Export OST emails to Outlook PST email format with Software Imperial Microsoft OST to PST Converter Software. Export OST emails to Office 365 account, Export OST to EML, MSG, PSD, MBOX, Zimbra, NSF-IBM Lotus Notes, HTML, DOC, MHT, XPS etc. Export ost email database directly to Gmail, Thunderbird, Spicebird, Pocomail, Apple mail, Eudora, Exchange Server, and Entourage etc."}, {"author": "908611234", "created_at": "2019-06-26", "text": "I recommend you to try this trusted Microsoft OST to PST Converter Software here is the source you can visit and download the Converter program: \nExport OST emails to Outlook PST email format with Software Imperial Microsoft OST to PST Converter Software. Export OST emails to Office 365 account, Export OST to EML, MSG, PSD, MBOX, Zimbra, NSF-IBM Lotus Notes, HTML, DOC, MHT, XPS etc. Export ost email database directly to Gmail, Thunderbird, Spicebird, Pocomail, Apple mail, Eudora, Exchange Server, and Entourage etc."}, {"author": "908133919", "created_at": "2019-06-26", "text": "Download SoftwareImperial Best OST to PST Converter Software, This is one of the best program to Convert OST file to PST format.OST to PST Converter by Software imperial is verified by MicrosoftI suggest you to install only verified publisher program.Do not install any not verified unknown publisher program that might cause Problem to your system."}, {"author": "886873918", "created_at": "2019-06-25", "text": "Download and Install Ignissta OST to PST Converter. You can convert Large Ost file as well. This software also supports multi file conversion such as OST File to office 365, OST to MSG, OST to MBOX, OST to EML.While OST to PST Conversion you can Apply Filter and You can Also Split PST File According to Size....!Download and install \n"}, {"author": "908133919", "created_at": "2019-06-24", "text": "You can download a Most Trusted Microsoft OST to PST Converter Software."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33353425-app-launcher-functionality", "header": "App Launcher functionality", "idea_text": "I logged into my O365 instance this morning to see that my App Launcher had changed. It was odd because the O365 main page had been updated to have the Gallery look, however, the App Launcher still had the classic white on gray tiled look.  I didn't realize that at some point the App Launcher would get the Gallery look too.  Now, all of the icons we did for our tiles for our apps which were white (light gray) to match that classic style...are basically invisible.  Okay, fine, we can live with recreating icons to use with the new look...however, I also find that the simple functionality of being able to rearrange the icons is now lost, the resize is lost and the ability to unpin MS apps is also lost.  Isn't it enough that the main O365 page doesn't give you the ability to better manage the icons there...that now you had to go and remove that functionality from the App Launcher.  LOL...like, that couldn't have been a designer's idea...that must have been marketing's idea or something...\"Let's not let them unpin any MS apps from the App Launcher...and relegate their app tiles to the bottom.\".  Alright, so, to try to be at least somewhat constructive here...let me restart with these ideas.  1)  The ability to pin and unpin ANY of the app tiles in the App Launcher.  2) The ability to drag and drop the app \"tiles\" so that I can re-arrange them how I want them.", "author": "756779026", "created_at": "2018-02-16", "votes": 4, "reaction": [], "comments": [{"author": "881071819", "created_at": "2019-01-29", "text": "Please cast your votes here, I've noticed a lot of varying splintered requests on this. Lets keep it cohesive and focused...."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/20290678-let-users-control-contrast-of-themes", "header": "Let users control CONTRAST of themes", "idea_text": "The inability to change the CONTRAST of the screen makes this a very negative experience. I appreciate that the white space/gray space is meant to be \"light\" but some people with vision challenges need to be able to see darker shading - in mail, for instance, it's like looking at a blindingly white screen with light gray text. I would like the ability to select a theme that gives more contrast -- darker text, darker gray, but keep white, white. I can't just adjust the brightness of the screen because it doesn't change the CONTRAST of the screen elements. I'm not angry, just using all caps to emphasize the issue -- it's not that I want all dark colors, its a CONTRAST issue. And, BTW, I am a UX/UI specialist... Thanks for letting me provide my experience feedback.", "author": "422414719", "created_at": "2017-07-25", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/32111347-ability-to-configure-will-documents-open-by-defaul", "header": "Ability to configure will documents open by default in read mode or edit mode (office online)", "idea_text": "When opening documents from sp liba, you should be able to configure what is the default opening behaviour (read or edit). For example cover pages do not work when document is openened in edit mode.", "author": "703764145", "created_at": "2017-11-02", "votes": 4, "reaction": [], "comments": [{"author": "825729430", "created_at": "2018-07-20", "text": "There are a few other ideas already posted in other categories pertaining to this same topic. I've created a new idea in the general category where I'm hoping we can pool votes. Please vote here --> "}, {"author": "820869928", "created_at": "2018-07-05", "text": "Our organization urgently needs the default behavior to be configurable. With documents now opening in Edit mode by default, we now have a scenario where documents are being accidentally modified. In some cases, document links that are shared via email to whole departments end up with many users \"editing\" the document when the intention is only for them to read it. This significantly increases the chance of someone accidentally changing the document. This is causing major document integrity issues and impacting our organizations productivity. "}, {"author": "806797699", "created_at": "2018-06-14", "text": "I'm totally agree with this proposition. After last changing default opening mode documents. Default edit mode is for us not acceptable. "}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/33415078-app-launcher-and-default-o365-start-page", "header": "App Launcher and default O365 start page", "idea_text": "In both the App Launcher and the default 0365 start page:\n1- allow the user to pin or unpin ANY of the applications, whether they are an O365 apps like Word, Excel, Delve...or an internal business applications that a Tile has been made for\n2- allow the user to re-arrange the apps in whatever order they wish\n3- do no automatically add apps by default based on users usage to either the App Launcher or start page\n4- Allow Admin to preset the available apps that show for a user so that Admin can dictate what the start page and/or the App Launcher looks like for users or Groups of users. For companies that want their users to have control, they don't need to use this, for companies that want to deliver a particular experience, they can use this.\n5- For the above, when creating new Tiles, allow the Tile to be available for either the App Launcher or start page or both.\n6-When creating a Tile, provide the ability to upload an image with the other options there instead of needing to providing the URL to the image.\n7-allow Tile image formats to be png, jpg, gif, bmp.\n8-provide the recommend 50px by 50px dimensions of the image for a Tile in helper text.  If a user does not conform to that, resize the image automatically to that.", "author": "756779026", "created_at": "2018-02-22", "votes": 4, "reaction": [], "comments": [{"author": "768650959", "created_at": "2018-03-20", "text": "Under the Start Page settings, it would be nice to be able to set the default to a custom app."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/35618902-change-landing-page-for-portal-office-com", "header": "Change landing page for portal.office.com", "idea_text": "We want to select specific users/groups to land on a specific SharePoint site when they log in to portal.office.com", "author": "855087823", "created_at": "2018-10-03", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/34955686-when-installing-office-please-give-us-back-the-fre", "header": "When installing Office please give us back the freedom to choose the installation location! (not on my small SSD disk C).", "idea_text": "When installing Office please give us back the freedom to choose the installation location! (not on my small fast SSD disk C,but on my large disk D). Alternatively at least let me choose not to install everything!", "author": "827977015", "created_at": "2018-07-28", "votes": 4, "reaction": [], "comments": [{"author": "926600059", "created_at": "2019-09-29", "text": "Very much agreed! I had a small 32 GB SSD with Windows 10 installed and it was full. Could't install Office 365 although over 1 TB left on my D drive."}, {"author": "883919911", "created_at": "2019-02-11", "text": "I have the same issue.  No room on my C: drive but lots on my D: drive.  It's crazy the upgrade to 365 took away the option to choose the installation location."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36929935-get-back-old-icons-of-apps-outlook-word-excel", "header": "Get back old icons of apps (Outlook, Word, Excel, Teams, ...) on Office.com.", "idea_text": "Please, get back old icons of apps on Office.com. New version from February 2019 are good for packaging, not for web. Old version was simple, but modern. ", "author": "855539767", "created_at": "2019-02-22", "votes": 4, "reaction": [], "comments": [{"author": "343251610", "created_at": "2019-05-06", "text": "Pinned to a dark taskbar, using the small icons setting, they look terrible. My users are complaing. An ergonomist visiting our office recently said \"how can they do this?\"."}, {"author": "894889507", "created_at": "2019-04-16", "text": "Seconded.  I understand the new icons are for scaling but visually it feels like a big step back.  I hope the design team get told off as it's not the sort of quality I would expect from a company of Microsoft's size.  Bring back the old design team."}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36393712-please-try-to-block-www-ofice-com", "header": "please try to block www.ofice.com", "idea_text": "when a user misspells  and types in  he will be redirected to a malicious page that is also showing up ads (possible for the good of the owners) but also will show scareware \"your data will be deleted if you do not click here and there\"can you please takeover or shutdown this domain?\n", "author": "422288878", "created_at": "2018-12-29", "votes": 4, "reaction": [], "comments": [{"author": "422288878", "created_at": "2018-12-29", "text": " currently redirects to "}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/15817255-skype-for-business-historical-chat", "header": "Skype for business: Historical chat", "idea_text": "Historical chats of Skype for business are available only in outlook. It will be very useful to view and open old chat in Skype for business client on Windows and on App ( ios and Adnroid). ", "author": "227652409", "created_at": "2016-08-25", "votes": 10, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/16034944-view-public-folders-through-office-365-webmail-pe", "header": "View Public Folders through office 365 webmail, people, directory", "idea_text": "Similar to the Outlook program, office 365 webmail should allow users to open the office 365 webmail, people, directory, public folders, and view all public folders and information within.", "author": "239830240", "created_at": "2016-09-12", "votes": 7, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36959635-change-the-personal-and-work-design-page", "header": "Change the personal and work design page.", "idea_text": "When you're trying to put your credentials to login to the portal, you never know if you're using the Home or business portal since they look exactly the same. The only thing that is different is the URL which not everyone pay attention to.", "author": "325347", "created_at": "2019-02-26", "votes": 9, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/36584641-add-the-most-recent-from-teams-activity-tab-as-a-t", "header": "Add the most recent from Teams Activity tab as a tile / row on Office.com", "idea_text": "I would love if Office.com could give me an overview of all relevant in Office 365. I am missing a link to Teams. Please add a row / tile with the recent Teams notification from the Teams Activity tab. ", "author": "880844977", "created_at": "2019-01-21", "votes": 7, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/37112077-in-modern-user-interface-the-display-picture-in-a", "header": "In Modern User Interface the display picture in a person type column does not display by default.", "idea_text": "To get this working in MUI, additional column formatting is required and field customizer needs to be implemented in case the person type column allows multiple values. For a small clean feature which was available in classic UI, getting the customization done may not make sense.\nAny idea, why this was taken away ? ", "author": "888787063", "created_at": "2019-03-14", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/13713831-owa-language-setting-in-one-place", "header": "OWA Language setting in One place", "idea_text": "We wanted to see OWA in French on an English OS,  We had to change 3 different settings to get it to show French on all screens.  Regional settings, Mailbox settings and IE settings.  Make one setting in either IE or OWA that would work for all screens. ", "author": "96589605", "created_at": "2016-05-03", "votes": 7, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/10626258-make-it-easier-to-get-help-as-i-need-it", "header": "Make it easier to get Help, as I need it.........", "idea_text": "", "author": "120537807", "created_at": "2015-11-10", "votes": 8, "reaction": [{"status": "tell us more", "author": "110757015", "created_at": "2015-12-16", "note": "We would love to hear more specifics around what kind of help you would like to see on the office.com home page. Where are you getting stuck? Feel free to leave comments below."}], "comments": [{"author": "321160120", "created_at": "2019-03-14", "text": "New preview version of Home has changed Help ticket logging in such a was as to be useless. It is totally focused on individual users, it seems, and makes no allowance for Premier Support customers and their extended logging requirements. \nFor example page no longer allows you to select the product meaning (from my experience) tickets being routed to the wrong support team and taking time to move and be reassessed. Also the inability to change the notification mail on the ticket means that admin accounts that are not mail licensed cannot receive mail - but the system still puts that into the ticket and it is not editable. The facility to add additional engineers to the notification on requests has also been removed. All this now needs to be added to notes and can't be saved as a template for future use. \nThink you should take this back to the planners and start again."}, {"author": "248001748", "created_at": "2016-09-19", "text": "There's a tool to assist you setup an outlook account 2010-2016 in less than 30 seconds:Microsoft Support and Recovery Assistant for Office 365 (Used to be SaRA for Outlook but now has more options than just outlook)"}, {"author": "150137475", "created_at": "2016-03-07", "text": "Time to set up a gmail account in Thunderbird: 5 minutes.Time I've spent trying to set up an email account in Outlook 2016: an hour and I STILL haven't made it work.Value of the instructions to do it on your sites:  0"}, {"author": "134333526", "created_at": "2016-01-02", "text": "perfect geholpen super"}, {"author": "133245036", "created_at": "2015-12-28", "text": "I have downloaded the microsoft office products for the first time. I have a password for microsoft office which works fine. The auto uploader on my mac pro wants to load updates however requires a password - all the different passwords seem to be rejected.... which password is needed for this? "}, {"author": "122896221", "created_at": "2015-11-16", "text": "I don't see a 'help' here, and this is where my help button on my excel starter sent me to for help!"}]}
{"url": "https://office365.uservoice.com/forums/325347-office-com-home-page/suggestions/11187384-why-no-ms-access", "header": "Why no MS ACCESS?", "idea_text": "I need MS Access to be available.  Where is it?", "author": "132389736", "created_at": "2015-12-23", "votes": 9, "reaction": [], "comments": [{"author": "886164691", "created_at": "2019-03-19", "text": "very important for mac OS systems.\nnow we are using Filemaker which is more expensive and less friendly."}, {"author": "854193160", "created_at": "2018-09-30", "text": "...Yep you said it Jon. Where is this Software? This is important."}]}
