{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34396720-the-ablity-to-change-the-site-collection-name-for", "header": "The ablity to change the site collection name for SharePoint Online site", "idea_text": "We have a need that we want to revamp our main site collection but we do not want to do this with the existing content but we do want to keep the site collection name and URLCan it be made possible to allow the changing of the site collection name and URLexample\nChange  to ", "author": "790034167", "created_at": "2018-05-30", "votes": 11, "reaction": [], "comments": [{"author": "836419870", "created_at": "2018-08-16", "text": "I second this. I have 2 domains in my Office365 because I opened the account with an old domain, and am now transitioning my company to a new domain. Email, IDs, etc. will all be under the new domain but my SharePoint sites will be olddomain.sharepoint.com. I would be ok with having to migrate the old sites to a new one even, just please provide the ability to create sites with any domain you own. "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32878273-add-job-title-field-to-contacts", "header": "Add 'Job Title' field to contacts", "idea_text": "The currents contact list has no field for customers Job Title. It's essential for us to include this.", "author": "735880789", "created_at": "2018-01-10", "votes": 12, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": [{"author": "797089339", "created_at": "2018-06-06", "text": "Good idea!  Currently, I am appending their name in the Display Name field.  Separating out into its own field would be helpful."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32880289-mass-update-contact-type-after-import", "header": "Mass Update Contact Type after Import", "idea_text": "I am trying to import approximately 11,000 contacts into Business Center from a different email newsletter provider. I can import the list, but after import, the customers do not have an associated \"Contact Type\". Thus, I am unable to send email campaigns unless I update each contact manually. It would be great to be able to include the Contact Type in the import or be able to Mass Update the list after import.", "author": "735958687", "created_at": "2018-01-10", "votes": 13, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": [{"author": "785406187", "created_at": "2018-05-08", "text": "I agree this needs fixing yesterday or a vital opportunity will be lost. Microsoft you have come so far. I love the Business Center, until we tried to test out the Email campaign. Importing contacts from Outlook worked fine, from CSV not so great. But, once they were in the system there was no way to categorize or \"list them\". Metadata is important. Please fix asap before my team goes back to Mail Chimp, CC, or Aweber. "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32338273-multiple-business-profiles", "header": "Multiple Business Profiles", "idea_text": "Just posted something similar specifically to Connections, but for business who have multiple business units under different domains on the same O365 setup, it would be helpful if the entire business Center was segregated as such OR the ability to add an instance of the Business Center into a SharePoint Online Group or Team Site. ", "author": "713283688", "created_at": "2017-11-21", "votes": 14, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32035642-bulk-delete-contacts-in-business-center", "header": "Bulk delete contacts in Business Center", "idea_text": "Bulk delete function. I've noticed there is a delete option available under an individual contact but what if I want to delete 100's or 1000's at a time?\nKevin", "author": "700683370", "created_at": "2017-10-26", "votes": 40, "reaction": [{"status": "working on it", "author": "", "created_at": "2018-01-17", "note": ""}, {"status": "thinking about it", "author": "398985916", "created_at": "2017-10-27", "note": ""}], "comments": [{"author": "876053416", "created_at": "2018-12-18", "text": "A huge let down, BCM worked okayish and displayed everything you needed to all in the same place and readily customisable. You can't  even delete 2 Companies at a time let alone 20, 200 or 2000Why not bring back BCM until they get something that is actually worthwhile? Love the other aspects of 365 other than the way everything is so far embedded / hidden to hinder functionality. Sure I want to share info with guests but too get to that stage....."}, {"author": "829241197", "created_at": "2018-08-03", "text": "its full of bug \nedit contact dont \nimport to csv mailing list dont work \nmoving contact or lead to maing list dont work"}, {"author": "782599558", "created_at": "2018-05-01", "text": "My problem is that I have imported multiple mailing lists, and there are duplicated people across the lists that want to hear from us about different things.  Although I specified 'merge duplicates' when I uploaded them in Business Center, I have up to four records for each individual and no means of going through and merging them into one.  Being able to find/delete duplicates easily would be a great help!  I did find a way of bulk-deleting what's in OCM though reluctant to publicise it here.  Happy to pass on individually though!"}, {"author": "766549282", "created_at": "2018-03-14", "text": "Well I was using this 30 mins before I discovered mt 1450 contacts were accidentally imported and could not be mass deleted; suggests not enough pre launch testing!Poor show Microsoft"}, {"author": "761275165", "created_at": "2018-02-28", "text": "I ended up downgrading from Premium back to Business subscription because of this issue, OCM being the main reason I decided to upgrade.\nAfter importing my contacts from CSV into OCM, it told me there were problems with 6 cards, but didn't tell me which 6 so that was useless as how will I find out which ones I need to re-import?\nThen when I tried to delete the full contacts I realised there is no bulk delete on the portal (a default feature with any other online contacts management system and also Google Contacts!).\nI then thought maybe I need to do it through Outlook, only to realise that Outlook 2016 for Mac doesn't support this feature either.\nNot only you can't delete contacts in bulk, but you can't do anything with your contacts once they are there. No export option and no bulk select to assign categories, etc.\nI think OCM is a premature product that should've stayed under the development bonnet for a little longer until it has enough features that makes it a potential competitors to what's out there."}, {"author": "746893363", "created_at": "2018-01-28", "text": "All they took was some pictures on the wall and a few other minor concerns. But, you never know, It could be a small snapshot in the shape of things to come\n"}, {"author": "746893363", "created_at": "2018-01-28", "text": "Please be advised though , I have itchy neighbors as our neighborhood watch suspects the grounds maintenance personal of petty theft. \n"}, {"author": "746893363", "created_at": "2018-01-28", "text": "Unfortunately my adhd and B/P skillset make remembering codes and passwords a bit more difficult than it is for others. Sorry, if I am too much of a straight shooter. It has gotten me into all kinds of trouble from other people who prefer to not hear such nonsense. But, I am currently looking to provide a card to put into my envelope. So as to  open up lines of communication.I can also accept mail at my home. 28085 Whisperwood Dr. Menifee Ca. 92584, HM# 951-679-93   Seventy*eight.  I had just the right card in the envelope but took it out for a re-write . Cant find it, but I'm looking\n"}, {"author": "735799612", "created_at": "2018-01-20", "text": "I run into the same issue after incorrectly imported some contacts. I have a few hundreds blank contact. When I tried to delete them, i got this message \"Unable to delete contact. You have sent one or more invoices to this contact and are unable to delete them\".I did not create any invoice yet, so I tried to go to Invoice and then got this error message \"Sorry, that didn't work. This issue has been logged, and we are working on it.\"It will be useful if you add an option to either delete or archive invoice so i can delete a contact."}, {"author": "741419872", "created_at": "2018-01-16", "text": "I am in desperate need of deleting in bulk as I uploaded a corrupt file and now have 11,000 incorrect contacts. Help!"}, {"author": "722501041", "created_at": "2017-12-06", "text": "Only added 1400 here, but still not good."}, {"author": "711874855", "created_at": "2017-11-17", "text": "Inadvertently loaded 6,ooo contacts from Google. This would be a might useful tool."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33111730-better-template-editing-capabilities", "header": "Better template editing capabilities", "idea_text": "I would like more template editing for estimates and invoices. I would like longer description capabilities in invoice templates.", "author": "746824606", "created_at": "2018-01-28", "votes": 14, "reaction": [], "comments": [{"author": "761412826", "created_at": "2018-02-28", "text": "The ability to automatically add bank details to an invoice."}, {"author": "398985916", "created_at": "2018-02-27", "text": "Thank you for taking the time to provide Microsoft Office feedback! We are working to improve the product capabilities to edit/customize how invoices and estimates look like when in pdf format. Stay tuned!Your feedback is greatly appreciated.\nThanks, \nTomás Navarro\nOffice 365 Business center team "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33933931-drag-outlook-attachments-directly-to-sharepoint", "header": "Drag Outlook attachments directly to SharePoint", "idea_text": "Please allow us to move an attached word, excel, powerpoint etc file directly from Outlook to SharePoint. Currently, we have to drag the Outlook attachment to our desktop and then drag it into SharePoint. I want it so I don't have to save the attachment to the desktop.", "author": "776507662", "created_at": "2018-04-12", "votes": 16, "reaction": [], "comments": [{"author": "789921137", "created_at": "2018-05-24", "text": "We tend to save to One Drive then copy back which is laborious and is still on line so why not straight to our sites on Sharepoint?"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35667358-black-theme-attachment-icon-color-change", "header": "Black Theme Attachment Icon color change", "idea_text": "The black theme with newly updated icons seems to have an issue with the email attachment icon in the message inbox area.  With a black background and a dark gray icon for the attachment logo, it is near impossible to see the attachment logo.  I'd like to see the attachment icon color changed to white to better visualize when an attachment is present.", "author": "856892863", "created_at": "2018-10-09", "votes": 14, "reaction": [], "comments": [{"author": "873526525", "created_at": "2018-11-30", "text": "Is there a fix in sight? As an option to change the icon colour manually or as Josh suggested, to change it to a brighter icon. I like the black theme and this \"bug\" is annoying."}, {"author": "862798891", "created_at": "2018-10-26", "text": "Basically invisible - this has to be so easy to change to match the @Mention icon or the empty Flag icon color. While you are at it, make the empty Category color the same as the empty Flag color too."}, {"author": "859875487", "created_at": "2018-10-17", "text": "Agreed.  It would also be nice if the boxes next to category were colored to match the color selected when categories are set up."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37311208-make-phone-system-available-for-office-365-busines", "header": "Make phone system available for Office 365 Business Premium", "idea_text": "Currently there is a limitation where we cannot use the phone system add-on on Office 365 Business Premium License. This hinders small business using teams as Phone System solution, if they don't want to upgrade to Office 365 E3 or higher.\nsimply make the add-on available is my suggestion", "author": "173846997", "created_at": "2019-04-07", "votes": 13, "reaction": [], "comments": [{"author": "905049607", "created_at": "2019-09-04", "text": "For SME businesses with a current O365 Business Premium subscription, the price difference when thinking about adding \"phone\" to their Microsoft Teams is too high - today, they first have to upgrade to an Enterprise plan before they can add the phone add-on. Combined, this is a substantial surcharge."}, {"author": "817115323", "created_at": "2019-07-15", "text": "We would definitely use this - we don't have a frequent need to make conference calls either but when we do it would be invaluable.  We'd happily pay the add-on charge for the convenience."}, {"author": "284102630", "created_at": "2019-07-09", "text": "Totally agree. Why wouldn't it be available, it's ideal for micro and small businesses."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/31756405-support-multiple-locations-for-a-business", "header": "Support multiple locations for a business", "idea_text": "Business center looks great but lets say you have a business that owns a couple of locations you cant take advantage of what business center offers for both.\ni.e. Online presence is only available for the initial location when you start using the service. How about the rest of your locations?\nThanks in advance\nKostas", "author": "679317985", "created_at": "2017-10-04", "votes": 17, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2017-10-18", "note": ""}], "comments": [{"author": "772235905", "created_at": "2018-03-30", "text": "I own multiple businesses under one parent company so this feature would be perfect. ESPECIALLY for bookings. I have three different companies which I need a combined booking and calendar for. "}, {"author": "737108929", "created_at": "2018-01-12", "text": "Yes, this is a much needed feature. Thanks!"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33481222-delete-unnecessary-sites-from-frequent-sites-site", "header": "Delete unnecessary sites from Frequent Sites site collection list on SharePoint", "idea_text": "I want a clean, efficient interface for my company. I cannot have that clean efficient interface, if Microsoft keeps putting SharePoint sites in the frequent sites list, even though those sites are empty & have already been deleted. If I've deleted a site, I want it to disappear, but it still show up in the list of Frequent sites. I should at least have the option of \"hiding\" a site. As it is, you are in a situation where you delete a site but the site is never fully deleted. It's horrible user interface design.", "author": "761406139", "created_at": "2018-02-28", "votes": 22, "reaction": [], "comments": [{"author": "873386203", "created_at": "2018-12-28", "text": "Hi,Regarding to \"The deleted site is still showing up under Frequent sites section\". It is a known issue. The related team is currently in the process of implementing tech, they will ensure consistency for affected tenants.If you are global admin or SharePoint admin in your tenant, you may firstly try the following steps which works for some users:1. Install and connect to SharePoint Online PowerShell.2. Use Get-SPOSite command to see if it's in the list. If not, go to step 3. If yes, use Get-SPOSite -identity <site URL> | fl to check the lock state of the site. If it's locked, use Set-SPOSite -Identity <yourtenant>.sharepoint.com/sites/<sitename> -LockState Unlock to unlock it, and then Remove-SPOSite>Remove-SPODeletedSite.3. Use Get-SPODeletedSite command to see if the site is still in the list.4. If it is still listed, use Remove-SPODeletedSite command to remove the site.5. Wait for 24 hours to see the outcome.Please share the result when you have time.Regards,"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32313061-sync-with-outlook-contacts-manager", "header": "Sync with Outlook Contacts Manager", "idea_text": "The lead/customer field is obviously a key one, though it would be better if it had more options as already suggested. The thing I don't get though is why this field does not seem to be available in Outlook Customer Manager, which also comes with my Business Premium account. Surely, the two should sync seamlessly?", "author": "711931657", "created_at": "2017-11-19", "votes": 11, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2018-01-17", "note": "Contacts currently sync between Outlook Customer Manager and Business center.Is there additional data you want synced?"}], "comments": [{"author": "915659278", "created_at": "2019-08-22", "text": "Customers/Contacts from OCM do not sync to Microsoft Invoicing..."}, {"author": "903807685", "created_at": "2019-05-31", "text": "I am not sure this is related, but the inability of my Office 365 Outlook to not have the same contacts as from the Outlook on my PC is mashugana.  (Look it up!)Outlook in Office 365 needs to have the same or better functionality as from the PC or it is worthless.  If frustrations like this continue, not only for me, but for other customers, you can kiss your attempt at getting customers on the cloud as failed.  We are already considering move to another solution."}, {"author": "754909780", "created_at": "2018-02-12", "text": "It currently should sync, but does not. I have 1500 contacts in OCM and 3600 in Business Centre and cannot get them in sync"}, {"author": "711931657", "created_at": "2018-01-30", "text": "The standard contact details sync but the lead/customer field does not sync. It should!"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33297679-please-allow-onedrive-for-mac-to-have-files-on-dem", "header": "Please allow OneDrive for Mac to have Files On Demand.", "idea_text": "Please allow OneDrive for Mac to have Files On Demand.", "author": "754778173", "created_at": "2018-02-12", "votes": 24, "reaction": [], "comments": [{"author": "858510289", "created_at": "2018-10-15", "text": "MAC - Files on Demand is now available in preview.\nCheck out Office365-Updates: Going to try it...."}, {"author": "828435298", "created_at": "2018-09-25", "text": "Done today in beta but only for Mojave. Hey Microsoft, 85% of Mac user are on Sierra or High Sierra"}, {"author": "850948021", "created_at": "2018-09-17", "text": "This for me would be like breathing!!: ) \nCannot understand how there are only 20 votes!!\nthanks!"}, {"author": "825267127", "created_at": "2018-07-19", "text": "Urgently needed "}, {"author": "825266017", "created_at": "2018-07-19", "text": "Nices Zeug"}, {"author": "825266017", "created_at": "2018-07-19", "text": "Mega nices Zeug"}, {"author": "792935785", "created_at": "2018-07-19", "text": "need this really urgent"}, {"author": "825265552", "created_at": "2018-07-19", "text": "Beste funktion!"}, {"author": "825266017", "created_at": "2018-07-19", "text": "Hurry up"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32888035-outlook-customer-manager-for-mac-and-web-browsers", "header": "Outlook Customer Manager for mac and web browsers", "idea_text": "I purchased Office 365 Business Premium subscription to use the Outlook Customer Manager feature.  The product infor page:  is quite misleading.  It does not share that OCM for Mac and OCM in Office 365 online have only limited features.\n Please add remaining features to at least one of these platforms as soon as possible.", "author": "736185190", "created_at": "2018-01-10", "votes": 25, "reaction": [], "comments": [{"author": "899329588", "created_at": "2019-05-08", "text": "Can't understand why there are limited features for Mac users. Price for Mac an Windows is the same so should the functions!"}, {"author": "824997646", "created_at": "2018-07-18", "text": "I am also not happy with the OCM release to certain media formats.  It's very confusing and makes me think I should buy something else to get the features I need.  "}, {"author": "821009980", "created_at": "2018-07-06", "text": "I do absolutely agree with your argument here.Esp. since:\n- Microsoft let Europe out of the game entirely (maybe forever)\n- Even though the Business-Center still is an integral part of the signup-process\n- The OCM has always been half-baked and might now even die\n- It even is no longer listed in the apps section of office.com\n- Why? Well If I'm not misled by Microsoft (would be no surprise), the myAdmin or whatever it is called might replace CMO in the near future\n- Maybe you guys can help to get some transparency out of Microsoft?"}, {"author": "784416145", "created_at": "2018-05-06", "text": "Hi. I also want to understand better about the CMO. Are the features satisfactory?"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32582698-outlook-customer-manager-speed-up-developing", "header": "Outlook Customer Manager - speed up developing", "idea_text": "For a year we have been looking forward to Outlook Customer Manager. We switched to Ofiice 365 Business Premium solution in order to use the CRM system following up on Outlook Business Manager.  But still it is not working. We cannot export our own business contacts - have tried support for 2 month. Please speed up developing process, thanks Via Media.dk ", "author": "175624659", "created_at": "2017-12-11", "votes": 15, "reaction": [{"status": "feedback taken", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": [{"author": "826427248", "created_at": "2018-10-02", "text": "Hi. Please also work on contacts sometimes missing and contact that have triangle on it and cannot send email to it "}, {"author": "752076508", "created_at": "2018-02-06", "text": "There has been an issue with Outlook 2016 cannot save all attachments to local computer or network. It is reported under:   It was reported on Dec 27 and as of today Feb 2, 2018 and no solutions provided yet. "}, {"author": "750149608", "created_at": "2018-02-02", "text": "Configuration of Domäne\nRoute Alias of Domain to IP with different PortsExample:elektronik-hannes.de:80 -> 123.123.123.123:80\ntest.elektronik-hannes.de:80 -> 123.123.123.123:44"}, {"author": "722405248", "created_at": "2018-01-19", "text": "You may want to use SharePoint Lists for your Customer Management. Take a look at this post for ideas: "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35319988-outlook-365-not-able-to-add-new-connected-account", "header": "outlook 365 not able to add new connected account. Please don't remove the option of connectign new accounts.", "idea_text": "outlook 365 not able to add new connected account. Please don't remove the option of connecting new accounts.", "author": "846772591", "created_at": "2018-09-04", "votes": 26, "reaction": [], "comments": [{"author": "886159339", "created_at": "2019-02-27", "text": "Son ststo 8 mesi per riuscire a farlo, ovvero i tecnici ms son stati 8 mesi per risolver il problema: alla fine il problema era che tale funzionalità era disponibile su un datacenter ma non su un altro, per cui quando lo facevo per un utente funzionava e per un altro no."}, {"author": "881832121", "created_at": "2019-01-28", "text": "We were using the Connected Accounts feature to retrieve voice mail messages for users that are away from their desk for long periods of time. Now that the feature is gone, we have to use the Mail app on iOS devices to retrieve the messages. We can't use the mail app on Android, because the voice mail server does not respond correctly for it to complete the account setup, so those users are out of luck. Our only other option is to spend A LOT of money on upgrading our phone system. Please replace this feature with something that can retrieve these voice mail messages!"}, {"author": "880723001", "created_at": "2019-01-20", "text": "La scelta di togliere questa funzione è a mio avviso infelice, era una delle funzioni migliori e che rendeva il prodotto appetibile."}, {"author": "871958758", "created_at": "2018-11-20", "text": "The connected accounts feature helps us, as Microsoft partners, transition those clients that are stuck using personal accounts such as @yahoo and @aol.com accounts.  We are able to leverage this technology to smoothly transition these clients into O365.  This was provided Microsoft with extra seats being sold.  With removing this feature, you have our hands tied and we are struggling to find another solution.  We may have to check the available services over on Google. I believe they still have connected accounts available.The removal of this seeks extremely backwards and looking at this with a narrow vision.  Look at the big picture!!!   There are advantages to keeping this service."}, {"author": "864697117", "created_at": "2018-10-31", "text": "Why are you going backwards?  I began using Outlook many, many years ago and was ecstatic when Office 365 was announced and began using it immediately.  Finally, everything I needed in one place, anywhere!  Now, I am pretty much back to where I was before Office 365.  I have multiple email accounts, including several AOL accounts, that I need to use in one application.  AOL does NOT support forwarding so there is no way to receive my AOL email through Office 365 without the connected accounts.  I can add all my email accounts to my desktop Outlook on ALL of my computers and ALL of my devices, which is very time consuming, but that still doesn't give me web based access anywhere.  It also makes my desktop Outlook more cluttered and confusing to keep it all organized.  Please revive the connected accounts option or add a new way to add accounts.  Don't punish your users for choosing Microsoft instead of another provider."}, {"author": "855070849", "created_at": "2018-10-03", "text": "We currently think of going away from office 365 because this feature will be not supported in the future. We really would appreciate that this decisonwill be withdrawn.\n"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33474055-recurring-appointments-in-microsoft-bookings", "header": "Recurring Appointments in Microsoft Bookings", "idea_text": "add an option to appointments that sets up a recurring booking in Microsoft Office 365 Bookings. For example: appointment from 3-4pm on every Mon/Thu till 6/1/18.  ", "author": "761180251", "created_at": "2018-02-27", "votes": 25, "reaction": [], "comments": [{"author": "864217105", "created_at": "2018-10-30", "text": "I am surprised that this request has only got 6 votes.  12 months ago I voted for the exact same request and the votes were way higher.  Has Microsoft reset the counter?"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32030236-more-flexible-customer-segregation", "header": "More flexible customer segregation", "idea_text": "Contact types is limited to Customer and Lead... most will need to be able to segregate people into more groups so allow other values to be created. \nA separate multi-value custom field would be useful too to capture other attributes (possibly filtered by contact type field).", "author": "700491799", "created_at": "2017-10-26", "votes": 14, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2017-10-27", "note": ""}], "comments": [{"author": "722405248", "created_at": "2018-01-19", "text": "You may want to think about using SharePoint Lists for this purpose.  Here is a link for further ideas.\n."}, {"author": "700491799", "created_at": "2017-10-27", "text": "link to "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34862554-edit-business-center-contacts", "header": "Edit Business Center contacts", "idea_text": "When trying to edit a contact in Business Center, you are given a screen that shows \"No Name\" and a blank contact. You are then able to type in all of the information and \"save\" but the changes are not saved. ", "author": "785492380", "created_at": "2018-07-18", "votes": 19, "reaction": [], "comments": [{"author": "673597375", "created_at": "2018-08-08", "text": "This seems to work fine now. Anyone else able to confirm?"}, {"author": "831962989", "created_at": "2018-08-08", "text": "Yes, In the Business Center Contacts - The edit contacts feature does not work. This is not acceptable when you are trying to run a business and build your contact list of clients. Please fix this right away!! It needs to be a priority.Thank you."}, {"author": "831323365", "created_at": "2018-08-07", "text": "This needs to be fixed right away!"}, {"author": "829241197", "created_at": "2018-08-03", "text": "\nedit contact dont workimport to csv mailing list dont work \nmoving contact or lead to maing list dont work"}, {"author": "786431038", "created_at": "2018-08-01", "text": "its a Bug"}, {"author": "827206978", "created_at": "2018-07-29", "text": "I feel like this should be expedited as this is considered \"loss of functionality\" with the product.  "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38032378-why-amex-card-is-not-allowed-for-payment-methods-i", "header": "Why Amex card is not allowed for Payment methods in India??", "idea_text": "Why Amex card is not allowed for Payment methods in India??", "author": "908874619", "created_at": "2019-06-28", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/20042779-please-create-a-connector-for-quickbooks-online", "header": "Please create a connector for QuickBooks Online", "idea_text": "", "author": "412356742", "created_at": "2017-07-11", "votes": 5, "reaction": [{"status": "tell us more", "author": "", "created_at": "2017-08-29", "note": ""}], "comments": [{"author": "398985916", "created_at": "2017-08-29", "text": "Hi there, do you mean a connector that will import your contacts from QuickBooks? Assuming yes, we will consider this. Thank you!If that's not what you were suggesting, we should clarify here that Microsoft Connections is only meant to help you with Email Marketing. We have another app (Microsoft Invoicing) which would be more along the lines of what QuickBooks can do."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33301660-export-mailing-lists-from-business-center", "header": "Export mailing lists from Business Center", "idea_text": "There is the ability to import contacts from csv but no way of getting them back out. An export needs to identify which mailing list the contacts belong to.\nThe managing of multiple mailing lists is near impossible. Need to be able to upload directly to a list not to the contacts and then have to find each one to add to a list. Not ideal.", "author": "754909780", "created_at": "2018-02-12", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33209500-was-business-center-a-good-idea-that-has-already-b", "header": "Was Business Center a good idea that has already been forgotten?", "idea_text": "It is noticeable that responses to feedback here and under related topics are slow or non-existent and that there have been no real improvements in Business Center functionality. We upgraded O365 to use Business Center but it is proving a waste of money as the capabilities are too immature/flaky. Has Microsoft given up on this already? ", "author": "711931657", "created_at": "2018-02-05", "votes": 5, "reaction": [], "comments": [{"author": "759557701", "created_at": "2018-02-23", "text": "I would be very interested in a Microsoft response to this question."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33636121-sharepoint-email-branding", "header": "Sharepoint Email Branding", "idea_text": "Sharepoint needs to have the ability to BRAND the share link email with a Corporate Logo so that users receiving the file see the Corporate branding or Company logo.  This day and age with all security flaws, users need to know where it is being sent from. I tried to upload my company logo and it only allows text. The logo should automatically pull from the Site home page. Thank you.", "author": "766731115", "created_at": "2018-03-14", "votes": 5, "reaction": [], "comments": [{"author": "795457069", "created_at": "2018-06-04", "text": "Yes, we desperately need this feature as well.  We're sharing Office 365 Group folders with clients and they need to see our logo on the invitations, not Microsoft's.  Thanks."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33581920-in-invoicing-more-text-for-the-description-of-the", "header": "In Invoicing more text for the description of the service provided", "idea_text": "As a company providing a service in the description box we require more text as we have to provide a full description of the service that was provided and this can take up to at least six lines of the existing description boxes as we are not a company who sell for examples taps, baths etc.", "author": "764826100", "created_at": "2018-03-09", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33279436-connections-improve-editability-of-templates-e-g", "header": "Connections - improve editability of templates e.g. not being forced to have a social media section in each mailing", "idea_text": "Signed up for trial to look at Connections for sending newsletters - seems a distinct lack of customization available compared to competing servicesE.g. I don't use social media so want to remove that panel from any newsletter I create, but I can't as it seem that you have to include it - same for referral and announcement templates", "author": "754073329", "created_at": "2018-02-10", "votes": 5, "reaction": [], "comments": [{"author": "754909780", "created_at": "2018-02-19", "text": "Agree we need more customization options.\nBut on the social media point, if you simply don't have any entries in the section settings it is not included in the final sent version. Use the send me a preview option next to send campaign to view final draft."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34079701-it-is-important-that-i-have-the-ability-to-merge-d", "header": "It is important that I have the ability to merge duplicate contacts into one contact.  I currently am unable to do this.", "idea_text": "Merge duplicate contacts", "author": "781223830", "created_at": "2018-04-26", "votes": 6, "reaction": [], "comments": [{"author": "878843887", "created_at": "2019-01-08", "text": "the reason Microsoft merge/ don't import duplicates doesn't work it's probably because you can find 100+ vendors selling tools to do that. Just look into gmail, simple and easy merge tool. Web based."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37082479-search-in-current-mailbox-and-subfolders-is-no", "header": "Search in \"Current Mailbox\" and \"Subfolders\" is not possible in Shared Outlook mailbox", "idea_text": "Search in \"Current Mailbox\" and \"Subfolders\" is not possible in Shared Outlook mailbox. Whenever user is trying to use function \"Find related->Messages in this Conversation\", such messages cannot be found, because Outlook is searching only in current folder, but not in current mailbox or subfolders. Function to search in shared mailbox through all subfolders is very useful when working in teams and using shared mailbox.", "author": "888305683", "created_at": "2019-03-12", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36015130-ribbon-icons-to-have-a-choice-of-style-colour-th", "header": "Ribbon icons to have a choice of style colour & theme", "idea_text": "Many people have problems with their eyes, especially if staring at a computers 24 hours a day, which is just a fact of modern working life. Therefore we all have different needs with regards the visual effect of viewing our computers all day. I cant believe that one persons idea of how the ribbon icons should now appear, would ever suit the whole Office 365 population. There should at least be a choice of changing the colour so the new stick design is not lost on a grey background. But much better if we had a choice to change the icon style or maybe the whole theme. ", "author": "869156026", "created_at": "2018-11-14", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37078816-make-office-customer-manager-available-for-enterpr", "header": "Make Office Customer Manager available for Enterprise E3 / E5 ASAP...  Please!", "idea_text": "We need Office Customer Manager, but we would have to subscribe to a lower, less expensive subscription. Its like ordering an expensive steak, and then being told you can't have dessert because it's only available to customers who ordered the hamburger. How does that make sense? ", "author": "888236410", "created_at": "2019-03-11", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35854966-onedrive-business-unable-to-share-folders-with-one", "header": "Onedrive business unable to share folders with onedrive personal", "idea_text": "Onedrive business unable to share folders with onedrive personal.It seems it’s not possible to share between personal OD and Business OD with the desktop sync. Users have been asking for this feature again and again – from what I have read MS is “thinking” about it and have been for a couple of years. I have lost sales because of this!\n \nI think Office 365 and Microsoft 365 are incredible – yet basic fundamentals like this performed so well by competitors let it down.Please implement this Microsoft!!!\n", "author": "864002824", "created_at": "2018-10-29", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38092363-o365-outlook-online-calendar-should-be-able-to-sho", "header": "O365 Outlook Online Calendar should be able to show multiple timezones", "idea_text": "Hi,\nThe online version of the O365 Outlook calendar () should be able to show multiple timezones, just like the desktop app, and just like the Google Calendar.\nWhen working in an international environment this is a requirement.\nRegards,\nEelco", "author": "909936757", "created_at": "2019-07-08", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37265863-business-plan-doesn-t-provide-embed-funtion-thoug", "header": "Business plan doesn’t provide embed funtion, though personal plan does.", "idea_text": "Business plan doesn’t provide embed funtion, differrent from personal version. Even if I try using iframe tag, it doesn’t work because ms banned it. I could have exchanged some important class material with my students in my website using embed funtion, if that fuction were provided. I don’ know if there is a special technical reason you must not provide that ‘only in business plan’. But when I changed my personal plan into business one, I expected much more improved one. But it is limited in terms of minor thing like this. It was disappointing, but I am looking forward to being able to use that service soon. It will be reall helpful. So I hope you consider providing that service ASAP. ", "author": "891700402", "created_at": "2019-04-02", "votes": 5, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36587215-toddler-ribbon", "header": "Toddler Ribbon", "idea_text": "As a business professional working in O365, the continued use of ribbon redesign to hide functionality and eat more screen is getting old. Knock it off. You make the gsuite seem much more attractive when you work to alienate your base.", "author": "880880074", "created_at": "2019-01-21", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37828744-in-outlook-2016-updated-to-2019-version-the-send", "header": "In Outlook 2016 updated to 2019 version, the Send-From-To-Subject ribbon is much bigger than before. Please provide configuration options.", "idea_text": "In the Outlook 2016 updated to 2019 version, the mail Send-From-To-Subject ribbon is much bigger than previous to the update. Please provide configuration options.", "author": "904259608", "created_at": "2019-06-04", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32598151-option-to-add-to-a-delivery-address", "header": "Option to add to a delivery address", "idea_text": "We are a Flower shop and we make deliveries and we don't have the ability to add a delivery address in the invoices. This would be a great plus for our organization. ", "author": "724797511", "created_at": "2017-12-12", "votes": 4, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38280850-instant-calendar-sync-between-tenants", "header": "instant calendar sync between tenants", "idea_text": "A 3 hour wait is too long for some organisations to sync a calendar shared from another tenant. I'd like to see an instant sync between calendars", "author": "913059760", "created_at": "2019-08-01", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32197258-improved-import-field-mapping", "header": "Improved Import Field Mapping", "idea_text": "Automatically Map Fields if top row text matches.   Appears to work for one field (middle name) but not others.", "author": "706471228", "created_at": "2017-11-09", "votes": 4, "reaction": [{"status": "in the plans", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33051295-micorsoft-teams-conversations", "header": "Micorsoft Teams Conversations", "idea_text": "Would like to see the \"owner\" of the \"Team\" be able to delete user comments in the conversation window.  Currently, only the individual who made the comment can delete their comment.  ", "author": "744427042", "created_at": "2018-01-23", "votes": 4, "reaction": [], "comments": [{"author": "781242685", "created_at": "2018-07-14", "text": "Totally agree: I am trying to delete an automated message from a bot (connected service). Being the owner of the Team/Channel, I would expect to be able to moderate the chat thread. It is weird that I can't delete chat messages as owner. And while the workaround to ask team members to delete one of their chats messages is tedious but an option, this is not possible for automated non-member messages. "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33054280-outbound-spam-needs-some-sort-of-message-to-help-i", "header": "Outbound Spam needs some sort of message to help identify what might be suspicious vs an account spamming", "idea_text": "Outbound Spam needs some sort of message to help identify what might be suspicious vs an account spamming.  Right now we just get BCCed, but would prefer to get a identifier or notification that says why we are getting an email.", "author": "744523534", "created_at": "2018-01-23", "votes": 4, "reaction": [], "comments": [{"author": "666884986", "created_at": "2018-08-07", "text": "This is definitely a great suggestion. In fact i think it is a big oversight that currently a suspected outgoing spam message is just copied to the indicated address WITHOUT any kind of notification. The recipient will not really know that it is a warning to check out the message, because the message doesnt indicate it and the message could have been sent by way of BCC or maybe the administrator is also the recipient of the address. It is very confusing if the administrator gets these suspect mails just copied, and it would appear that the administrator is just looking at mails not intended for him. This needs to be amended urgently."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36830512-make-microsoft-outlook-mac-version-free-to-use", "header": "Make Microsoft Outlook Mac Version FREE TO USE", "idea_text": "Since MS is intent . no bent on allow MS Outlook on Mac complete and utter Garbage... and no where near the quality of software that the windows version is, I propose that they make MS Outlook on Mac free to use. There is no reason I should be paying for MS Outlook when its in the total garbage state that its been in for YEARS.", "author": "884012137", "created_at": "2019-02-12", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37227700-recall-action-on-outlook-for-mac", "header": "Recall action on Outlook for Mac", "idea_text": "Add a recall action on Outlook for Mac without showing the receiver the email", "author": "890974282", "created_at": "2019-03-28", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36649960-increase-quantity-of-emails-can-be-sent-using-smtp", "header": "increase quantity of Emails can be sent using SMTP", "idea_text": "When there are too many Emails sent - our Email address automatically going to blocked list in the action center", "author": "881833234", "created_at": "2019-01-28", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38156770-sharepoint-block-download-of-all-file-types", "header": "Sharepoint - Block Download of all File Types", "idea_text": "Currently, SharePoint allows Block Download on only Office file types such as Word, Excel, PowerPoint. Many companies would benefit from also having the ability to share view-only files to external users that are not Office exclusive such as PDFs or images. Please extend functionality to all file types!", "author": "911112085", "created_at": "2019-07-16", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37587055-nested-collapsible-links-on-sharepoint-to-break-do", "header": "nested/collapsible links on SharePoint to break down huge content in one single site page", "idea_text": "Can we have this functionality in Modern? nested/collapsible links on SharePoint to break down huge content in one single site page. i think i saw this was doable in Classic SharePoint.", "author": "899473927", "created_at": "2019-05-08", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37698088-100-genuine-lotus-notes-to-outlook-converter-sh", "header": "100% genuine Lotus Notes to Outlook converter - Shoviv Software", "idea_text": "Shoviv Software is a popular name in the field of Lotus Notes to Outlook converter. Shoviv Lotus Notes to Outlook converter provides a genuine way to migrate Lotus Notes data to Outlook PST with an error-free conversion. Its user interface is very easy to use any non-technical users use the tool very easily and converts the data.\nSome highlights of the tool\n1:- Perfectly expert to convert multiple Lotus Notes data to Outlook PST\n2:- Save data into EML, MSG, HTML formats\n3:- Provide Mapping option\n4:- Available Filter option, It helps to filter unwanted data\n5:- Also available Split option\n6:- Compatible with versions of Lotus Notes, Outlook, and as well as Windows OS\nDownload its free trial version and check all features and functionality. With the help of Its trial version users migrate the first 25 items per folder.\nMore details, visit:- \n", "author": "890731300", "created_at": "2019-05-20", "votes": 2, "reaction": [], "comments": [{"author": "904870840", "created_at": "2019-07-01", "text": "Smoothly perform Lotus Notes to Outlook conversion by using NSF to PST converter. This tool safely exports all Notes ( NSF) files in Outlook PST file. It converts all NSF file including email properties, contacts , journals, images, attachments, Unicode characters, calendars, appointments, text, etc. Even, software compatibly works on Windows 95, NT, 98, 2000, XP, Vista, 7, 8, 8.1 and 10.View More - "}, {"author": "904139293", "created_at": "2019-06-07", "text": "NSF File to Outlook Converter Software is an easy to use software for converting Lotus Notes (. NSF) files to MS Outlook (. PST) files. Try this software and easily migrate from NSF to PST by exporting all your emails, contacts, attachments, journals, etc.More Info;- "}, {"author": "851930785", "created_at": "2019-05-30", "text": "The software which can actually work as Lotus Notes to Outlook Converter Software according to user’s review is eSoftTools NSF Converter Software. This tool enables the user to view inaccessible NSF data and then export it in a more readable file format such as EML, Outlook PST, EMLX, HTML, MSG, and many others. A free version is also available to try.\nExplore more: "}, {"author": "832262230", "created_at": "2019-05-22", "text": "If you have problem to changing over NSF to PST files in light of the detail that there was some hitch with your Lotus Notes files, or perhaps you were trying to import them to Windows Outlook just to recognize they don’t get imported as Outlook does, you will know how worrying and unsatisfactory it can be. From data loss to trustworthiness faults and loss of time, this action conveys with itself a ton of difficulties and unbearable substance.To know more detail click here - "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37502857-microsoft-bookings-integrate-with-a-room-resourc", "header": "Microsoft Bookings - Integrate with a room resource, so appointments show up when you try to schedule time using Outlook Calendar", "idea_text": "We set up Bookings for the Conference Room for us and the other building tenants.  it works great (well, it would be better if we could pick the time length) but if I try to use outlook and set the location as the conference room, the existing appointments set in bookings do not show up, even though I set the staff email as the resource email address.", "author": "393389239", "created_at": "2019-04-29", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37642864-attached-and-send-files-and-screenshots-to-externa", "header": "attached and send files and screenshots to external contacts in Microsoft TEAMS", "idea_text": "This option (attachments and or cut and paste screenshots) was in Skype for Business chat window, but no longer in Teams (external contacts). A feature I use with external clients on a daily basis and very important for our workflow. Please consider adding this feature in the chat window, for external contacts. :) \nMany thanks\nMatt", "author": "900339904", "created_at": "2019-05-14", "votes": 2, "reaction": [], "comments": [{"author": "900537910", "created_at": "2019-05-15", "text": "This is something I also use on daily basis on the customer site. Would definitely like to have this feature available."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37347976-make-sure-your-product-actually-works-before-you-s", "header": "Make sure your product actually works BEFORE you sell to customers", "idea_text": "was told business premium would allow me to take office 2016 files, upload to ms 365 online and use them on an app in android device. after 10+ hours talking to largely incompetent people, it was clear your product didn't work. I then fended off 7 calls from support for people who wanted to go through the exact same trouble shooting steps. simple suggestion: before you advertise a product to do something, actually try it out in real world devices. then educate your people so they know what they are talking about and the product can then be easily implemented.", "author": "893871772", "created_at": "2019-04-11", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38419633-flagged-email-filter-outlook", "header": "flagged email filter outlook", "idea_text": "Flagged email filter next to the All / Unread filters would be very useful in Outlook.", "author": "915504778", "created_at": "2019-08-21", "votes": 2, "reaction": [], "comments": [{"author": "919569793", "created_at": "2019-09-12", "text": "This type of filter is available on the Android system but not on the PC version as far as i can tell. It would be of great value and used more often if on the PC as well."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38381116-support-defender-tamper-protection-in-windows-10-b", "header": "Support Defender tamper protection in Windows 10 business / 365 business to prevent trickbot from disabling defender", "idea_text": "in 1903, tamper protection is enabled by default.  It then disappears once you join the PC to AAD in 365 business making it LESS Secure than a stand alone PC (in this respect).  I have pitched 365 business as being more secure following MS guidance for resellers - please fix this gap", "author": "883039312", "created_at": "2019-08-15", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33883927-unfortunately-there-isn-t-a-way-to-refund-invoices", "header": "unfortunately there isn't a way to refund invoices/transactions directly through the business center app. It would be good if there was :)", "idea_text": "unfortunately there isn't a way to refund invoices/transactions directly through the business center app. It would be good if there was :)", "author": "774925867", "created_at": "2018-04-07", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33683218-consolidate-contacts-better", "header": "consolidate contacts better.", "idea_text": "I have a lot of email addresses in the business center listings that are orphaned, but I recognize a lot of them as also having owners.  And many of my contacts have been imported from other devices, like phones, and simple things like putting first name last keeps them from being ignored.  A way to consolidate because of phone number or email address would help.", "author": "768334174", "created_at": "2018-03-19", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33760411-365-allow-owa-to-attach-files-directly-to-from-sha", "header": "365-Allow OWA to attach files directly to/from SharepointOnline", "idea_text": "Could we please have a feature that lets users attach files directly to/from Sharepoint Libraries that they have access to.Users can attach files from OneDrive, but NOT Sharepoint. A lot of users, invluding myself would like this feature.", "author": "770740702", "created_at": "2018-03-26", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32811838-enhanced-task-management", "header": "Enhanced task management", "idea_text": "It would be wonderful if there was a way to manipulate the task view to organize tasks by multiple levels.  Right now, it's only possible to sort by one level.  I recall being able to do this years ago in Outlook.  \nAlternatively, there seems to be a huge gap between the project management capabilities of Microsoft Project and task management in Outlook.  I have multiple projects to manage, although can't get the functionality I need in Outlook, while Project is for much larger scale project management.  Is there something in between?", "author": "733280416", "created_at": "2018-01-03", "votes": 3, "reaction": [{"status": "thinking about it", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34403632-recurring-excel-problem", "header": "Recurring EXCEL Problem", "idea_text": "Since January, almost every update carries the same problem. \nOpen spread sheet\nCreate a text box. \nCopy using copy command\nPaste numerous copies.\nThey disappear when clicked away from \nUsing on a MACBook pro.\nWent back to 2011 version, and works fine. \n", "author": "792445501", "created_at": "2018-05-30", "votes": 2, "reaction": [], "comments": [{"author": "833012356", "created_at": "2019-06-05", "text": "New Excel Issue\nMicrosoft Office 365 Business \nVersion 1905 (Build 11629.20214 Click-to-Run) \nMicrosoft Excel for Office 365 MSO (16.0.11629.20210) 32-bit \nProduct ID: 00265-80200-00761-AA969Last two updates of Office 365 for Business has an issue which causes Excel to Lock the keyboard. Keyboard be unlocked by using Mouse. or ALT-TAB to change screens and return.\nIssue is using Freeze Pane, Freeze Row, or Freeze Column using the Short Cut Key Stroke. Issue does not occur when using Mouse. Short Cut Key Stroke is: ATL-W (View) F (Freeze) then F, R or C (for Pane, Row, or Column) The Shortcut letters of F, R & C will remain on the screen and the keyboard is locked.Just extremely tired of every other Office update creating a new problem."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34344682-connections-email-marketing", "header": "Connections Email Marketing", "idea_text": "Connections is currently not functional. When creating new mailing lists via csv import it causes duplication of contacts in the everyone list.  If this can't be fixed the platform is essentially useless and should be removed as a feature.  I would love for it to work properly,  but with this type of duplication if consumer unsubscribes they could potentially still receive emails which is a big problem!", "author": "790618663", "created_at": "2018-05-24", "votes": 3, "reaction": [], "comments": [{"author": "827494507", "created_at": "2018-07-26", "text": "This is a mess and a waste of TIME. Use Mail Chimp. "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34396930-can-you-make-a-tool-from-which-email-addresses-sen", "header": "can you make a tool from which email addresses send or read information read in the outlook program?", "idea_text": "hi,\ncan you make a tool from which email addresses send or read information read in the outlook program?", "author": "792248065", "created_at": "2018-05-30", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34476769-add-website-field-with-types-to-contact", "header": "Add Website Field with Types to Contact", "idea_text": "When researching a Contact, I would typically keep their Work website, their Organization website, their Personal website and an Other website to keep track and utilize for sales reach out.  Keeping this in one place for Contact would save me time and keep me in one place - Microsoft.", "author": "797089339", "created_at": "2018-06-07", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34476688-add-phone-types-of-main-and-other-to-contacts", "header": "Add Phone Types of Main and Other to Contacts", "idea_text": "Public Sector agencies will often have a Main number, even for a department, which a salesperson should keep until they can get the other numbers.  An Other number would be good as well if we meet or find them through a 2nd job or organization.", "author": "797089339", "created_at": "2018-06-07", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34476835-enable-switch-between-lead-and-customer-classifica", "header": "Enable Switch Between Lead and Customer Classification for a Contact", "idea_text": "Currently, if a Contact is a Customer versus a Lead, it cannot be changed or undone if it was a mistake; the only recourse is to delete and start again.  For new users, this can be an expensive learning experience.  For regular users, I am not sure how the lack of flexibility benefits them?", "author": "797089339", "created_at": "2018-06-07", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34474045-my-user-experience-in-purchasing-visio-is-terrible", "header": "My user experience in purchasing Visio is Terrible", "idea_text": "I tried to get Visio online Plan 2. \nIt cost me a lot of time in your store.\nI want something like Steam, \nFind, Pay, Download, My Software, Please make them at one interface.\nPlease make microsoft interface similar with Steam.\nYour interface is beautiful, but not friendly.\nI have to spend hours to get what I want.", "author": "796843726", "created_at": "2018-06-06", "votes": 2, "reaction": [], "comments": [{"author": "821009980", "created_at": "2018-07-06", "text": "The worst customer experience I ever encountered.\nIf I would not have been committed to buying, no way I would have gone through all this.\nI even needed to call O365 Business Professional support to make it through that process."}, {"author": "796843726", "created_at": "2018-06-06", "text": "For my personal Account, I have to sign in  ,finish the payment.\nThen I have to sign in , find \"Service and subscription\" to download the\ninstallation pack. \nWhy don't you combine them? Just like Steam."}, {"author": "796843726", "created_at": "2018-06-06", "text": "I want a interface like Steam."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34596040-keep-the-help-files-updated", "header": "Keep the Help files updated!", "idea_text": "There's a lot of help in the Community and from MS itself, but a lot of it is conflicting, or old as MS makes changes to the software. There's no real way to know what advice applies any longer. I've been stumped by following old (not bad, just no longer relevant) advice. It's more important that you can imagine to ensure that the help files are updated along with the software. At the very least date each entry so I can have a clue to understanding if I'm looking at something that was written a year ago, or yesterday. ", "author": "816028831", "created_at": "2018-06-18", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34725466-be-able-to-go-back-and-forth-between-different-acc", "header": "Be able to go back and forth between different accounts, like Google", "idea_text": "I have 2 different 365 accounts, one for work and one for school. Id like to be able to go between accounts like I can on Google. This seems to be impossible unless using two different browsers. The problem is that when I open a link to a document in automatically opens in my default browser. Because I have my work credentials saved in my default browser it is a huge headache to log out and log in with my school account.", "author": "819753052", "created_at": "2018-07-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35390338--open-with-missing-under-right-mouse-buttom", "header": "\"Open with..\"  missing under right mouse buttom", "idea_text": "In Office Outlook I miss the choice \"open with..\" under right mouse buttom. Sometimes I want to open a certain file with another program then the standard program. That is not possible as the choice not is on option under Outlook.If I have i file on the desktop, the choice \"open with..\" is an option on the right mouse buttom. Why not in Outlook?", "author": "849871237", "created_at": "2018-09-12", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34731142-web-mail-should-be-able-add-specific-mail-to-cale", "header": "web mail should  be able add specific mail to calendar as reminder on one click", "idea_text": "Web mail should be able add specific mail to calendar as a reminder, by right click same as desktop outlook, do not see this on web mail 365", "author": "819891268", "created_at": "2018-07-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34794751-full-screen-booking-calendar", "header": "Full Screen Booking Calendar", "idea_text": "Full screen booking calendar on business centre, or at least full height on view screen. Currently have to expand the iframe from web inspector to be able to view the calendar correctly.", "author": "822454675", "created_at": "2018-07-10", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34789114-upgrade-enhance-bulk-emailing-tool", "header": "Upgrade / enhance bulk emailing tool", "idea_text": "Please consider investing in improving the bulk emailing tool in Business Centre, to something of a similar standard to MailChimp or ConstantContact. The limited range of templates available is in our view not adequate for a professional bulk emailing to clients/contacts so we are forced to continue to use MailChimp.", "author": "822190435", "created_at": "2018-07-09", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38693992-office-365-missing-title-bar-and-part-of-display", "header": "Office 365 missing title bar and part of display (main)", "idea_text": "On Dual Monitor setup, Office 365 is afflicted by a known bug n the main display; many users are experiencing problems with Office 365.The top of the window (the first inch) is missing... the title bar the close minimize buttons are not there and if there a window underneat it it will close that window instead.\nIt happens randomly with many applications like file explorer, google chrome, adobe reader dc but always when Office365 is running.All those apps are up to date, Windows10 is also up to date... the only way to reset to normal conditions is to reboot.Minimizing (with Alt+Spacebar) allow to work on other applications but the reboot is not a solution...", "author": "926404540", "created_at": "2019-09-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35428096-recurring-meeting-end-alert", "header": "Recurring Meeting end alert", "idea_text": "Every recurring meeting that is setup with a limited time period should prompt with a message or option to extend the meeting or close by the last or last but one occurrence.", "author": "851109517", "created_at": "2018-09-17", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35349115-keep-the-business-center-please-keep-listings-a", "header": "KEEP THE BUSINESS CENTER!!! PLEASE KEEP LISTINGS AND CONNECTIONS!!!!", "idea_text": "Keep it all! ", "author": "847695808", "created_at": "2018-09-07", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32197210-enhance-import-failure-reporting", "header": "Enhance import failure reporting", "idea_text": "State which records failed on import", "author": "706471228", "created_at": "2017-11-09", "votes": 2, "reaction": [{"status": "in the plans", "author": "", "created_at": "2018-01-17", "note": ""}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38697625-the-meeting-links-of-teams-meeting-are-not-showing", "header": "The meeting links of Teams Meeting are not showing in Outlook Calendar. So Please fix it cos both Teams and Outlook are your products", "idea_text": "Teams Meeting Link in Outlook Calendar", "author": "926452273", "created_at": "2019-09-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32585455-when-will-it-be-available-in-latin-america", "header": "When will it be available in Latin America?", "idea_text": "", "author": "724273603", "created_at": "2017-12-11", "votes": 2, "reaction": [], "comments": [{"author": "398985916", "created_at": "2018-01-17", "text": "We are slowly rolling out worldwide, starting with US, UK, and Canada. We'll post updates when Business center is available in other countries and regions."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33041977-customer-service-new-concept", "header": "Customer service (new concept)", "idea_text": "Find a way to get your 'chat' staff to solve problems instead of having your customers waste hours of valuable time explaining to a person (who does not have English as a first language) what the problem is, only to be told, \"you need our commercial team.\"\nReally, do I, for one purchase of office 365?", "author": "744072964", "created_at": "2018-01-22", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33155647-receipt-tracking", "header": "Receipt Tracking", "idea_text": "One of the primary needs of many business is receipt tracking. You need to accurately track things from meals to supplies to product. While invoicing is important, and Mile IQ is great... we really need a product that you can take a picture of a receipt, enter a total and categorize it. You will need to provide a means to output this into common accounting software. Thanks", "author": "749151733", "created_at": "2018-01-31", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33477289-allow-password-protected-excel-files-to-be-shared", "header": "Allow password protected Excel files to be shared in OneDrive", "idea_text": "It seems crazy that in these times of required security OneDrive does not offer the ability to password protect Excel files", "author": "761272372", "created_at": "2018-02-28", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33232519-group-calendar", "header": "group calendar", "idea_text": "Ticket #:7320895\nRoberto,\nYou didn't call at 2p. I had a 3rd person waiting as well.Requested: group calendar where more than one person can schedule events.\nset up effort: created new relationships and attempted to share calendar. With \"share\", edit privileges may be a limitation.Did not explore \"groups\", which appears may allow groups to schedule events. I will open another ticket.idea: if a calendar can be web based and users from multiple companies s can edit, please make it easier to find/set up. ", "author": "752199565", "created_at": "2018-02-06", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33055684-can-you-please-add-find-my-pc-for-pc-s-signed-in", "header": "Can you please add \"Find my PC\" for PC's signed in with Office 365 Accounts.", "idea_text": "Enable \"Find my PC\" for PC's signed in with an Office 365 account, and allow Locking the PC or the Account on the PC.", "author": "744574318", "created_at": "2018-01-23", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38371765-please-add-aplan-for-one-drive-1-tb-for-personal-p", "header": "Please Add aPlan for One drive 1 TB For Personal Plan", "idea_text": "add a One Drive 1tb plan for personal accounts. \nright now such plan only available in Business Accounts.\nplease add a 1tb One Dirve stand alone Plan for Personal Usages", "author": "914624593", "created_at": "2019-08-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38305534-cannot-open-mail-in-pop-up-window-in-shared-mailbo", "header": "cannot open mail in pop up window in shared mailbox", "idea_text": "with the new layout, if I try to open a mail while the preview is active, I cannot see the mail. I see the pop up window but inside I see a replica of Outlook 365  mainscreen. It happen with shared mailbox and in all the major browsers (IE, Edge, Chrome, Firefox). Used SO: win 10, win 7 and win 8.1", "author": "913491322", "created_at": "2019-08-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38364094-view-upcoming-events-at-top-of-inbox", "header": "View Upcoming Events at Top of Inbox", "idea_text": "In the old version of outlook, it would show the next meeting on my calendar at the top of my inbox. For instance, if I had a meeting at 3 pm, it would have an abbreviated meeting title, along with the time just above the pinned emails. This was very helpful so I don't have to have multiple tabs open for my calendar and inbox. I don't normally have meetings so I'm not in the habit of specifically opening my calendar up. I missed a meeting the other day because the new layout doesn't include that view, which was quite annoying. If this could be brought back in new updates, that would be great!", "author": "914499190", "created_at": "2019-08-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33503588-backup-outlook-including-the-colour-categories-in", "header": "Backup outlook including the colour categories in the inbox. They are amazing but basing a system on it is a risk since they do not backup.", "idea_text": "Backup outlook including the colour categories in the inbox. They are amazing but basing a system on it is a risk since they do not backup. ", "author": "762134306", "created_at": "2018-03-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33633709-office-365-admin-interface-link-must-be-simple", "header": "OFFICE 365 ADMIN INTERFACE - LINK MUST BE SIMPLE !", "idea_text": "We are Microsoft Partner, so we have to test OFFICE 365 Plan E3, during renewal phase, is impossible to insert a new renewal product key directly , with a simple link, (downloaded from MAPS registration), because in the Admin interface of Office 365 the only options available are BUY a new licence, so it's impossible to insert a product key of OFFICE 365 Plan3 to extend the partner (but also the customer's) licence with an existing new product key. The only solution I found to insert a product key (obtained by MAPS contract) is a workaraound:\n1 I accessed to setup.office.com \n2 i have inserted the productkey of Office 365 Plan E3\n3 The procedure of activation fails, and propose to connect to another registration site like  \n4 finally the activation works after 3 different redirection pages\n5 the last redirected page finally returns to the Office 365 Admin interface (incredible I started from here), in a hide link (not accessible  by admin interface, before, where I was started)....So I think that the link of Renewal under \n (ADMIN INTERFACE)\"LICENCE\" must be simple, please add under Licence tab:  \n\"Have you already got a product key ?\" \nRENEW WITH PRODUCT KEY (button)", "author": "766650157", "created_at": "2018-03-14", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38389741--teams-add-ability-for-external-numbers-to-be-use", "header": "(Teams) Add ability for external numbers to be used for conference bridges / meeting invites", "idea_text": "This would be helpful for inviting guests who aren't on teams and allows for a mixed bag of conference callers / online participants to join.", "author": "914903449", "created_at": "2019-08-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38387905-reuse-checklists-in-planner", "header": "Reuse checklists in Planner", "idea_text": "You often need the same checklists for the tasks you enter in Planner. It would be great to have the possibility to create standard checklists and add them to newly created tasks.", "author": "914876800", "created_at": "2019-08-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38521021-print-mbox-to-pdf-including-attachments", "header": "Print MBOX to PDF Including Attachments", "idea_text": "MBOX to PDF Converter is a reliable choice which allows exporting MBOX files into a PDF format (legal presentable document format). This MBOX to PDF tool supports MBOX file of various email application such as Apple Mail, Opera Mail, Gmail, Mozilla Thunderbird, Spicebird, Eudora, etc. The MBOX to PDF Converter has a capability to print MBOX messages to PDF format with a convenient process and without losing any data. This tool is completely stand-alone utility which doesn't need any additional tool to save MBOX email attachments. The tool will migrate MBOX to PDF with attachments (into their original formatting). Download free MBOX to PDF: Benefits of MBOX to PDF tool1 – Convert MBOX to PDF document format\n2 – No formatting modification during the conversion process\n3 – Batch MBOX to Adobe PDF Conversion\n4 – Convert MBOX files to PDF with attachments\n5 – Support all MBOX supportive email clients like Gmail, Opera Mail, Eudora, Mozilla Thunderbird, Apple Mail, Spicebird, Mutt, etc.", "author": "915826513", "created_at": "2019-09-04", "votes": 1, "reaction": [], "comments": [{"author": "873344128", "created_at": "2019-09-13", "text": "Get best ZOOK MBOX to PDF Converter () to export multiple MBOX to PDF with attachments. It allows to Convert, save and print MBOX emails to PDF format in bulk by preserving data integrity.MBOX to PDF converter can easily supports multiple MBOX supported email clients such as Mozilla Thunderbird, Eudora, Mac Mail or Apple Mail, Entourage, SpiceBird, Opera Mail and many more. Users can also test the efficiency of the utility by checking the free demo edition of the utility.Read More Info,Visit Here:- "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38642317-application-responsiveness-w-drawings", "header": "Application Responsiveness w/ Drawings", "idea_text": "If you open email containing drawings that was created in Outlook application. and you decrease the size of the application past a certain point, the drawings disappear rather than stay visible on the email.", "author": "920710363", "created_at": "2019-09-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38498614-please-allow-schedule-send-of-emails-in-outlooks-3", "header": "Please allow schedule send of emails in outlooks 365 web (like gmail)", "idea_text": "", "author": "916803352", "created_at": "2019-09-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38634583-get-notification-emails-when-a-collaborator-upload", "header": "Get notification emails when a collaborator uploads a file on OneDrive.", "idea_text": "When you upload on a shared folder on OneDrive, you can send manually a notification email to users. But, it would be nicer if there is an option that you can get emails automatically whenever something has changed in the share folder, if you are the collaborator for the folder.\nWe used to use Box system, where I get emails automatically, which was very informative. Thanks!", "author": "920591821", "created_at": "2019-09-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38571901-shared-mailbox-and-moving-and-deleting-e-mails", "header": "Shared mailbox and moving and deleting e-mails", "idea_text": "We would like it so that items moved in shared mailboxes do not automatically create a recover item under deleted as it makes it hard for users to tell what was deleted vs moved. (or make it so deleting items in shared mailbox goes into the specified shared mailbox instead of the users mailbox and creating another mail under the recovery options. (basically no matter what you do things are under the recovery in the shared mailbox deleted so users are confused on what is actually deleted and can't tell if an accidental deletion occurred)", "author": "919295194", "created_at": "2019-09-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38655595-change-microsoft-on-behalf-of-your-oganization-n", "header": "Change \"Microsoft on behalf of your oganization\" name", "idea_text": "We like to change \"Microsoft on behalf of your oganization\" name of , because my users not speak english.I'll like to rename to spanish version or create a contact that show the new name selected.", "author": "673321765", "created_at": "2019-09-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38646727-increase-the-limit-on-concurrent-connections-that", "header": "increase the limit on concurrent connections that submit messages", "idea_text": "The current limit on concurrent connections that submit messages is 3.  That is totally unreasonable.  If a manager in our timekeeping system approves 10 timesheets at once, only 3 people get the email notification that their timesheet has been approved.", "author": "920763247", "created_at": "2019-09-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37882303-allow-outlook-365-to-import-e-mails-from-an-ost-f", "header": "Allow Outlook 365 to import e-mails from an .ost file.", "idea_text": "There is at least 5 third parties offering softwares in your foruns. Shame on you, MS.", "author": "906725230", "created_at": "2019-06-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37871860-mark-label-conversation-threads-in-teams", "header": "Mark/Label Conversation Threads in Teams", "idea_text": "In order to easily find relevant 'threads' within the conversation dialogue of Teams Conversations, I would like to be able to give a Conversation, with one or more responses a Label or Title, so I can easily scan for relevant threads within dynamic teams.", "author": "904584712", "created_at": "2019-06-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38050585-put-a-big-huge-red-warning-before-the-admin-choose", "header": "put a big huge red warning before the admin choose to delete a mobile access permission", "idea_text": "On the Office 365 Exchange Managment, you can see on any mailbox, which devices has been connected to the office 365 mailbox.\nThere is an option to delete and erase the data, and there is also an option to delete the permission to a specific device.\nplease put a BIG HUGE RED WARNING before the admin choose to delete a mobile access permission. warn us that all the mailbox data - Mail, Calendar and Contacts - is going to be deleted and cant be restored if something from the data is not synced to the cloud.", "author": "909197338", "created_at": "2019-07-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38035843-give-an-option-to-auto-add-shared-with-users-to-on", "header": "Give an option to Auto-add shared-with users to OneDrive folder change alerts.", "idea_text": "Please allow an Alert control for \"all shared users\" as the email input. Thanks.", "author": "908918536", "created_at": "2019-06-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38034574-add-threads-sub-chats-in-chats-to-team", "header": "Add Threads (sub chats) in chats to Team", "idea_text": "Group chats quickly become conversations within conversation within Conversations. You quickly miss out on topics and it´s messy.so please add/ offer Threads/sub chats to be used:i.e.\n1. Marketing Chat/ Group\n    a. Website\n            (this is wehre people chat about this specific topic. people can check up the specific topic of interest and get back to other marketing topics later)\n    b. Advertisement\n    c. Events\n    d. Logo\n    etc.please see how others i.e.Twist solves it and offer that feature!", "author": "908900650", "created_at": "2019-06-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38119327-abmeldung-verhindern", "header": "Abmeldung verhindern", "idea_text": "Abmeldung müsste man als Admin verhindern können, wir haben z. B. Kundenrechner, dort könnten diese nicht mehr rumspielen", "author": "910500988", "created_at": "2019-07-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38063881-irm-option-should-be-available-in-office-365-busin", "header": "IRM option should be available in Office 365 Business and Business Premium (manual eMail encryption)", "idea_text": "We additionally purchased Azure Information Protection P1, but e.g. don´t have the option to manually encrypt single eMails.", "author": "909432622", "created_at": "2019-07-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38166544-provide-a-way-for-error-reporting", "header": "provide a way for error reporting", "idea_text": "Why isn't there a category for reporting and expiditing errors in Office 365?I work in Excel and in the past 3 days there has been a change in the VBA Function \"InputBox\".The documentation says, and it worked that way 4 days ago, that when you click on the Cancel Button, the routine returned \"False\".  Now it returns an empty string when I use it.And trying to talk to the Tech guys about it, they don't really understand what I'm talking about.  I pointed to the documentation about \"InputBox\", showed them that the code now produces an empty string.I have a huge system of code that is developed, but when it suddenly starts not working differently, I then have to figure out why and try to deal with  your tech people who don;t have any understanding of what changes like this mean or cost.", "author": "911138728", "created_at": "2019-07-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38167468-i-currently-have-sbs-2011-and-need-to-have-project", "header": "I currently have SBS 2011 and need to have Project Online Professional. These are not compatible and wonder if there is a patch out there?", "idea_text": "I currently have SBS 2011 and need to have Project Online Professional. These are not compatible and wonder if there is a patch out there?", "author": "911208283", "created_at": "2019-07-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38127895-make-it-easier-to-update-a-business-name-and-assoc", "header": "Make it easier to update a business name and associated URL's", "idea_text": "I had setup a small business account with Office 365 and have undergone rebranding. Trying to be able to change default accounts, domains and the previously setup URL's for sharepoint and the <companyname>.onmicrosoft.com. proved too awkward for me. I have simply decided to export all my data out of O365 and will decide whether it's better to start from scratch or use a different product suite altogether.", "author": "910609735", "created_at": "2019-07-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38172205-facing-problem-of-open-the-excel-xlsx-under-w10", "header": "Facing problem of open the excel *.xlsx under w10 O365", "idea_text": "Not able to repair and open the excel file with latest version *.xlsx", "author": "911277160", "created_at": "2019-07-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38175694-office-365-looks-great", "header": "Office 365 Looks Great!", "idea_text": "Just wanted to say that I recently updated to version 1902, and I love the new look of the interface!The size of icons are nice; and I really appreciate the larger forward and reply indicators on emails. Makes it very easy to see the actions I've already taken on an item.", "author": "911335294", "created_at": "2019-07-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38215711-recall-function-in-outlook-web-app", "header": "Recall function in Outlook Web App", "idea_text": "Recall function is not available in Outlook Web App", "author": "911982094", "created_at": "2019-07-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38229478-add-on-button-approve-deny-amendments-needed-for", "header": "Add on Button: Approve/Deny/Amendments Needed for Validation Emails", "idea_text": "It would be super helpful to have an option that allows users to approve, deny or note if amendments are needed when sending docs via email that need validation. This could save time on the validation side of information retrieval.", "author": "912182002", "created_at": "2019-07-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38243965-onedrive-outlook-plugin", "header": "Onedrive Outlook Plugin ???", "idea_text": "Citrix Sharefile Outlook Plugin does it !. The sharefile outlook plugin  detects your attachment size when you pull an attachment from your computer and puts it in outlook composing message from citrix share file and give you a link to embedd... Can Microsoft do same  for one drive? I've yet to see an outlook plugin for onedrive that automatically detect the attachment size and puts it on onedrive and give the user a link to share. Any plans Microsoft ?", "author": "912443611", "created_at": "2019-07-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38236633-individual-fonts-for-different-accounts-in-outlook", "header": "Individual fonts for different accounts in Outlook", "idea_text": "How can one push that this problem is finally solved by Microsoft: when managing several mailboxes with different design requirements (starts with private vs. profession or corporate design for several companies from the same mailbox) within one outlook account? This request - for the business customer this is actually a completely usual approach, I'm surprised that MS hasn't solved it yet - requests for it in the community are already almost 10 years old", "author": "912321481", "created_at": "2019-07-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37833922-provide-alternatives", "header": "Provide alternatives", "idea_text": "Office 365 changes with the times...but not on my schedule (it is actually disruptive) and I may not like the new appearance.Microsoft says in effect \"too bad...this is needed for progress\". Maybe so....how about letting us vote by giving us alternatives to 365 (maybe even competitors as that would send a louder message). Then Microsoft can cater to the \"have to have the latest technology\" crowd (dare I say the \"send Microsoft your paycheck crowd\") and allow the rest of us to get some work done! Technology is great and I use it. But I do not want to be a ***** to the technology. It is supposed to help me. The continual flood of changes does not help in my case. maybe I am a loner. I still would like to see a reasonably priced package that remains constant until I see the benefits in upgrading. That would allow free enterprise to work and get the consumers what they need and not what the techies are seeing as possibilities. P.S. Office 365 is low cost now...remember the day when Bill Gates said everyone would be using MS Office and because of that, the office suite software (not subscription) would sell for less than $100. Do you really think Office 365 is going to remain reasonably priced after Microsoft gets their hooks into a large group of people?", "author": "904341451", "created_at": "2019-06-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38227423-enable-calling-plans-in-saudi-arabia", "header": "Enable Calling Plans in Saudi Arabia", "idea_text": "This Feature seems to be requested but no one posted about it here, as far my concern, this move is important to us as Microsoft 365 Clients.", "author": "912154237", "created_at": "2019-07-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38246875-envelop-email-icon-in-the-new-theme-needs-improvem", "header": "Envelop email icon in the new theme needs improvement", "idea_text": "The email envelop icon \"new\" and \"open\" looks almost the same. its hard to see how many emails are new. it will be great if will be color or any other visible difference that will be easy to see.", "author": "912505546", "created_at": "2019-07-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37035118-computer-mobile-connectivity-with-human-brains", "header": "COMPUTER,MOBILE CONNECTIVITY WITH HUMAN BRAINS", "idea_text": "i have new technology related idea. it's can help with UN-educated peoples, those who dnt have hand's .this technology will helps.its  bring the change in the world everyone will love to use this amazing technology.it will so advance then 2050 era.it's can give new look to mobile,and computer companies. im sure it can give more then more media and customer coverage to company.it so advance then today world more then more. no one can imagine. i have more features that i cnt explain on this platform .for more details .we need to arrange meeting i can discuss it clearly. ", "author": "887287147", "created_at": "2019-03-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37054477-stream-videos-permission-for-no-screen-shots", "header": "Stream Videos - Permission for no screen shots", "idea_text": "Restrict the possibility of taking a screen shoot of a Stream Video - basically add DRM functionality, similar to email.  (passing along the question/ask )", "author": "887615617", "created_at": "2019-03-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37300555-fix-synchronization-issues", "header": "Fix Synchronization Issues", "idea_text": "Design Tasks in Outlook so that they can also work with Apps such as ToDo. With me, that's always flawed. In the same Way, Synchronization should be improved. Changes on other Devices repeatedly cause Problems.", "author": "892665196", "created_at": "2019-04-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37081807-one-drive", "header": "one drive", "idea_text": "One Drive should work the same way with external people", "author": "888292780", "created_at": "2019-03-12", "votes": 1, "reaction": [], "comments": [{"author": "898643842", "created_at": "2019-05-04", "text": "Totally agree.... I'm quitting Onedrive because you can't share files with someone unless they have a Onedrive account! Surely Mircosoft 365 \"the ultimate business solution\" doesn't expect everyone in the world to have a Onedrive account!! Also Onedrive is full of bugs, it doesn't seem to sync and you get error messages when you try to log on online...nightmare!\nBACK TO DROPBOX FOR ME!"}, {"author": "888292780", "created_at": "2019-03-12", "text": "It should be possible for people outside the organization that have Office 365 share files/folders and them appear on Shared Files and be able to sync with the computer"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37300756-view-calendar-in-outlook-today", "header": "View Calendar in Outlook Today", "idea_text": "Choice Of which Calendars appear in Outlook today. Outlook itself, already creates three Calendars, when Setting it up. (Calendar, Holidays and Birthdays). It is illogical that they will not be displayed. Layers are common these days in all sorts of Applications. It would be high time to move here with the Times. It is completely pointless to just represent the Calendar under Outlook today.", "author": "892665196", "created_at": "2019-04-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37352659-get-3d-image-in-office-for-mac-to-the-netherlands", "header": "Get 3D image in office for Mac to the Netherlands!!! I feel geographically discriminated. ;)", "idea_text": "Please get 3D images for office for Mac working in the Netherlands. I cannot see any logical reason why it would be geographically restricted to not work in the Netherlands. It works on windows in the Netherlands. This is like an OS and geographical location issue??? Office should be the stronger software for goal users. I look like a doop with my dutch system not being able to do this and the US guys are??", "author": "893952781", "created_at": "2019-04-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37323577-impossible-for-skype-for-business-user-to-contact", "header": "Impossible for Skype for Business user to contact regular Skype directly", "idea_text": "The way Skype for Business is configured, when a Skype for Business user sends a regular Skype user an invite, the regular Skype user does not receive it.  They ONLY receive the invitation once the regular Skype user searches for the Skype for Business user's email address and adds it.  This is needlessly cumbersome! The Skype for Business user should be able to search for the regular Skype user and send the invitation and the regular Skype user actually GETS it!", "author": "893305321", "created_at": "2019-04-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37352698-please-have-outlook-msi-version-work-the-same-as-c", "header": "Please have Outlook MSI version work the same as Click-to-Run.  Click-to-run is not cost efficient.", "idea_text": "", "author": "893953009", "created_at": "2019-04-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37410469-automatische-terminerinnerung-via-sms-benachrichti", "header": "Automatische Terminerinnerung via sms benachrichtigen, für Schweiz", "idea_text": "Automatische Terminerinnerung via sms benachrichtigen, für Schweiz", "author": "895281379", "created_at": "2019-04-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37500895-remove-limitation-of-1000-calendar-invites-in-offi", "header": "Remove limitation of 1000 calendar invites in Office 365", "idea_text": "Currently, Office 365 has a 1000 calendar item limit for multiple recurring events. Can this be expanded to 5000 items? This is not allowing some members of our team to view calendars. See Microsoft Support ticket 12902981for more details.", "author": "897495160", "created_at": "2019-04-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37403500-overwrite-attribute-is-not-working-while-provision", "header": "Overwrite attribute is not working while provisioning the custom list definition from SPFx solution.", "idea_text": "The Overwrite attribute is not supported when provisioning the custom list definition in the form of elements.xml from SharePoint Framework client site solution.  ", "author": "895148182", "created_at": "2019-04-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36522553-open-a-docx-file-in-office-365", "header": "Open a docx file in office 365", "idea_text": "Fix it so Office 365 on Windows 10 will open a docx files. ", "author": "879774751", "created_at": "2019-01-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36537607-outlook-tasks-connected-with-the-android-app", "header": "outlook tasks connected with the android app", "idea_text": "There must be an opportunity to link the tasks in Office 365 with the android app. ", "author": "880124422", "created_at": "2019-01-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36597439-outlook-tool-for-folder-view-setup", "header": "Outlook tool for folder view setup", "idea_text": "In Outlook, I have a TON of sub folders within the Inbox and Sent folders.  It would be nice to be able to set up ONE look that I want for ALL of the folders in the Inbox and ONE look that I want for ALL of the folders in the set folder and have those settings apply to all subfolders.  I have had Microsoft techs try to help me do that many times and it is never more than partially successful.This would include which columns are visible, etc.I suspect that this would be a great tool for many.", "author": "881021329", "created_at": "2019-01-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36577007-publisher-doesnt-have-an-online-version", "header": "Publisher doesnt have an online version", "idea_text": "I want to use Publisher online because i dont use a window OS", "author": "880712181", "created_at": "2019-01-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36537502-bulk-emails-with-attachments", "header": "bulk Emails with attachments", "idea_text": "In the past, before 365 there was the opportunity to send bulk Emails with attachments. This is neccessery for our companies Workflow.", "author": "880124422", "created_at": "2019-01-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36609160-microsoft-skype-for-business-does-not-retain-saved", "header": "Microsoft Skype for Business does not retain saved audio settings when more than one audio input and/or output device exists", "idea_text": "My Windows 10 Dell PC has two USB-based microphones (Skype is configured to use one of them). For audio output, my PC has one traditional 3.5mm audio output port and two DisplayPort adapters with their own audio outputs. Skype is configured to use one of the DisplayPort adapter's audio outputs. Even though my PC is configured to keep its USB-based ports alive during any power-saving activity Skype for Business, oftentimes when I start Skype for Business, it does not switch to the saved \"PC Microphone and Speakers\" option. Instead, it switches to \"Speakers Only\". A Microsoft support representative said Microsoft's Product Development Team said this behavior was \"by design\". GoTo Meeting and other screen-and-voice-sharing software do not behave this way. When a user saves their audio configuration within Skype for Business, Skype for Business should always save the user's choose and not switch to another audio configuration profile.", "author": "881191678", "created_at": "2019-01-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36661696-being-able-to-manually-install-add-ins-for-outlook", "header": "Being able to manually install add-ins for Outlook 365 without an Exchange-Licence", "idea_text": "I wasn't able to find ANY information that I need to purchase a more expensive Exchange-Licence for using third-party Add-Ins. Please enable this feature to manually install Add-Ins into Office 365 or give more additional Information before the purchase of Office 365thanks.", "author": "881969320", "created_at": "2019-01-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36618583-outlook-autofill-contacts-when-composing-new-mes", "header": "outlook - autofill contacts when composing new message", "idea_text": "When your composing a new email and you type the first name or part of the email outlook searches the cached contact list but it should instead search your contacts to help auto complete emails addresses", "author": "881320951", "created_at": "2019-01-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36581263-import-eml-to-office365-in-effective-way", "header": "Import EML to Office365 In effective way", "idea_text": "Are you thinking about how to import EML to Office365 without altered data? This is not very easier task to performs and migrate local EML files to Office365 cloud without needed any help. For this task, eSoftTools Software introduced the best software for EML to Office365 Converter which can takes every steps of migration with full accuracy and successful migration. User can get this software on single click of mouse and easy to export bulk eml to office365 without losing and altering data.Know some highlights of the software-\n1) Import bulk eml to office365 cloud\n2) Import eml messages attachments as well.\n3) Import imbedded images with eml files.\n4) Migration with 100% secure layer\n5) free version available to immediate download \n6) EML file preview enabledGet this software more details: \n", "author": "880799911", "created_at": "2019-01-20", "votes": 1, "reaction": [], "comments": [{"author": "919035931", "created_at": "2019-09-08", "text": "If you want to transfer all data without any kind of loss you have to use the perfect tool through which you can save all data like attachments, images, hyperlinks and all other text and non-text detail of selected files. I suggest to use the only trusted and advanced tool so that you can get the answer of all your queries. \n "}, {"author": "895611265", "created_at": "2019-07-05", "text": "There is no direct manual solution available to convert EML to Office 365 user account, you can use alternate solution in which you need to convert EML to PST, then export PST file into Office 365 account by using network upload, drive shipping method. I would like to suggest MailsDaddy EML to Office 365 Migration tool, this is the best utility to import EML file in Outlook 365 mailbox. The best part of tool is it runs on all Window operating system.To know more about the solution visit here: "}, {"author": "880804675", "created_at": "2019-05-30", "text": "I would like to suggest you an effective and result-oriented tool for import EML to Office 365 which helps you to processed bulk EML files migration and save's lot of time.  SoftMails EML to Office 365 migration utility specially designed to take the largest list of EML files and folders and upload it on online office 365 cloud servers with all email properties (to, cc, bcc, subject and date) . The freeware tool also download from here \n"}, {"author": "882268549", "created_at": "2019-05-20", "text": "For an instant and easier solution, you can also try Shoviv EML to the Office 365 tool which can quickly convert EML files into PST, MSG, HTML formats without any size issue. The tool loaded with advanced features which makes the tool more efficient and reliable. You can effortlessly migrate EML into Office 365 and Live Exchange server in the most accurate and professional manner. You can also use a trial version to ensure the effectiveness of the tool, using the trial version you can convert the first 25 items/folder.\nGet more info form here: "}, {"author": "895100407", "created_at": "2019-04-17", "text": "If you are Mac user So I have one suggestion for you Mac EML to PST Converter When I was looking for switching EML files to Outlook. So my friends suggested the tool, you should also try this software. Link of the site: "}, {"author": "891101545", "created_at": "2019-03-29", "text": "EML to Outlook PST converter is the best used for converting EML file format to Outlook PST format. It supports conversion of EML,to PST which is easily import by Office 365 :- "}, {"author": "832262230", "created_at": "2019-03-23", "text": "With the help of EML to PST Outlook Conversion Tool, a user can easily migrate EML data to Outlook PST format along with all emails. Every kind of user - technical and non-technical can briskly use this EML to Outlook Migration to change EML data to Outlook PST format on all Windows operating systems.You can find the converter software here: "}, {"author": "879306409", "created_at": "2019-02-22", "text": "There is no direct way to import EML to Office 365, the user needs an automated migration tool to perform this task. So after searching, I have found a tool at here -  it will migrate entire data of EML file with all attachments."}, {"author": "880804675", "created_at": "2019-01-22", "text": "To import EML to Office365 in an effective way, there will be a need to have a tool which can perform this whole procedure on its own. SysInpire EML to Office 365 is one of that smart tool. It does not have any size restriction for conversion. It previews each and every proceeding of the software for user convenience. It can help in the conversion from many different platforms such as Thunderbird, Windows live mail, Outlook Express, Windows and many more. This software restores each element of the mailbox which may include contacts, calendars, messages etc.\nExplore more here for free: "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37018309-the-line-with-arrow-header-can-t-be-aligned-vertic", "header": "The line with arrow header can't be aligned vertically or horizontally in MS Word.", "idea_text": "The line with arrow header can't be aligned vertically or horizontally in MS word.It is a simple problem, but it especially must be an important problem when a user works with an old version word file that it has a line with arrow.This problem has been happening continuously after 2013 version.\nI can't understand why MS doesn't fix it.\nPlease fix it as soon as possible.", "author": "887013517", "created_at": "2019-03-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36674122-recall-an-email-without-showing-receiver-the-origi", "header": "Recall an email without showing receiver the original email", "idea_text": "When you recall an email, the receiver gets an emailing telling them that you want to recall the email, but the original is still present in their inbox at the same time. Clicking the original causes the recall to fail. \nHowever depending on their inbox layout, the receiver could view the subject and part/most of the body of the original, and then still click the recall email, which removes the original and causes it to be successful. I think it would be more useful for the sender if when a recall is sent, the original email is hidden from the receiver. Depending on how the receiver reacts to the recall depends on if they see the original or not. Of course it would be ideal for a recall to not give the receiver the option to view the original at all, but I'm sure there's more to that.  ", "author": "882130168", "created_at": "2019-01-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36671746-onedrive-sync-app-on-windows-10-moving-files-to-re", "header": "OneDrive sync app on Windows 10 moving files to recycle bin when syncing", "idea_text": "HiCan you please investigate why over 10GB worth of files was being moved to recycle bin when using the OneDrive sync app? This issue occurred while the sync app was synchronizing with OneDrive online. While it was synchronizing, it appeared it was moving all files to the local recycle bin which therefore also moved those same files to the recycle bin in OneDrive online.I fixed this by unlinking this Office 365 account from the sync app and linked it again.Please advise if you have come across an issue like this or investigate any other reported issues on this as it is of critical importance not to have files suddenly being moved to recycle bin.", "author": "882096115", "created_at": "2019-01-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36678070-autosave", "header": "Autosave--", "idea_text": "Hey man what the ****--I keep clicking save and none of my changes get saved!  I am redoing my work over and over like a ******* moron.  Why did you disable autosave when the file is saved on a local drive?  Cmon, you cant cutoff features like that because you want us to use onedrive.", "author": "882181894", "created_at": "2019-01-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36836908-ticket-13027561", "header": "Ticket 13027561 -", "idea_text": "1. it is unhelpful to ask me to provide feedback to one of 32 forums. I am just a simple soul.\n2. your operator took nearly one hour to try to resolve an issue; giving me little confidence in his knowledge of the products and my issue.\n3. although I requested an immediate call to a manager, and offer of compensation for lost time, this request was ignored (please check the audio file of the call o confirm this)\n4. I do not understand why, given your ability to access my PC remotely the original error (mine) was not known to you. \n5. In spite of me ticking the two boxes below, please do not inform me of product updates. Your periodic emails are less-than-clear", "author": "884106934", "created_at": "2019-02-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36837538-problem-opening-files-in-onedrive", "header": "Problem opening files in OneDrive", "idea_text": "The name path is too short, i want to save files organized in several folders and subfolders and when i try open the files they dont open because the path be too long.\nPlease extend the path because that way i cant use MS OneDrive.\nI used Mega.nz and was moving everything to OneDrive, that way i cant and i ll continue using Mega.nz", "author": "884114194", "created_at": "2019-02-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35912713-bug-outlook-365-crashes-on-adding-contact", "header": "Bug - Outlook 365 crashes on adding contact", "idea_text": "Outlook 365 crashed while adding new contact (After filling new contact's name and moving to a different info box).\nRemoving office completely and reinstalling didn't worked.\nInstalling office on a new computer didn't solved it either.\nOnly reverting to Version 1807 (Build 10325.20118) and disabling updates solved the problem.\nPlease fix it ASAP.\nThank you", "author": "866671207", "created_at": "2018-11-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36853960-more-than-5-devices-per-user", "header": "More than 5 devices per user", "idea_text": "In business accounts allow us to add additional licenses for more than 5 devices to prevent issues. You allow home users 10 installs but Business is limited to 5. With a variety of online devices and devices requiring licenses, I have users with more than 5 installs. I should not need to create a new user to add additional licenses to expand installs allowed. Would be fine with purchasing additional license and have the ability to assign second license to user.", "author": "884323258", "created_at": "2019-02-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35974807-outlook-contacts-has-a-known-issue-randomly-and-re", "header": "Outlook Contacts has a known issue—randomly and repeatedly deleting photos and changing display name entries.", "idea_text": "It's a major nuisance for corporate users and it wants to be set straight. The email sender must go into Contacts and re-establish the name and address. If you don't, you either are not sure the email was correctly sent or the addressee thinks he/she is not of sufficient import to be an entry in the sender's address book. This has been persistent for 3 weeks!", "author": "867620818", "created_at": "2018-11-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36839101-hi-can-you-add-an-option-to-share-singe-tab-in-th", "header": "Hi, can you add an option to Share singe tab in the Excel online like GDocs does? https://www.youtube.com/watch?v=Sj_uGLZqBmc", "idea_text": "Hi, can you add an option to Share singe tab in the Excel online like GDocs does? ", "author": "884135500", "created_at": "2019-02-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35952658-hide-local-calendar-and-make-shared-calendar-outlo", "header": "Hide local calendar and make shared calendar outlook 365 calendar", "idea_text": "In small workgroup, I can't make an outlook 365 shared calendar as outlook 365 ONLY calendar by default,And I need to uncheck the local calendar view on every opening of outllok and it is very annoying.\nIt would be very useful to give the user the option to make the shared calendar as the main and only viewed calendar.", "author": "866671207", "created_at": "2018-11-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36018043-automatically-extract-client-or-vendor-contact-inf", "header": "AUTOMATICALLY EXTRACT CLIENT OR VENDOR CONTACT INFO", "idea_text": "Every email we receive, Outlook, Customer Manager and Business Center extra the email address, phone number, fax number, name, website, company's name and other information from our clients & vendors email signature to contact to Customer Manager and Business Center and track all email related to them. I have 6000 emails from clients and vendors and I cannot add manually. This would help us with CRM. I remember Outlook used to have that a long time ago but for some reason you guys removed. This is very important specially for small business owners.", "author": "858962824", "created_at": "2018-11-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36038260-create-the-justify-alignment-for-onenote", "header": "Create the \"Justify\" alignment for OneNote!", "idea_text": "Its a very basic formating tool!!", "author": "870113707", "created_at": "2018-11-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36026329-outlook-contact-e-mail-tab-consolidation-of-emai", "header": "outlook contact e-mail tab - consolidation of emails in contacts area", "idea_text": "In outlook, in contacts, in specific contact, have a tab that is called correspondence, history or communications, where all e-mails to and all e-mails from are gathered.  There, you can search by column - etc.\nthis would solve the problem of looking for e-mails, when you know you sent it, who you sent it to, and what it was about - but for some reason, the search in the mail area can't find it without loosing a bucket of time", "author": "869610400", "created_at": "2018-11-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36081457-hwant-microsoft-office-365-pro-plus-2016-for-busin", "header": "hwant microsoft office 365 pro plus 2016 for business(32+64) Arabic off line due to limted internet", "idea_text": "I want complete off line Microsoft office 365 pro plus 2016 for business(32+64) Arabic for windows 10  due my internet is limited. I want to download it one time then install it on  my 3  computer  then activiate it by my mail (my company sent link but I have to download &install all time then loss my data as my internet is limited", "author": "872218750", "created_at": "2018-11-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35913679-please-make-it-possible-to-change-the-default-mess", "header": "Please make it possible to change the default message that \"Skype Meeting Add-in for Microsoft Office 2013\" create when skedule a meeting", "idea_text": "With Skype for business is it possible to skedule a new skype meeting from Outlook. \nPlease make it possible to change the default message that \"Skype Meeting Add-in for Microsoft Office 2013\" create automatically.", "author": "866691529", "created_at": "2018-11-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36139510-do-you-want-to-maximize-the-productivity-of-your-o", "header": "Do you want to maximize the productivity of your organization with extended feature of Office 365.", "idea_text": "Join us for webinar “Leveraging Office 365 for automating business flow” Join Microsoft SharePoint business consultant Sarveshwar Desai as he discusses how to leverage your existing O365 for automating business processes. O365 assists you to increase user adoption and organizational efficiency by leveraging SharePoint work flows To Register : ", "author": "873386203", "created_at": "2018-11-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36149785-teams%E4%B8%AD%E7%9A%84%E6%96%87%E4%BB%B6%E7%BC%96%E8%BE%91%E5%8A%9F%E8%83%BD%E4%B8%8D%E8%83%BD%E5%85%BC%E5%AE%B9office97-2003%E6%A0%BC%E5%BC%8F-the-file-editing", "header": "Teams中的文件编辑功能不能兼容OFFICe97-2003格式 The file editing capabilities in Teams are not compatible with the office 97-2003 format", "idea_text": "Teams中的文件编辑功能不能兼容OFFICe97-2003格式\n在使用Teams中的文件编辑会调用到office online 控件，当你的文件格式是97~2003的doc、xls的时候是不能在Teams中打开，如果采用word或execl online方式打开文件将无法进行编辑。Teams file editing calls to office online, but you can't open Teams files with doc or XLS between 1997 and 2003. You can't edit files with execl online or word", "author": "873498949", "created_at": "2018-11-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36149782-teams%E4%B8%AD%E7%9A%84%E6%96%87%E4%BB%B6%E7%BC%96%E8%BE%91%E5%8A%9F%E8%83%BD%E4%B8%8D%E8%83%BD%E5%85%BC%E5%AE%B9office97-2003%E6%A0%BC%E5%BC%8F-the-file-editing", "header": "Teams中的文件编辑功能不能兼容OFFICe97-2003格式 The file editing capabilities in Teams are not compatible with the office 97-2003 format", "idea_text": "Teams中的文件编辑功能不能兼容OFFICe97-2003格式\n在使用Teams中的文件编辑会调用到office online 控件，当你的文件格式是97~2003的doc、xls的时候是不能在Teams中打开，如果采用word或execl online方式打开文件将无法进行编辑。Teams file editing calls to office online, but you can't open Teams files with doc or XLS between 1997 and 2003. You can't edit files with execl online or word", "author": "873498949", "created_at": "2018-11-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36207466-add-location-in-teams-meetings-without-powershell", "header": "Add location in Teams Meetings without PowerShell", "idea_text": "Why is it so complicated to add a simple location in a Team Meeting (Microsoft Teams)? Would be better off PowerShell. Not user friendly, doesn't encourage collaboration since only admins can do that through PowerShell.", "author": "874458262", "created_at": "2018-12-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36377560-typo", "header": "Typo", "idea_text": "There is a typo at \n\"each\" is misspelled as \"ecah\" in the sentence that follows the heading \"Note\" near the top of that page.", "author": "877052563", "created_at": "2018-12-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36297469-internal-and-external-meeting-subjects", "header": "Internal AND external meeting subjects", "idea_text": "Please give us the obvious feature: An internal AND an external meeting subject. \nToday my meeting subjects are similar to \"External company/My company - <Subject that more or less suits us all>\". Why don't you give us the option to make the \nINTERNAL \"Bussiness case and marketing plan with <ExternalCompany>\" \nEXTERNAL \"Business opportunity with <MyCompany>\"So I would see the Internal subject in my calendar, and my opponent would see the EXTERNAL...", "author": "875882884", "created_at": "2018-12-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36479887-in-outlook-outlook-customer-manager-is-not-suppo", "header": "In outlook - outlook customer manager is not supporting 2 separate email id user of  business premium - please update this", "idea_text": "i have 2 email id of outlook business premium , but when i use one email id for outlook customer manager feature , other one not working .when i work for other one , first one not working.please give facility for multiple licience working under one desktop outlook.", "author": "878940322", "created_at": "2019-01-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35395120-we-would-like-to-provide-a-customer-service-auto-r", "header": "We would like to provide a customer service auto-response email", "idea_text": "We would like to provide a customer service auto-response email as a first response (ie FAQ)  to customer enquiries that saves time in responding to the same queries over and over. Astoundingly, there is no function when using a MAC to add pictures in an auto-response email. Office 365 support tried various methods including html code but none worked. Please implement this for us as I find it remarkable that such simple functionality is not possible.", "author": "850168000", "created_at": "2018-09-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35408431-standardization-of-all-outlook-calendars", "header": "Standardization of all Outlook Calendars", "idea_text": "All the Outlook Calendars, in the desktop version, the web version, at a PC, Macbook, tablet, are different. So I can import a iCloud calendar in my desktop version, but it's not possible to do that at my Macbook. Why are there in Outlook so many different versions of the calendar? Why can I import a webCal in the desktop, but not in my Macbook? Why are there form me unknown calendars in my Macbook version, which are not in my Windows desktop version? I would like to have my calendar at my desktop, Macbook, iPad and iPhone, but thats not possible.I hope Microsoft wil do something about it. I think a lot of users will be glad as there is one version of the Office 365 calendar for all devices.", "author": "850514110", "created_at": "2018-09-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35404933-sharing-calendar", "header": "Sharing calendar", "idea_text": "Now, there is no possibility to share a calendar with team members and that all the members can edit that calendar. I think the solution can be calDAV. Then you can easily share calendars.", "author": "850428328", "created_at": "2018-09-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35408437-standardization-of-all-outlook-calendars", "header": "Standardization of all Outlook Calendars", "idea_text": "All the Outlook Calendars, in the desktop version, the web version, at a PC, Macbook, tablet, are different. So I can import a iCloud calendar in my desktop version, but it's not possible to do that at my Macbook. Why are there in Outlook so many different versions of the calendar? Why can I import a webCal in the desktop, but not in my Macbook? Why are there form me unknown calendars in my Macbook version, which are not in my Windows desktop version? I would like to have my calendar at my desktop, Macbook, iPad and iPhone, but thats not possible.I hope Microsoft wil do something about it. I think a lot of users will be glad as there is one version of the Office 365 calendar for all devices.", "author": "850514110", "created_at": "2018-09-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35473675-accessing-archive-mailbox-from-mobile-devices", "header": "Accessing Archive mailbox from mobile devices", "idea_text": "Users really need to be able to access their archive mailbox from a mobile device, such as an iPhone.  In this \"mobile\" world we now live in, this is a tremendous disadvantage not being able to access the archive.  When will this feature/fix be implemented?", "author": "851720677", "created_at": "2018-09-20", "votes": 1, "reaction": [], "comments": [{"author": "871161439", "created_at": "2018-11-21", "text": "please put your votes for this here: "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35448295-send-as-alias", "header": "send as alias", "idea_text": "Please allow users to send email as an alias. A user may fulfill multiple roles within a small business, and they shouldn't have to pay for and sign in to multiple email accounts for what is essentially a single user. ", "author": "851362849", "created_at": "2018-09-18", "votes": 1, "reaction": [], "comments": [{"author": "296264875", "created_at": "2019-05-21", "text": "Google for \"ChooseFrom 365\" cloud service."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35522689-support-office-365-business-deployment-with-intune", "header": "support office 365 business deployment with Intune", "idea_text": "Current:\nIf you want to use Intune to deploy Office today, you have to be licensed for or update to ProPlus.Request:\nWe are using Office 365 Business and would like to use Intune to manage the deployment of these apps to our systems (without upgrading or changing the Office license).\nWe aren't interested in any of the other differences between the Business and ProPlus editions.", "author": "852867916", "created_at": "2018-09-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35565772-make-microsoft-teams-optional", "header": "Make Microsoft Teams optional", "idea_text": "I am very disappointed in the \"upgrade\" to Microsoft Teams from Skype for Business.  It is not user friendly.  It appears to be for larger companies to use internally.  I used Skype for external calls.  I no longer have that function.  My contacts are gone, and I cannot log in.  Please make Teams optional so customers like me can still use Skype for Business", "author": "853751452", "created_at": "2018-09-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35684521-manager-dashboard-for-skype-for-business", "header": "Manager dashboard for Skype for Business", "idea_text": "My company would greatly benefit from a dashboard that displayed, the number of current calls, Who from a call queue and or group is on the phone, Who is answering queue calls, who is logged into a queue now, reporting on the number of calls in a time frame, etc.. This is for department managers to see what their people are doing.  Call quality is not a concern for them as much as who is answering, how many they are answering, if they are logged into the proper queue, etc.   ", "author": "734098516", "created_at": "2018-10-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35707951-email-notifications-turn-off-if-i-m-in-a-meeting", "header": "Email Notifications - turn off if I'm in a meeting", "idea_text": "My presentations and meetings are continually interrupted with notices of email notifications. It's super distracting to my audience. Outlook knows I'm in a meeting - it can see my calendar. It also knows if I'm the meeting organizer. I'm also running Skype, which knows I'm in a meeting. So why doesn't Notifications respect that? Don't show email notifications during the meeting if I'm the organizer. OK to show them the rest of the time, just not when I'm presenting. ", "author": "857903038", "created_at": "2018-10-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35701747-enhance-integration-with-veeva-vault-to-enable-us", "header": "Enhance Integration with Veeva Vault to enable us if Microsoft Rich Client", "idea_text": "The current integration between Veeva Vault and Microsoft Word only enables Microsoft Word Online. Microsoft Word online has significant limitations and does not fulfill business needs for collaborative editing of documents, i.e. tracked changes are not visible in Microsoft Word online but only after opening the document in the rich client.Microsoft shall collaborate with Veeva to enhance the integration, i.e. enable the \"Edit in word\" functionality when documents are opened/ sent to a workflow from Veeva Vault.", "author": "857781067", "created_at": "2018-10-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35740579-bulk-client-updates", "header": "Bulk client updates", "idea_text": "We need to be able to update client contacts all together like if it was spreadsheet or sharpening where we can easily scroll or filter client to update and add new columns to all clients at the same time", "author": "858962824", "created_at": "2018-10-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35765578-make-sub-folders-list-alphabetically-under-inbox-i", "header": "Make sub folders list alphabetically under Inbox instead of chronologically", "idea_text": "Pretty self explanatory.  Was told The 365 Home edition does this.  I've used Outlook for years and it use to do this automatically.  Moving in place is not user friendly.  Also I do not see the need for chronological but it there is a need maybe there needs to be a choice given at creation of the folder name.", "author": "860331889", "created_at": "2018-10-18", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35790736-excel-uploads-xml-files-bigger-than-1-mb-again", "header": "Excel uploads xml files bigger than 1 MB again.", "idea_text": "Currently excel can upload xml but not bigger than 1MB. WhenI try upload xml bigger than 1 MB I receive notice: \"No connection. Not enough memory, calculation cannot be proceeded\" (translation from Polish notice). \nIt is very usefull feature, so if it was restered it would be very helpfull.\n", "author": "861303076", "created_at": "2018-10-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35790739-excel-uploads-xml-files-bigger-than-1-mb-again", "header": "Excel uploads xml files bigger than 1 MB again.", "idea_text": "Currently excel can upload xml but not bigger than 1MB. WhenI try upload xml bigger than 1 MB I receive notice: \"No connection. Not enough memory, calculation cannot be proceeded\" (translation from Polish notice). \nIt is very usefull feature, so if it was restered it would be very helpfull.\n", "author": "861303076", "created_at": "2018-10-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35803129-allow-shared-tasks-to-sync-with-an-individual-user", "header": "Allow shared tasks to sync with an individual users to-do list", "idea_text": "When creating a shared task list, any user who has been shared the list should see those tasks in their \"regular\" to-do list as well. This would keep all tasks consolidated, easily viewable in Outlook, and easily synced with mobile devices... instead of having to keep track of multiple lists. Microsoft To-Do allows User 1 to create a shared list with User 2. User 1 will see the tasks in their to-do list. User 2 can add tasks to the list which will show up in User 1's to-do list, but not in User 2's to-do list. A \"shared\" list isn't \"shared\" if all users don't have the equal access.", "author": "861748651", "created_at": "2018-10-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35818969-ability-to-search-downloaded-files-on-onedrive-app", "header": "Ability to search downloaded files on OneDrive app while offline", "idea_text": "Very often, I work in remote areas with no mobile or WiFi coverage, so I have a group of frequently used files downloaded to my OneDrive app, however if I search for any of them while offline, the app give no results as it search feature only works when OneDrive iOS app is online.Please consider an offline search feature for quick access of downloaded files in iOS apps, in the same way it works on any computer", "author": "862273627", "created_at": "2018-10-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35387146-enable-email-recipients-to-leave-a-thread-when-req", "header": "Enable email recipients to leave a thread when required", "idea_text": "Sometimes when email senders make a bad choice by including too many people in a thread, every recipient ends up getting bombarded with far more emails than they require, which results in unnecessary distractions and lost productivity. Having the option to \"leave a thread\" in Outlook will take this pain away", "author": "848826892", "created_at": "2018-09-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34604323-because-all-migration-vendors-that-i-m-aware-of-m", "header": "Because all migration vendors that I’m aware of, Metalogix, Share Gate to name a couple, recommend that you have a dedicated storage locatio", "idea_text": "Because all migration vendors that I’m aware of, Metalogix, Share Gate to name a couple, recommend that you have a dedicated storage location, within the same region as your Office 365 tenant. I would think, Microsoft would offer this as a free service directly located in your Azure AD, in the office 365 space; not outside in an Azure subscription services. Or at least make it part of a licensing package, so customers are satisfied with their migrations to your service. ", "author": "816243094", "created_at": "2018-06-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34749868-disable-or-allow-users-to-disable-the-automatic", "header": "Disable, or allow users to disable, the AUTOMATIC SAVE ON mandate. It should be an option to turn on when a user first opens a file.", "idea_text": "Please disable or allow users to disable the AUTOMATIC SAVE ON mandate.  It is a potentially disaterous feature in a buisness setting when an original file must be retained as an original.  It is also potentially disaterous if one opens a file and creates an error that warrants a return to the original format - which is lost when changes are automatically saved.  At a minimum, the toggle should be set to OFF when a document is first opened, with an option for the user to then turn it on.  ", "author": "820559245", "created_at": "2018-07-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34752682-send-automated-reply-during-appointments", "header": "Send automated reply during appointments", "idea_text": "Would be great if one could select to send an automated reply during an appointment rather than having to switch it on in options each time.", "author": "820646794", "created_at": "2018-07-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34794703-full-screen-booking-calendar", "header": "Full Screen Booking Calendar", "idea_text": "Full-screen booking calendar on business centre, or at least full height, currently have to expand the iframe from web inspector to be able to view the calendar correctly.", "author": "822454675", "created_at": "2018-07-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34819162-updating-shared-outlook-contacts", "header": "Updating Shared Outlook Contacts", "idea_text": "I'm using the Office 365 for Business platform.  When I share my Outlook contacts with employees inside my organization, the system does not provide an option for my employees to update my contacts, so that I too can instantly benefit from those contact updates on all my devices. This flaw doesn't make sense to me. ", "author": "823325806", "created_at": "2018-07-12", "votes": 1, "reaction": [], "comments": [{"author": "829630780", "created_at": "2018-08-03", "text": "This is a duplicate of many other relating to the inability to share contacts in Exchange/Office 365."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34871776-hi-i-am-disappointed-that-enders-have-disappear", "header": "Hi, I am disappointed that \"Enders\" have disappeared from Clip Art - there used to be lots to choose from.", "idea_text": "I am disappointed that \"Enders\" seem to have disappeared from Clip Art - there used to be lots to choose from.  Please bring them back.", "author": "825199537", "created_at": "2018-07-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34955974-additional-sharepoint-space-being-able-to-buy", "header": "Additional Sharepoint space - being able to buy", "idea_text": "I would like to be able to buy additional Sharepoint space, or make it possible to get assign some of the TB assigned via OneDrive to a user, to Sharepoint. \nNow it's a 1TB Sharepoint and 1TB per person for personal files.Keeping just one location for all your files, including photos and videos would be my ideal situation.", "author": "827988190", "created_at": "2018-07-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34956124-booking", "header": "booking", "idea_text": "Ability to allow customers to book more than one day. For example, my customers might want to book an engineer for a week. Currently to do so they would have to do 5 individual day bookings. If they wanted 2 engineers, that would require 10 individual bookings.There should be a way to select multiple days, or multiple hours for a bookingThis was a complaint i have received from a customer recently when they tried to use the booking system", "author": "781996768", "created_at": "2018-07-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35056858-meeting-request-coming-as-an-attachment-not-showin", "header": "meeting request coming as an attachment not showing in calendar", "idea_text": "meeting request coming as an attachment not showing in calendar", "author": "831659419", "created_at": "2018-08-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34963000-allow-users-to-insert-sharepoint-document-ids-and", "header": "Allow users to insert Sharepoint document IDs and version numbers in Word 2016", "idea_text": "Allow users to insert Sharepoint document IDs and version numbers in Word 2016.  This was a feature of Word 2007.", "author": "828215230", "created_at": "2018-07-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35049766-please-do-not-retire-the-useful-components-of-bu", "header": "Please do not \"Retire\" the useful components of business centre", "idea_text": "Microsoft rarely gets things right. Microsoft business centre is one of those rare moment. Please do not \"retire\" the useful components such as connections, listing, dashboard, contacts and business profile.  ", "author": "831082519", "created_at": "2018-08-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35076718-implementare-app-di-planner-per-i-guest", "header": "Implementare app di planner per i guest", "idea_text": "Sfortunatamente non riesco a far accedere gli utenti guest sull'app di planer. è un vero limite perchè in mobilità l'utente basta cliccare sull'app e puo' controllare tutto immediatamente.", "author": "832837375", "created_at": "2018-08-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35108236-customized-selection-on-office-365-subscription", "header": "Customized selection on office 365 subscription", "idea_text": "Option for User subscription licence of 1 licence which can be used for 5 Desktops, 5 Tables & 5 Mobiles to have fee for using this licence for additional systems e.g. if i want to customize this licence to use it for 6 or 7 Desktops & other options as same. Depending on the number of additional systems I require, fee to be charged accordingly.", "author": "834933124", "created_at": "2018-08-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35156905-make-it-easy-to-see-how-much-subscription-costs", "header": "Make it easy to see how much subscription costs", "idea_text": "I got an email saying my office 365 subscription is about to be renewed, and I've been clicking around the site for 10 minutes and still don't know how much I'm about to be charged. It seems like something easy and important which makes me think any obfuscation of that information is intentional.", "author": "837596140", "created_at": "2018-08-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35167651-teams-free-edition-with-all-paid-plans-including-e", "header": "Teams Free Edition with all paid plans including Exchange Online Plan 1", "idea_text": "There is a Free Teams Edition with limited functionality with personal email accounts, and then it goes straight to the Business Essentials plan. For Businesses inbetween, there is no choice to add Teams. Allow a Free Edition of Teams with limited functionality (same as Free Edition) to the lower plans including Exhange Online Plan 1", "author": "838251883", "created_at": "2018-08-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35108332-enable-choosing-languages-for-skype-for-business-c", "header": "Enable choosing languages for Skype for Business conference calls", "idea_text": "We were assigned a Belgian number for Skype for Business functionalities, but our clients are from all over Europe. When we make a conference call, instructions are in Dutch and French, and we would love to have them in English.", "author": "834936628", "created_at": "2018-08-14", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34600831-i-am-so-very-eagerly-waiting-for-business-center-i", "header": "I am so very eagerly waiting for Business Center in India and was disappointed that its not released yet in India. Can we release for India?", "idea_text": "", "author": "816149701", "created_at": "2018-06-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34152214-issue-with-dir-function-in-access-vba-since-late", "header": "Issue with dir() function in Access VBA since latest windows 10 update", "idea_text": "Issue with dir() function in Access VBA since latest windows 10 update - Dir() no longer finds MSO.DLL or FM.DLL and Other references using this function. Although the files exits in the physical folder since the windows 10 update on Thursday I have issues with locating these references using the dir() function. \"C:\\Program Files (x86)\\Microsoft Office\\root\\VFS\\ProgramFilesCommonX86\\Microsoft Shared\\OFFICE16\\MSO.DLL\" - Workaround - was to copy the \"Missing\" DLL's and references to my own database folders and use them from there. ie C:\\Temp", "author": "783829936", "created_at": "2018-05-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34177234-i-m-not-a-business-person-i-am-just-a-person-at-h", "header": "I'm not a business person. I am just a person at home using my own personal computer.  But just a few years back I had a calendar on my com", "idea_text": "I AM NOT A BUSINESS PERSON.  I AM JUST A PERSON AT HOME USING MY OWN PERSONAL COMPUTER.  JUST A FEW  YEARS THERE WAS A CALENDAR THAT GAVE US A LITTLE BOX RIGHT ON OUR SCREEN THAT YOU WROTE REMINDERS.  IT WAS THERE YEAR AFTER YEAR.  I LOVED THAT.  IT HELPED HELPED ME OUT A LOT TO REMEMBER EVERYTHING UNDER THE SUN.  I REALLY NEED THAT SORT OF THING RIGHT NOW.  I AM AN ELDERLY PERSON AND CAN'T REMEMBER TO TAKE MY MEDS.  I NEED THAT REMINDER THING FACING ME EVERY DAY.  I SURE DO HOPE YOU CAN HELP ME OUT TO GET THAT BACK ON MY COMPUTER.  GAYLE BEARD RILEY ", "author": "784751290", "created_at": "2018-05-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34276249-one-drive-needs-a-landing-platform-for-uploading-f", "header": "One Drive needs a landing platform for uploading files and folders", "idea_text": "With your present latency issues I have had to manually upload our data into One Drive via Win Explorer. Once there are many files already loaded, one has to go right to the bottom of the dataset to get the landing zone where one can drag the next set of files/folders. This is a very time consuming exercise fraught with issues when there could just be a permanent landing block at the top of the list. If you drop the files anywhere else, they randomly find their way into an existing folder which is madness obviously.", "author": "787983658", "created_at": "2018-05-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34191277-ability-to-delete-searched-files-in-onedrive", "header": "Ability to delete searched files in OneDrive", "idea_text": "It is absolutely ridiculous that I cannot search for files with the word COPY and then delete them.  I have never used any other program that didn't allow you to delete a file or files!!!\nI am very disappointed in this product!", "author": "785365294", "created_at": "2018-05-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34264717-help-received-from-len", "header": "Help received from Len", "idea_text": "Len gave me a 5 start help to me, by stopping charging me for the Home edition of Office 365, that I was not using, and I uninstalled it.\nThanks a lot,\nFlorencio R Fernandez-Gutierrez ", "author": "787644877", "created_at": "2018-05-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34301638-skype-for-business-login-slowly-in-china", "header": "Skype for business login slowly in China", "idea_text": "Hello，our company purchased office365, Built-in skype, slowly login in China.Sometime no login ,Almost no voice calls betweent two accounts.my office 365 account :", "author": "789256819", "created_at": "2018-05-20", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34318819-%E3%83%A6%E3%83%BC%E3%82%B6%E3%81%AE%E5%A3%B0%E3%82%92%E8%81%B4%E3%81%8F%E5%89%8D%E3%81%AB", "header": "ユーザの声を聴く前に、", "idea_text": "Please Many Language Support!!!", "author": "789842134", "created_at": "2018-05-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34328239-use-the-new-design-features-on-top-level-domain-sh", "header": "Use the new design features on top-level domain sharepoint site", "idea_text": "Can you add the new features on the 2016 sharepoint sub-level sites to the top level domain sharepoint site. The web part menus, the content menus that include document viewer, quick links, hero, video; specifically those options and format. The previous format is too slow to work with and since its been improved, we want to add the new features to the top-level domain sharepoint site so we can enhance it with the new features. Thanks", "author": "790125916", "created_at": "2018-05-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34348213-radio-buttons-turns-into-drop-down-menu-in-sharepo", "header": "Radio buttons turns into drop down menu in SharePoint list view", "idea_text": "When creating a SharePoint list column with 3 values I wanted to set up radio buttons instead of drop down menu. How come does it change to drop down menu (both in quick edit view and when editing properties per item) even though I have chosen Radio buttons in the view? ", "author": "775708396", "created_at": "2018-05-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34118377-busy-option-for-skype-for-business-cce", "header": "Busy option for Skype for Business CCE", "idea_text": "Have ability to configure Busy Options with Skype for Business CCE as an on-prem solution", "author": "376699813", "created_at": "2018-05-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34349845-everyone-except-external-users", "header": "Everyone except external users", "idea_text": "Can we please re-enable the group - Everyone except external users .  It allows you to share a file/folder with members of your organisation without logging in. We do not want to use the anonymous access feature as this is a security risk for us, as everyone will be able to access the link.This feature is handy when you are publishing links on an Intranet site. It does not make sense to get your internal client base to log onto their MS account to access the file.", "author": "790783594", "created_at": "2018-05-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34395322-avoid-constant-requirement-for-verifying-subscript", "header": "Avoid constant requirement for verifying subscription - highly irritating - product unusable for travellers with unpredictable internet", "idea_text": "Finding office 360 impossible to use due to constant requests to verify subscription - normally in the most awkward of locations - Microsoft note that  some business users travel extensively and just do not have easy access to the internet in all locations at all times but still need to use the product they have paid for!!", "author": "792199951", "created_at": "2018-05-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34371127-there-should-be-a-way-to-limit-outlook-for-office", "header": "There should be a way to limit outlook for office app from eating up the available mobile storeage i.e number of days to sync setting.", "idea_text": "My outlook is eating up whatever storage space I create and its not consuming almost 40% of my app storage. Whatever space I create outlook consumes that space.There should be a way to limit the storage outlook app can consume like the number of days to sync setting available in other email apps.", "author": "791529331", "created_at": "2018-05-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34322980-resolve-incompatibility-of-imap-accounts-with-cate", "header": "Resolve incompatibility of IMAP accounts with category function", "idea_text": "Currently when using IMAP accounts is not possible to utilize category functions, which makes it difficult to migrate from older office versions. ", "author": "789964482", "created_at": "2018-05-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33556240-a-place-to-log-cash-expenses-as-well-as-mileage", "header": "A place to log cash expenses as well as mileage", "idea_text": "I would like to be able to log my cash expenses too and somewhere to upload receipts", "author": "764005111", "created_at": "2018-03-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33548626-automate-drip-email-campaigns-in-connections", "header": "Automate / drip email campaigns in Connections", "idea_text": "I'm excited to see Connections recently added. I really need a solution that can handle automated / drip email needs. IE, I add a client to the \"new client\" list and they get a welcome email today, an email about our social media platform 2 weeks later, and 4 weeks later an email to see how their experience has been so far. These are very powerful for my business. ", "author": "763753696", "created_at": "2018-03-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33490372-offer-microsoft-invoicing-and-more-business-suites", "header": "Offer Microsoft Invoicing and more business suites to all regions", "idea_text": "It would be better to offer everyone on business subscriptions the option to have the business suite app like microsoft invoicing. Since one would be commited to use the service for long maybe this is a good idea.", "author": "761701276", "created_at": "2018-03-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33574603-share-window-in-skype-for-business-osx-mac-version", "header": "share window in skype for business osx/mac version", "idea_text": "your osx version doesn't allow this, making whiteboarding impossible without sharing the whole screen.", "author": "764597509", "created_at": "2018-03-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33602446-get-the-staff-to-give-us-the-right-information-i-h", "header": "Get the staff to give us the right information i have been waiting for 6 months for the invoice app being told i was at the front of the cue", "idea_text": "Information given must be right whats going on \n", "author": "765532378", "created_at": "2018-03-11", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33643063-i-need-to-be-able-to-add-more-than-10-choices-to-a", "header": "I need to be able to add more than 10 choices to a Choice field in Outlook Customer Manager.", "idea_text": "Currently you can only enter 10 choices on the Choice field. Our company has several, 11, offices a couple large and several satellites.  We want to be able to track sales by office.", "author": "766991518", "created_at": "2018-03-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33681442-bank-account-balance-and-recurring-debts", "header": "Bank account balance and recurring debts", "idea_text": "It would be nice if I could sync my bank account and was able to see my balance on Business center. It would also be nice if I could add a list of monthly recurring debts. Business center could give me an overview for the week.", "author": "768278131", "created_at": "2018-03-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33663700-sharepoint", "header": "Sharepoint", "idea_text": "Um Sharepoint in einen Explorer Ordner (Netzwerkordner) einzufügen braucht es ein realtiv aufwendiges Procedere. (IE Explorer, einfügen der sicheren Site in IE, Verbinden des Ordners in einem neuen Netzwerk Laufwerk etc.) Auch für Ihren Support ist es nicht immer einfach!\nDeshalb mein Vorschlag:\nErstellen eines kleinen Programmes welches diese Arbeiten automatisch durchführt. \nDies würde Sharepoint noch attraktiver machen. \nSiehe Beispiel Egnyte.com. Dort kann ein solches Prg für ein Egnyte Laufwerk (ohne Synchronisierung) abgerufen werden. ", "author": "191383977", "created_at": "2018-03-17", "votes": 1, "reaction": [], "comments": [{"author": "819241732", "created_at": "2018-07-12", "text": "Try Zee Drive for mapping SharePoint Online and OneDrive for Business to a network folder. It should simplify the process of drive mapping. You can find out more here: Disclosure: I work for the company that develops Zee Drive"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33778609-allow-onedrive-custom-libraries-to-be-added-to-mai", "header": "Allow OneDrive custom libraries to be added to main Navigation list", "idea_text": "If you create additional libraries in your OneDrive for Business they can only be found via Site Settings. It would be nice to be able to add custom libraries to the main navigation pane for ease of access.  Custom libraries should also optionally appear in your syncronised OneDrive folder too.", "author": "391067182", "created_at": "2018-03-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33699925-move-nsf-file-to-outlook-pst", "header": "Move NSF file to Outlook PST", "idea_text": "Hi,\nI Found Software to free Download NSF to PST Converter, That software is wonderful work to Export Lotus Notes to Office 365, Live Exchange Server & Outlook PST file with other multiple Mails formats like Thunderbird,   Live mails, windows live mail, Apple mail, etc. This software split large PST file to small PST File.More info : \n", "author": "768884590", "created_at": "2018-03-21", "votes": 1, "reaction": [], "comments": [{"author": "786417265", "created_at": "2019-06-20", "text": "Have a look here: \nThis is very informative post on NSF to PST conversion. May be it helps you"}, {"author": "875687515", "created_at": "2019-03-28", "text": "Don’t worry just go for this Lotus Notes management toolkit and convert nsf files into PST format, merge NSF files, split NSF files, remove duplicate Lotus Notes emails and many more features "}, {"author": "851930785", "created_at": "2019-02-11", "text": "The simplest method to recover data from the Lotus Notes server is by using eSoftTools NSF to PST converter Software. It lets the user migrate the data from NSF format to a different format such as PST, HTML, MSG, MBOX, and many more. It retains the directory structure of the data after conversion. It can work well with all version of IBM Lotus Notes and MS Windows etc It is available for free on the official website to try.\nKnow more: \n"}, {"author": "861685021", "created_at": "2019-01-29", "text": "Download MailsDaddy NSF to PST converter solution and migrate lotus notes to outlook with effective way flawlessly. The tool never harms original NSF database and extract every item from Notes file and provide availability to convert NSF file into PST with their attachments and data integrity. To get the tool visit this link: "}, {"author": "859608208", "created_at": "2018-11-28", "text": "You can easily way to move your NSF to Outlook PST file through Inspire NSF to PST Converter tool. Get Free trial version - "}, {"author": "749541964", "created_at": "2018-10-30", "text": "Download SysInfoTools NSF to PST Converter software for windows, an best solution to export Lotus Notes data into Outlook. It is capable to restore NSF file to PST, as well as other email formats such as EML and MSG format with whole versions of Lotus Notes NSF and Outlook file without any problem.\nFree download it here: "}, {"author": "851930785", "created_at": "2018-09-27", "text": "True that software is great but I’ve tried esoftTools NSF to PST Converter t to convert my NSF files and it worked great. And it supports all version of MS-Outlook and Lotus Notes server. And it is also free of cost. You can also try yourself from here:  "}, {"author": "773237314", "created_at": "2018-08-17", "text": "NSF to PST Converter programming is the easy to understand and best app that encourages you in giving a conceivable expert answer for such issues. This tool effortlessly and securely Export Lotus Notes email messages, contacts, schedules, notes, errands and so on from NSF record to Outlook PST. You can check the see of NSF record. you would nsf be able to document in numerous PST records. This product is reasonable for the fledgling client and in addition in fact sound clients. Visit : "}, {"author": "832272235", "created_at": "2018-08-16", "text": "My sister got this issue 2 weeks ago and he searched many solutions on the internet and she got NSF to PST Converter and find the solution to his problem. You can simply give a try to this tool. Hope you will get the solution.Visit: "}, {"author": "823062661", "created_at": "2018-08-11", "text": "I understand your situation and that’s why recommending you NSF to PST Converter. Last Month, I used this tool on the advice of my technical friend.Visit: "}, {"author": "769693426", "created_at": "2018-08-09", "text": "To migrate Lotus notes NSF file to Outlook PST formats, you can try Kernel for Lotus Notes to Outlook Converter software. Try it from here: "}, {"author": "824139154", "created_at": "2018-08-08", "text": "I must say according to my experience, NSF to PST Converter is the best-suited solution to your problem. Once use this tool. I hope you will get the quick solution to your problem.Visit Here: "}, {"author": "768129235", "created_at": "2018-05-17", "text": "Hello!Its good if you found reliable software for Lotus Note NSF to PST Conversion. Here I am not going to recommend any other software but would like to share manual method which users can use to convert NSF into PST format without any expense.Check manual method:  "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36352108-outlook-have-replies-set-usable-in-main-search", "header": "Outlook - Have replies set usable in main search", "idea_text": "After migrating from Google Suite, Our Sales team needed to be able to search for emails with the internet header \"Reply-to\".  Outlook can do this via the Advanced search and using the field \"Have replies set to\".  However, it would be nice to have it usable in the main search box, or in the \"More\" option under \"Refine\" section on the \"Search\" ribbon.", "author": "876532783", "created_at": "2018-12-21", "votes": 0, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33712690-allow-work-email-office-365-to-login-into-win10", "header": "Allow Work email (Office 365) to login into Win10 without being tied to Live.com account!", "idea_text": "To login to windows my email must be tied to live.com account.  So if I have an Office365 account, I have two one drive accounts and I get emails of One Drive and don't know if it is for work or personal account.  It would be great for SMEs to have one Office365 account to control the computer.", "author": "769266898", "created_at": "2018-03-22", "votes": 1, "reaction": [], "comments": [{"author": "821009980", "created_at": "2018-07-06", "text": "But you can do that already if you are a Business Professional user:\n- Register your O365 user in Azure\n- Log-In with your user\n- This approach is very bare-bones I know (because I don't remember exactly how I did it)\n- If you follow that path, you should be able to do it in no time "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36557533-helping-with-homework", "header": "helping with homework", "idea_text": "writing summart", "author": "880407991", "created_at": "2019-01-17", "votes": 0, "reaction": [], "comments": [{"author": "880407991", "created_at": "2019-01-17", "text": "writing essays"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33607324-add-julian-dates-to-the-calendar", "header": "Add Julian dates to the calendar.", "idea_text": "Please add Julian dates to the calendar.", "author": "765716569", "created_at": "2018-03-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37375591-eml-to-office-365-migration-easily-import-eml-to-o", "header": "EML to Office 365 migration Easily Import EML to Office 365- Bitdataconversion", "idea_text": "For EML to Office 365 and Live Exchange server migration, I would like to suggest try Bitdataconversion EML to converter tool that also converts EML to PST, and MSG format. It has a free trial and a good technical support team as well.\nFor more info visit here: \n", "author": "882268549", "created_at": "2019-04-15", "votes": 0, "reaction": [], "comments": [{"author": "912766525", "created_at": "2019-08-07", "text": "Here is the right way to convert EML to Office 365 so you can Mac EML to PST Converter software for all those users who want to convert EML emails into Outlook PST. The software is offering the safest and most prominent way to import all mailbox items of EML data into the new output PST data that you can save at the desired location. and then you can easily move PST file in Office 365. For more information: \n"}, {"author": "901972069", "created_at": "2019-07-03", "text": "EML to PST Converter software is one of the popular and safe solutions that allows migration of multiple EML files to PST. This software provides you rapid conversion facility without any third-party tool support. The utility is very easy to handle without any difficulty.More info visit here;- "}, {"author": "903879928", "created_at": "2019-06-01", "text": "I must say according to my experience, EML to PST Converter is the best-suited solution to your problem. Once use this tool. I hope you will get a quick solution to your problem.For more info: \n"}, {"author": "837969550", "created_at": "2019-04-16", "text": "EML to PST Windows 7 Software that has the advanced procedure to the converter method. This application does not make any changes during the converter procedure. It changes your EML file into different – different file formats such as PST, MBOX, and NSF file formats. For more details, you can visit here: "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33124999-why-isn-t-customer-manager-in-the-business-center", "header": "Why isn't Customer Manager in the Business Center or at least in the tiles like Yammer and Forms?", "idea_text": "I upgraded my subscription, thinking everything would be integrated since Office 365 is one company. Instead, I have to DOWNLOAD Customer Manager instead of accessing it like I do mail, calendar, people, delve, onedrive, etc. Why wasn't it rolled out online like the rest of the apps in the Office 365 suite? Worse yet, why isn't it in the Business Center page so that it links with Office Connections? What is the use of a CRM (lite) that doesn't automatically talk to a newsletter app? At this rate I could have just purchased them separately from two different companies (e.g. Insightly and MailChimp). Please stop rolling out half-baked products; it's a bait and switch when you advertise all these platforms talking to each other and they're not even all available in the same place and talking to each other!", "author": "747409921", "created_at": "2018-01-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33182551-configuration-of-dom%C3%A4ne-route-subdomain-to-ip-wi", "header": "Configuration of Domäne - Route Subdomain to IP with different Ports", "idea_text": "     elektronik-hannes.de:80 -> 123.123.123.123:80\ntest.elektronik-hannes.de:80 -> 123.123.123.123:44", "author": "750149608", "created_at": "2018-02-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33223954-mailbox-last-account-activity", "header": "Mailbox last account activity", "idea_text": "This is notify that Microsoft office365 does not features like but google already have from the last 10 years. \nOffice 365 users does not have the option to find the last mailbox sign in account activity from there webmail/OWA or Outlook options . This also very helpful for the users if somebody access there account anonymously or some attempt of hacking happens to users accounts.\nThis option helps very much to revoke the remaining sign in activity  the mailbox. Also if it is good to understand the last sign in mailbox activity IP Address.", "author": "402946447", "created_at": "2018-02-06", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33167735-payment-via-bank-account-not-available-in-the-neth", "header": "Payment via bank account not available in the Netherlands Office 365", "idea_text": "It is not possible to pay via bank account for customers in the Netherlands for office 365 users.", "author": "749642351", "created_at": "2018-02-01", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33183727-add-notes-feature-in-outlook", "header": "Add Notes Feature in Outlook", "idea_text": "Please add note feature in MS Outlook, where you can right click on a message and write a note about the email, similar to the way you can add cell notes in Excel.", "author": "750190486", "created_at": "2018-02-02", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37882300-allow-outlook-365-to-import-e-mails-from-an-ost-f", "header": "Allow Outlook 365 to import e-mails from an .ost file.", "idea_text": "There is at least 5 third parties offering softwares in your foruns. Shame on you, MS.", "author": "906725230", "created_at": "2019-06-11", "votes": 0, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33244615-calendar-invitations", "header": "Calendar Invitations", "idea_text": "When third party services send calendar invites (.ics) to Microsoft based services like LIVE or Outlook 365, it does not provide an option for users to \"Accept, Tentative or Decline\" like it does when an invite is sent from services like google calendar. It typically shows an \"unsupported calendar.ics and the invite.ics\" attachment only which also does not seem to upload to the calendar when attempted manually.Ive contacted support whom recreated the issue and said that someone would contact me with a resolution at some point. Please make this a default feature for all users of this service. Thanks in advance", "author": "752726749", "created_at": "2018-02-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33403189-integration-of-staffhub-with-power-bi", "header": "Integration of StaffHub with power BI", "idea_text": "staffhub integrates to power bi in one data base.", "author": "758742580", "created_at": "2018-02-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33301345-bookings-as-add-on-service", "header": "bookings as add-on service", "idea_text": "Make Bookings an add-on service license rather than just bundling with other licenses", "author": "754898374", "created_at": "2018-02-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33399475-problem-with-local-currency", "header": "Problem with local currency", "idea_text": "In Ukraine for business there is no possibility to pay in UAH. \nThe problem was solved in the local office by getting invoice for payment in USD. \nThe question to Microsoft stays: why private persons can pay in local currency and business not???", "author": "758608399", "created_at": "2018-02-21", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33351454-clients-are-requesting-business-center-offline", "header": "Clients are requesting Business Center offline", "idea_text": "I have been told that just having Business Center in the browser is not going to work for some clients. They want the ability to work offline on invoices etc.", "author": "732706168", "created_at": "2018-02-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33429283-annual-calendar-in-outlook", "header": "annual Calendar in Outlook", "idea_text": "Unfortunately, I miss an annual overview of all appointments in Outlook. This to quickly determine free times. Maybe synonymous for printing?\nThank you", "author": "759632704", "created_at": "2018-02-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33790600-enterprise-template-in-sharepoint-online-doesn-t-a", "header": "Enterprise Template in SharePoint Online doesn't allow to create folders Locally Error is \"Destination Folder Access Denied\"", "idea_text": "Created a new library in SharePoint online using Enterprise > Document center template. When tried to sync the library it came up with error that site is read only. was able to create the folder in cloud but not locally. When try to create folder locally on the library it came with error\"Destination Folder Access Denied\". Folder created in cloud were able to sync but with Pad Lock on. When created library in a different site template it worked fine.", "author": "771688570", "created_at": "2018-03-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33790603-enterprise-template-in-sharepoint-online-doesn-t-a", "header": "Enterprise Template in SharePoint Online doesn't allow to create folders Locally Error is \"Destination Folder Access Denied\"", "idea_text": "Created a new library in SharePoint online using Enterprise > Document center template. When tried to sync the library it came up with error that site is read only. was able to create the folder in cloud but not locally. When try to create folder locally on the library it came with error\"Destination Folder Access Denied\". Folder created in cloud were able to sync but with Pad Lock on. When created library in a different site template it worked fine.", "author": "771688570", "created_at": "2018-03-29", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34827142-skype-description-for-office-365", "header": "Skype description for office 365", "idea_text": "I know the subscription is only for world 60 mins. I t would be nice if there are choices to be made for individual countries.", "author": "823618252", "created_at": "2018-07-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34008559-office-365-group-sites-listing", "header": "Office 365 group sites listing", "idea_text": "I want to see listing of group sites created in the admin center. As of now, i can see only site collections created under SharePoint Admin Center.", "author": "778869577", "created_at": "2018-04-19", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34050346-outlook-2016-contact-people-view", "header": "Outlook 2016 Contact: People View", "idea_text": "On the reading pane, make sure all the contact information is showing by default rather than having to click the contact or the arrow to show all information. It used to do this before but one of the outlook update changed it. ", "author": "780401773", "created_at": "2018-04-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34034170-availability-of-business-center-esp-connections", "header": "Availability of Business Center, esp. Connections", "idea_text": "Any hints on availablitiy / release dates in German Office 365 installations?", "author": "779895664", "created_at": "2018-04-23", "votes": 1, "reaction": [], "comments": [{"author": "821009980", "created_at": "2018-07-06", "text": "As shared in a post here regarding Europe from October 2017(!!):\n- They are considering expanding the reach if they see BC mature enough\n- Yeah, it's vague, to say the least, but please remember, they said it, not me :-)"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36038257-create-the-justify-alignment-for-onenote", "header": "Create the \"Justify\" alignment for OneNote!", "idea_text": "Its a very basic formating tool!!", "author": "870113707", "created_at": "2018-11-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34399270-the-changes-made-to-outlook-and-one-note-in-the-la", "header": "The changes made to outlook and one note in the latest update destroyed my admin system and now I can't save my emails in one note.", "idea_text": "I am paying for office 365 premium business and I insist to have my outlook and one note as it was before the latest update which was unnecessary and is destroying the admin in my business. I can't save my emails to one note as before and I also can't get my files [notebooks] from one note. Why are you always changing things which is working perfectly well. One note was perfect but it is now turned into rubbish. Why ? I still have one note working on my one computer and I am now refusing any updates because AI cannot afford to loose my notebooks or waste hours to get to them. Should I at least have a say in what I get for my money ? You have no respect for your customers. ", "author": "792317014", "created_at": "2018-05-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34055974-the-new-android-outlook-app-is-going-in-the-wrong", "header": "The new android Outlook app is going in the wrong direction", "idea_text": "I loved the Outlook app on my Android UNTIL the last update !  Now, there are NO contacts.  I click on the magnifying glass, ask for contacts, and there are only 2 (totally old, never used, irrelevant) contacts shown, along with a bunch of emails (again, irrelevant and I asked for CONTACTS, not emails).  I have to yet hit another click on Contacts to get to another screen to find what I was looking for.  And to enter a contact.  Aargh.  What took little time now takes longer.Already, since MS got rid of their MS Phone, and without an app like 4team, to sync Outlook Contacts to my Phone Contacts, I have many clicks in outlook to Add a contact ... you just made it HARDER with more clicks to enter a contact on the phone.  Also, please do not try to emulate Google... I go with MS because I DO NOT want the frustration of linking all emails so you can't find the one you want.  Stay compartmentalized... that helps me go fast.  When I ask for emails, your search on emails is GREAT... when I ask for Contacts, keep it to contacts !  Please, may I regress back to the last Outlook for Android ?  Please, take this as my input, I love MS but I go with your rather complex (and highly capable) s/w to NOT go with Google.  \nTHANK YOU.  :-) Tara", "author": "780565816", "created_at": "2018-04-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34527331-allow-office-365-accounts-to-access-virtual-labs-t", "header": "Allow Office 365 accounts to access Virtual Labs training site.", "idea_text": "It would be nice for Office 365 account holders to be able to access Microsoft's Virtual Labs training site.\nCurrently while logged into one's Office 365 account and going through Microsoft's online training on Excel, one can run across a link to Virtual Labs for further training.  When clicking on that link the seamless experience suddenly stops. You get to a site where you're no longer signed in and are unable to go to the links without signing in. When you try to sign in with your Office 365 account you get the dreaded \"That Microsoft account doesn't exist. Enter a different account or get a new one.\"\nExcuse me?! My account that I'm logged into on every other Microsoft site, my Windows 10 computer, and my Office applications does not exist, really? How rude!\nThis does not make for a great experience, and it is kind of confusing to be told your account does not exist when it so clearly does.\nTo be trained further one must either use an existing MS account, or create a new one.  Worse still people are likely to create the new account with the same email thereby creating two MS accounts (one Office 365, one a \"real\" MS account) with the same email which could create issues down the road as they can have different passwords.\nThat's it, thanks for the great products!", "author": "805967929", "created_at": "2018-06-12", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34501276-using-exchange-online-plan-1-for-email-for-my-fami", "header": "Using Exchange Online Plan 1 for email for my family. Want to use Office365 Home.", "idea_text": "I use Exchange Online to provide email for my family rather than use a stand alone service. It works well. However, my personal Microsoft account won't allow me to add the email concerned as an alias (no \"work\" email accounts allowed - even though it's actually a personal one) and that will pose a problem for buying an Office365 Home Premium subscription for us to use. I don't want to have to pay enterprise prices for home use, I don't want to have alternative email addresses just for Office365, and I don't want to have to use a different mail solution because exchange works so nicely. Any ideas as to how this can be don?", "author": "805166296", "created_at": "2018-06-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34451212-please-allow-onedrive-for-mac-to-share-files-from", "header": "please allow onedrive for mac to share files from onedrive app", "idea_text": "", "author": "795635704", "created_at": "2018-06-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34079752-while-using-bookings-we-should-be-able-to-create", "header": "While using Bookings, we should be able to create a new campaign by COMPANY contacts.  I would use this extensively,", "idea_text": "When I saw the \"Create a New Campaign\", I was excited, however, I soon found out that I was unable to target my campaign to contacts within a company.  I need the ability to start a campaign and target it to individuals who work for companies in my contact list to make it most effective.", "author": "781223830", "created_at": "2018-04-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34509169-onedrive", "header": "Onedrive", "idea_text": "Bonjour\npourra t on a voir une possibilité de sélectionner une période dans le corbeille de Onedrive \nexemple  :\ndu 01/01/2018 au 31/05/2018\nMerci d'avance", "author": "805460425", "created_at": "2018-06-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34550050-allow-office-365-and-windows-tech-support-teams-to", "header": "Allow Office 365 and Windows tech support teams to work together on customer issues; allow customer to contact tech support rep for followup", "idea_text": "We have had 2-year ongoing issues on multiple networked computers since updating to Windows 10 and installing Office 365 for Business--defective Windows 10 installs, resultant glitches with software installations, and problems with One Drive for Business and with Sharepoint syncing.  We have been repeatedly \"ping-ponged\" back and forth between your Windows tech support team and your Office 365 tech support team during the entire time. MICROSOFT, you are one company! You need to allow your tech teams to work together when business customers have problems that cross over from Windows issues to Office 365 issues, and not tell the customer to call back and forth between the teams. This only results in nothing getting accomplished and everyone involved (your customers and employees) getting frustrated and irritated. This is a total time-waster for everyone involved. Also, once a tech support rep figures out the problem and resolves it, the customer should be able to contact that same rep via email if any issues remain or followup is required, as the rep is familiar with the case details and what was already done to resolve the issues. Then the followup would be quicker and smoother for everyone, too.", "author": "806500702", "created_at": "2018-06-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35858788-please-allow-admin-to-change-name-of-onedrive-dire", "header": "Please allow admin to change name of Onedrive directory name", "idea_text": "Please allow global administrator to be able to rename the name of the Onedrive account / directory. Currently it defaults to Onedrive - Company name. We are using multiple Onedrive accounts which all default to the same name with a (n) extension and would like the ability to be able to rename the account / directory so each Onedrive account can be clearly identified. ", "author": "864202312", "created_at": "2018-10-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35845663-integrate-other-microsoft-products-into-the-collab", "header": "integrate other microsoft products into the collaboration options that are available in Sharepoint and word.", "idea_text": "", "author": "863713942", "created_at": "2018-10-28", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35262886-invoicing", "header": "Invoicing", "idea_text": "Add expanded lines to allow for description of product/item. Allow for removal of \"unit\" or \"quantity\" column.", "author": "845734525", "created_at": "2018-08-31", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37300663-improve-technical-support", "header": "Improve technical Support", "idea_text": "Provider Contacts who can help if you have more than one Problem at a time!\nIn my Case, dozens. Presumably all due to a Basic Problem. But the Structures within Support do not allow Editing. So far, all Tickets have been terminated unsolved. For almost two Years.", "author": "892665196", "created_at": "2019-04-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35230351-edbmails-edb-to-pst", "header": "EdbMails EDB to PST", "idea_text": "So you’ve been searching throughout the internet and happened to come across this post of mine, well if that’s the case the let me take the liberty to assume your being here has something to do with exchange recovery, if so, read ahead . As you must have noticed by now from the very many blogs on internet, what you need for flawless exchange server recovery is an EDB to PST Converter.Well that sounds simple enough but is rather time consuming process considering the fact that there are plenty EDB to PST Converters in the market.On advice of many a experienced exchange admins I decided to test out the EdbMails EDB to PST Converter. Make no mistake many a professional exchange administrators have recommended it to me and at the outset i must say that it managed to live upto the expectations i had.The many unique features it has coupled with the fact that the export operation takes place quicker compared to similar tool I’ve tried makes EdbMails a tool worth trying out.Knowing that i had a reliable EDB to PST Converter tool with me for handling cases of exchange corruption made life rather easy as an exchange admin. If you’ve read till here then you must have already understood that I am quite impressed with EdbMails myself.Basically it makes your life easier by allowing you to get out of any unfortunate exchange error scenarios with ease.EdbMails also boasts support for direct migration to Office 365 and Live exchange server making it a one stop exchange recovery solution. There is also a trial version to help you test out all the features of EdbMails and export upto 30 items per folder/mailbox.In short, as an exchange server admin i am glad that i followed the valuable advice given by my peers and tried EdbMails. Once you start using EdbMails, you’ll realize that its not just an exchange recovery tool but houses some other unique feature sets as well that makes it a must have utility in any IT administrator’s toolkit.  To know more about EdbMails visit : ", "author": "843013831", "created_at": "2018-08-28", "votes": 1, "reaction": [], "comments": [{"author": "769693426", "created_at": "2018-09-03", "text": "One can also try Kernel for EDB to PST Converter software. It can easily repair corrupted EDB file and convert them in PST formats without facing any issues. For more information about the software, visit: "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36490090-create-way-to-share-multiple-accounts-when-we-have", "header": "create way to share multiple accounts when we have 5 users etc so can share 5 terrabyte", "idea_text": "", "author": "879126598", "created_at": "2019-01-10", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36481069-embed-fonts-on-mac-versions-of-word-2019", "header": "Embed fonts on mac versions of Word 2019", "idea_text": "You can embed fonts on PC versions of Word but this cannot be done on mac versions. Very frustrating that there are many more options available on PC versions of Word than on a mac.", "author": "878960320", "created_at": "2019-01-09", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35902546-receipt-to-customer", "header": "Receipt to customer", "idea_text": "Please, please give us the ability to automatically issue a receipt via email to the customer as you register a payment to their invoice.  This is especially important as often times our invoices will get paid in several installments and the client needs a receipt each time they pay.  It needs to automatically generate and be sent via email because we sometimes need a duplicate receipt as we deal with B2B also.", "author": "866096095", "created_at": "2018-11-03", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36515380-subscribers-logging-in-should-see-less-marketing", "header": "Subscribers logging in should see less marketing, more immediately useful information.", "idea_text": "On logging in to Office 365 as a subscriber, an installation link and information about the allowed number of systems should be obvious.  As it is, the web page shows considerable marketing, minimal useful information.", "author": "879636889", "created_at": "2019-01-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36515692-allow-for-re-arranging-service-types-on-the-bookin", "header": "Allow for re-arranging service types on the bookings page", "idea_text": "I entered our service types in a logical order when I set up our Bookings App, however, they appear in some random order when clients go to book. It would be helpful if the app either listed the service types in the order in which they were entered, or allowed for re-arranging them.", "author": "879649546", "created_at": "2019-01-13", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38460640-skype-meetings-define-in-different-colour", "header": "Skype meetings - define in different colour", "idea_text": "When setting up Skype meetings it would be useful to identify them more easily in the Calendar.  I work for someone who keeps missing them because he is used to people attending meetings in person.  Maybe having them stand out in the diary would make them more obvious.", "author": "914878834", "created_at": "2019-08-27", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38385199-in-onedrive-please-support-and-allow-files-that-a", "header": "In OneDrive, Please Support and Allow Files That Are Empty", "idea_text": "In OneDrive, Please Support and Allow Files That Are Empty.Currently, Files that are 0 bytes in size can't be uploaded from the OneDrive website.\nOneDrive will not sync or recognize \"empty\" files!!  (I think empty folders too)(why?!?I have MANY MANY simple text files with VALUABLE information in the Filename, but have nothing inside the file.  The information and DATA is in the filename.", "author": "914823079", "created_at": "2019-08-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36928615-extend-the-amount-of-activities-bar-in-the-ms-team", "header": "Extend the amount of ACTIVITIES BAR in the MS Teams", "idea_text": "In MS Teams; there is a limit to create a BAR pointing to some tools or applications and then it show \"more\".It seems that it is limited to 04 bars only and this could be extended to a little to easy its contents at once", "author": "885462256", "created_at": "2019-02-22", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36938419--inquire-add-in", "header": "\"Inquire\" add-in.", "idea_text": "I have Office 365 Business Premium. I'm told that I need to purchase Office 365 Professional Plus edition in order to access the \"Inquire\" add-in, which would be a step backwards in terms of functions. Can you allow me to access the \"Inquire\" add-in with Office 365 Business Premium?", "author": "885625000", "created_at": "2019-02-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38385487-microsoft-teams-needs-to-implement-a-way-to-pin-me", "header": "Microsoft Teams needs to implement a way to pin messages to the top or side!", "idea_text": "Slack allows users to pin messages to the top or side of the interface. Important messages in group chats in my company get lost as more people chat. I'd like the important messages to constantly stay on a right pane or on the top of the group chat until it gets unpinned.", "author": "914828083", "created_at": "2019-08-15", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36878596-one-drive-limitation-is-15gbyte", "header": "One Drive limitation is 15GByte.", "idea_text": "Noted of the limitation is 15GByte. Can I know have any work around solution,\nSince I have 1000G byte storage, example if I want to back up our ERP oracle dump file\nOr SQL backup file, those file normally are 30-100G, Please advise the solution, else I do\nNot see any benefit I join the one drive.\n", "author": "884756920", "created_at": "2019-02-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38389714-allow-guests-to-join-team-via-public-link", "header": "Allow Guests to Join Team via Public Link", "idea_text": "This is a must for us and would allow us to replace GotoMeeting.  GotoMeeting has a dedicated link that we use daily for external users and if we could generate a link and share it with guests, we would turn off our Gotomeeting licenses.  This product is great and we only need a few things before we can use it exclusively.", "author": "914903449", "created_at": "2019-08-16", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37584169-onmicrosoft-com-domain", "header": "onmicrosoft.com domain", "idea_text": "Have the ability to change the onmicrosoft.com URL name as our company has changed names. We want to use sharepoint as our corporate intranet but the URL is irrelevant. We are not willing to start a new subscription and migrate. We have created a domain to address the email domains but this does not fix the onmicrosoft.com domain nameex. We want to change hotdogs.sharepoint.com to ", "author": "899410615", "created_at": "2019-05-08", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37675654-skype-integration-into-teams-with-new-features", "header": "Skype Integration Into Teams with New Features", "idea_text": "Objective is to easily organize incoming/outgoing calls, inbound/outbound call recording capability, phone and inbound/outbound text ability.", "author": "900926980", "created_at": "2019-05-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37721623-affects-outlook-365-print-of-an-email-only-the-f", "header": "Affects OUTLOOK 365, Print of an email, only the first page", "idea_text": "Affects OUTLOOK 365, Print of an email, only the first pageE-mail traffic gets longer and longer, up to more than a dozen pages, the more you write again and again, because the previous messages are usually not deleted.\nThis is very good, so you can get an overview of the information from the beginning.\nIf I get a new message with all the information from the background, I just want to print the new information, but not the many pages before, because I have already printed it out.\nIn Outlook, I would like to see a print command that only prints the latest (first) page.\nTyping with the work-arround via \"Print,\" \"Print Options,\" PopUp \"Print,\" typing \"Pages\" and then \"1\" before the print command can be given is very cumbersome.\nOr do I already have a possibility in the current Outlook that I don't know yet?\nThank you for a helpful answer, regards Helmut Wehking.\n", "author": "901856374", "created_at": "2019-05-23", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37674337-print-surveys", "header": "Print surveys", "idea_text": "We need to be able to print surveys we create in forms, as not all employees have email.", "author": "900906340", "created_at": "2019-05-17", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37571218-need-option-to-migrate-previous-outlook-calendar", "header": "Need option to migrate previous Outlook (Calendar & Contacts) with emails to Outlook 365", "idea_text": "When upgrading to Office 365, need option to migrate previous Outlook (Calendar & Contacts) with emails to Outlook 365", "author": "899179588", "created_at": "2019-05-07", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37833643-excel", "header": "Excel", "idea_text": "Excel Freeze ShortcutNew Excel Issue\nMicrosoft Office 365 Business \nVersion 1905 (Build 11629.20214 Click-to-Run) \nMicrosoft Excel for Office 365 MSO (16.0.11629.20210) 32-bit \nProduct ID: 00265-80200-00761-AA969Last two updates of Office 365 for Business has an issue which causes Excel to Lock the keyboard. Keyboard be unlocked by using Mouse. or ALT-TAB to change screens and return.\nIssue is using Freeze Pane, Freeze Row, or Freeze Column using the Short Cut Key Stroke. Issue does not occur when using Mouse. Short Cut Key Stroke is: ATL-W (View) F (Freeze) then F, R or C (for Pane, Row, or Column) The Shortcut letters of F, R & C will remain on the screen and the keyboard is locked.Just extremely tired of every other Office update creating a new problem.", "author": "833012356", "created_at": "2019-06-05", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37833496-how-about-microsoft-software-programmers-learn-how", "header": "How about Microsoft software programmers learn how to test; or hire tester who now how to fully test before an update is released.", "idea_text": "How about Microsoft software programmers learn how to test; or hire tester who now how to fully test before an update is released.", "author": "833012356", "created_at": "2019-06-05", "votes": 1, "reaction": [], "comments": [{"author": "833012356", "created_at": "2019-06-05", "text": "Microsoft Office 365 Business\nVersion 1905 (Build 11629.20214 Click-to-Run)\nMicrosoft Excel for Office 365 MSO (16.0.11629.20210) 32-bit\nProduct ID: 00265-80200-00761-AA969"}, {"author": "833012356", "created_at": "2019-06-05", "text": "Last two updates of Office 365 for Business has an issue which causes Excel to Lock the keyboard.   Keyboard be unlocked by using Mouse. or ALT-TAB to change screens and return.Issue is using Freeze Pane, Freeze Row, or Freeze Column using the Short Cut Key Stroke.   Issue does not occur when using Mouse.   \nShort Cut Key Stroke is:  ATL-W  (View)   F (Freeze)   then F, R or C (for Pane, Row, or Column)\nThe Shortcut letters of F, R & C will remain on the screen and the keyboard is locked.Just extremely tired of every other Office update creating a new problem."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38302933-outlook-move-folder-without-confirming-with-yes", "header": "Outlook: Move folder without confirming with Yes", "idea_text": "", "author": "913431739", "created_at": "2019-08-04", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38261197-make-it-available-in-rest-of-the-world", "header": "Make it available in rest of the world.", "idea_text": "", "author": "912756271", "created_at": "2019-07-30", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38672074-excel-365-for-mac-does-not-have-power-query-and-po", "header": "Excel 365 for Mac does not have Power Query and Power BMI", "idea_text": "I am a yearly subscriber to Office 365 for Mac since December 2018 and I am still operating Office 2010 on my Windows 7 Pro ASUS Notebook.As a MAC Office 365 user, I am one of 1 million people who have moved from the Windows PC to Apple MAC.When i subscribed to Office 365 for MAC, I expected Office 365 for MAC to contain the same intermediate to advanced features as Office 365 for Windows.  I was very disappointed that Microsoft Excel 365 for Mac does not have the POWER QUERY FUNCTION; POWER BMI FUNCTION and the Visual Basic functions on Excel 365 for MAC are very limited.I feel that as an Office 365 for MAC subscriber, I have been shortchanged or cheated.  Under consumer law, Office 365 for MAC is not fit for a particular purpose.  Excel 365 MAC users cannot use the POWER QUERY to merge 5 Excel worksheets into the one worksheet after they have exported a wide range of data from an accounting software package in Excel form.When will Excel 365 for MAC include the Power Query functions??PAUL", "author": "921390754", "created_at": "2019-09-24", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38678245-when-are-you-going-to-enable-changing-the-font-siz", "header": "When are you going to enable changing the font size of Folder titles?", "idea_text": "", "author": "921480010", "created_at": "2019-09-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38677936-one-drive", "header": "ONE DRIVE", "idea_text": "as a admin center i would like to see different users added on in the admin accounts has own name after the company name showing in our drive C ( desktop) so it makes us easy to manage them as our separate department and assign the job for them. I love 365 so much. It make so easy for small business owner and cheap  great customer services .", "author": "921474796", "created_at": "2019-09-25", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33831652-allow-personalized-icons-for-tagging-in-one-note", "header": "Allow personalized icons for tagging in One Note", "idea_text": "Allow a person to add icons for tagging in One Note.  Or at least add a shopping cart, a symbol for job, a symbol for a city, and something for sports (a football, or maybe multiple sports symbols).", "author": "773166568", "created_at": "2018-04-02", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33932839-not-able-to-create-url-link-on-invoice-for-custome", "header": "Not able to create URL link on invoice for customer to click and pay!", "idea_text": "When creating a new invoice, there is not a way to create a hyperlink for the customer to click on when they receive the invoice.  At the VERY least add rich text option in 'Notes for Customer'!", "author": "776476291", "created_at": "2018-04-12", "votes": 2, "reaction": [{"status": "working on it", "author": "398985916", "created_at": "2018-05-07", "note": "Hello and thank you for your feedback!\nWe’re currently working on something that will hopefully suit your needs for making it easy for your customers to pay the invoice. This will be available in a few weeks, we expect.Meanwhile, did you know that you can add a link to get paid through PaylPal already today? In the settings for Invoicing, you can add PayPal as an online payment service, if you already have an account. This will then add a link to your invoices that your customers can click."}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33757996-upload-your-own-letterhead-for-invoice-and-estimat", "header": "Upload your own Letterhead for invoice and estimates", "idea_text": "As someone who offers design services, it'll be awesome to be able to upload our own letterhead to our invoices and estimates and have more control of how our invoices look like.", "author": "770660551", "created_at": "2018-03-26", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/38691028-we-just-started-using-the-bookings-feature-it-do", "header": "We just started using the Bookings feature.  It does not list the name of the client.  It lists the name of the service they are getting.", "idea_text": "We need to see the clients name.  We take multiple clients at one time and also if they call and ask what time their appointment is we have to click each one in order to find their appointment.  If there is not a fix for this I'll have to go to another vendor.", "author": "926360638", "created_at": "2019-09-26", "votes": 1, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34151992-link-emails-to-tasks-in-outlook", "header": "Link emails to tasks in outlook", "idea_text": "A simple drag and drop option to link emails to a task, currently i create tasks by either flagging an email for follow up (then i can't edit the task easily) or by creating a new task (can't link emails related to the task).  if i could create a task and then drag the email to link to it, when i open the task i can quickly see all related communications.  any other emails in the conversation would automatically link up also.", "author": "783823699", "created_at": "2018-05-04", "votes": 2, "reaction": [], "comments": [{"author": "919129225", "created_at": "2019-09-09", "text": "I was able to drag and drop an email into a task, edit the task and add more emails, documents, photos, etc.  MS Outlook desktop version  Now recently a change was made to Office 365 and I can't even edit a task the way I used to.  It's a horrible change. I wish they would change it back.  The to-do view doesn't allow you to edit a task the way I used to be able to in the tasks view.  I have an open support ticket and they are trying to resolve the issue.  Does anyone else know what I'm referring to Thank you"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34079713-i-would-like-to-have-the-ability-to-sort-my-contac", "header": "I would like to have the ability to sort my contacts by Company Name.", "idea_text": "Since I have multiple contacts within the different companies that are clients of mine, it would be most helpful if I could sort those contacts by company name, in addition to last name.", "author": "781223830", "created_at": "2018-04-26", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34079785-email-signature-to-include-book-now-for-mobile-e", "header": "Email signature to include \"Book now\" for mobile email signature would be great", "idea_text": "I was able to include a \"book now\" signature which included my booking page.  However, I am currently unable to use this on my mobile device.  Therefore, although I have an email signature on my mobile device, I do not have the advantage of having the \"book now\" page url redirect when I send emails from my mobile device.", "author": "781223830", "created_at": "2018-04-26", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34142890-please-activate-business-centre-for-australian-cus", "header": "please activate business centre for Australian Customers", "idea_text": "Dear Office 365 team,I am small business without a website. would love to use all the cool features for business center. ", "author": "783510886", "created_at": "2018-05-03", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34033633-viewing-call-pbx-call-log-for-skype-for-business-c", "header": "Viewing call PBX call log for Skype for Business CCE", "idea_text": "Have the ability for customers to see their Skype for Business CCE telephone logs. MS Support is able to see this information, but not customers. Can this option be enabled for customers?", "author": "779881075", "created_at": "2018-04-23", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34168858-outlook-customer-manager-functions", "header": "Outlook Customer Manager functions", "idea_text": "Hello. I am currently a CRM Salesforce user. Can anyone explain me more about the CMO? I watched several videos and none gives me a parameter. I want to know if it's worth it to exit Salesforce and start using the OCM. I am not talking about and comparing, similar quality, only if the OCM has the functions of Salesforce (customer registration, contacts, leads, contract values in R $, communication between the team in a given client, Pipeline reports, etc.) . Can anyone using the OCM explain the feasibility of the tool? Thanks!", "author": "784416145", "created_at": "2018-05-06", "votes": 2, "reaction": [], "comments": [{"author": "821009980", "created_at": "2018-07-06", "text": "I personally wouldn't recommend it:Esp. since:\n- The OCM has always been half-baked and might now even die\n- It even is no longer listed in the apps section of office.com\n- Why? Well If I'm not misled by Microsoft (would be no surprise), the myAdmin or whatever it is called might replace CMO in the near future\n- Maybe you guys can help to get some transparency out of Microsoft?"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35791774-onedrive-common-sense", "header": "OneDrive Common Sense", "idea_text": "The OneDrive should have the capacity to upload up to 100 GB files, or atleast make it 50 GB.   There are video files, and other types of files that are very large and there is a limit of 15 GB per file size for upload to the space, which is ridiculous in this day and age.Secondly; The Onedrive should have the capacity to only download on demand for both Apple and PC products, I know there is something for PC products but I cannot afford to have a 1TB drive download onto my Apple or Notebook PC just for using it.  That is so ridiculous its not even funny that MS has not implemented it already.  If my hard drive only has 500 GB space, then how am i supposed to use OneDrive if its nearly full?  Once files are uploaded, they should remain there unless they are being used, or the client must have the option to download a copy for offline use.Third: There should be backups of the OneDrive upto 30 days, just in case there is an error and someone overwrites a major file, such as a video file, or document, or maybe if a corrupt version is accidentally saved.  There should be some form of backtracking on a file to file basis for anything uploaded, so that not only is this OneDrive \"back Date Able\" but on a file to file basis and not just the entire drive.  If its not practical then atleast have a setting whereby 2 previous versions are saved and can be \"UNDOable\" based on timeframe set by the users.", "author": "861331573", "created_at": "2018-10-22", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35613742-allow-users-to-install-microsoft-office-365-busine", "header": "Allow users to install Microsoft Office 365 Business on Terminal Servers", "idea_text": "Our clients with Business Premium licenses can no longer use Office on terminal servers. This needs to change so that our users with a proper BUSINESS license can use MS Office on all devices within their organization.", "author": "854871718", "created_at": "2018-10-02", "votes": 2, "reaction": [], "comments": [{"author": "878713543", "created_at": "2019-01-07", "text": "Agree, companies under 300 users still use terminal servers."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35607061-ad-personalised-organization-contact-fields", "header": "Ad personalised organization contact fields", "idea_text": "For example, Schools have codes for students, Emergency contacts, and Office 365 gives the oportunity to give to Teachers or managers contact info anytime, anywhere when needed", "author": "854709082", "created_at": "2018-10-01", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35740411-create-multiple-business-profile", "header": "Create multiple business profile", "idea_text": "Can I create multiple business profiles in one 365 account? I have a couple of small businesses and it would not be worth buying a new license for every business since they are very small business.", "author": "858962824", "created_at": "2018-10-16", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36364501-please-add-cantonese-voice-input-for-dictate", "header": "Please add \"Cantonese\" voice input for Dictate", "idea_text": "Dictate is a great feature in Office 365, \"Cantonese\" voice input can serve much Hong Kong people", "author": "876762586", "created_at": "2018-12-23", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34605544-the-shared-section-for-business-to-personal", "header": "The shared section for Business to personal", "idea_text": "When I tried to share a folder in business OneDrive to personal OneDrive and it won't appear in my personal \"Shared\" section. I believe it is important when we need to keep the shared folder(s) with my personal OneDrive folders.", "author": "816274969", "created_at": "2018-06-19", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34476721-additional-contact-social-types", "header": "Additional Contact Social Types", "idea_text": "Please add LinkedIn, Twitter and Other as Social Types.  It helps to keep this information in one place for a Contact to more quickly define the strategy, language and metrics to use for reaching out to a Lead or Customer.  It also makes Contact more of a central point for Contact Research on an ongoing basis for updates versus having two sources of truth.", "author": "797089339", "created_at": "2018-06-07", "votes": 3, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35806945-allow-one-drive-to-send-notifications-via-email-wh", "header": "Allow one drive to send notifications via email when it stops syncing", "idea_text": "if running one drive on a headless pc or a remote pc/server and one drive stops syncing user won't find out until next time he logs into that pc which could be days or weeks, is there a way to setup notification via email when it stops syncing for any reason.", "author": "861905287", "created_at": "2018-10-23", "votes": 2, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33301495-selecting-multiple-contacts-to-send-emails-at-the", "header": "Selecting multiple contacts to send  emails at the same time.", "idea_text": "Utilize Office365 Group/ Distro List to send multiple contacts at the same time. O365 Groups and distro not working alongside with this feat", "author": "161637525", "created_at": "2018-02-12", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34662553-make-this-available-in-australia", "header": "Make this available in Australia", "idea_text": "We would like to see this available in Australia or at least be given an idea of if or when it will be available.", "author": "817966942", "created_at": "2018-06-25", "votes": 3, "reaction": [], "comments": [{"author": "916560049", "created_at": "2019-08-29", "text": "Please make Invoicing available in Australia"}, {"author": "838282030", "created_at": "2018-08-20", "text": "Frustrating that MS makes a big splash about business apps but then only restricts them to 3 countries.  !!??  Yes I want to use MS Connections - and likely lots of other apps - as part of my Office subscription."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35825899-excel-is-missing-personalized-filter-views-for-liv", "header": "Excel is missing personalized Filter Views for live collaboration", "idea_text": "Excel Online does not have a personalized Filter View? Can Microsoft implement the ability for each user to have their own filter view during \"Share\" or collaboration mode.  currently, all users see live Filter views which is cumbersome when collaboration in Excel Online.  Google Doc's already have a feature called \"Filter Views\" where each user can create their own Filter that is private during collaboration.  In addition, Google filter view allows you to save multiple filter views for future use, which is perfect.  WHEN will this feature be implemented? Road map dates for this feature should be published by the Developement team, otherwise, we will move our entire Business fleet over to G-Suite Google Sheets.  Please provide details timeline for this feature.  Again, Google has had this feature available for more than a Year, so Microsoft really needs to catch up.\nScreen shot below shows Google's Filter View:", "author": "862499818", "created_at": "2018-10-25", "votes": 3, "reaction": [], "comments": [{"author": "879640747", "created_at": "2019-05-05", "text": "This is duplicated here: "}, {"author": "879640747", "created_at": "2019-05-05", "text": "Yes I agree.  I receive support tickets regarding this regularly.  The issue being that with multiple users collaborating on an Excel spreadsheet, everybody's view of the spreadsheet is immediately changed when one user applies a Filter to a column.  Very unsettling, confusing and unworkable for users."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34789015-make-contact-lists-in-business-centre-exportable", "header": "Make contact lists in Business Centre exportable", "idea_text": "Business Centre has a major flaw. We took several days to enter our company contacts into the center directly (not imported from Outlook) only to find that the database so created could not be exported. At all. Not even 'cut and pasted' in batches. It was available only to use for the narrow group of functions within Business Centre. In this case, our specific need was a company bulk email. The Business Centre tool is not [nearly] as good as MailChimp or ConstantContact so we did not want to use it. Please make contact lists in Business Centre exportable.", "author": "822190435", "created_at": "2018-07-09", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34320160-email-signatures-for-all-users", "header": "Email Signatures for all users", "idea_text": "Have the ability to create email signatures for all users that doesn't use the disclaimer function. Make email signatures that sync with AD to have the ability to have names, job titles etc. Something like Exclaimer.", "author": "789874228", "created_at": "2018-05-22", "votes": 4, "reaction": [], "comments": [{"author": "817719850", "created_at": "2018-07-19", "text": "Please build this in to EAC."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34435069-allow-user-to-add-more-colors-to-the-color-categor", "header": "Allow user to add more colors to the Color Categories in Outlook.", "idea_text": "Allow user to add more colors to the Color Categories in Outlook.", "author": "795019738", "created_at": "2018-06-02", "votes": 4, "reaction": [], "comments": [{"author": "836743111", "created_at": "2018-08-17", "text": "\"Microsoft has determined that these 25 colors are the only ones you want to use.\" Wrong. I want to use different colors for my categories, and Outlook should make this possible."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36673828-enable-office-online-chat-feature-in-uk", "header": "Enable Office Online Chat Feature in UK", "idea_text": "As my tenant’s data centre is in UK the Office online chat feature is currently not available for my location.\n We have an educational licence and lots of users would find this feature useful", "author": "882125788", "created_at": "2019-01-30", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36560824-make-microsoft-office-update-dialog-more-meaningfu", "header": "Make Microsoft Office Update Dialog More Meaningful", "idea_text": "I just got a pop up in Windows 10 titled Office with the description that I needed to save my work before continuing.  Then it says We need to close the following Apps:  Microsoft Excel Microsoft Outlook, with just a continue or cancel button.  Before continuing what?  Come on Microsoft you can't at least give me a sense of what is going on?  Just continue without any knowledge of what I'm continuing?   My idea is to make these dialog box more descriptive.  I mean there is no information at all as to what's going on.  Whoever thought it was a good idea to just have a random dialog pop up with no description of what is going on and why needs to be fired.", "author": "880457929", "created_at": "2019-01-18", "votes": 6, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35172142-opportunity-to-save-an-outlook-email-with-attachme", "header": "Opportunity to save an outlook email with attachments in a Sharepoint document library", "idea_text": "Offer us the opportunity to save an outlook/OWA email (with its attachments) in a Sharepoint document library, so that it can be found in the search results.. \nThnx in advance.", "author": "838602109", "created_at": "2018-08-21", "votes": 4, "reaction": [], "comments": [{"author": "742838899", "created_at": "2018-11-06", "text": "This has been a user request for at least the last 10 years and beyond. There are add-ins out there and some are even free, but in a mission critical application you can't have an update disable the add-in or the add-in vendor decide to fold up shop. We need to be able to copy/move an email from Outlook to a SharePoint Library and add meta data so it can be associated with other documents and lists in the SharePoint Application. This should have been made available by Microsoft long ago."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36438904-bookings-several-bookings-in-the-same-slot-with", "header": "Bookings - Several bookings in the same slot (with the same staff calendar)", "idea_text": "Currently, we can only make one booking per slot per staff user. Should be available the option to set the number of bookings possible per slot per staff user.", "author": "878076286", "created_at": "2019-01-03", "votes": 4, "reaction": [], "comments": [{"author": "897260707", "created_at": "2019-04-27", "text": "I am not sure if same request - but I want to be able to have lots of staff, book into the one slot - eg a training session, but limit how many can book"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36608395-onedrive-business-should-work-the-exact-same-way-o", "header": "OneDrive Business should work the exact same way OneDrive Personal works, not convert into SharePoint when sharing folders", "idea_text": "OneDrive Business should work the exact same way OneDrive Personal works, not convert into SharePoint when sharing folders. It's called ONE drive for a reason, not TWO Drive.", "author": "881181934", "created_at": "2019-01-23", "votes": 4, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33307213-add-business-center-to-enterprise-e3-customer", "header": "ADD business center to Enterprise e3 customer", "idea_text": "IF i pay more for office 365, e3, because i wanted a better version of business premium, THEN WHY DO I GET PENALIZED and not get the newer products that are offered to small businesses? I am a small business EXCEPT I wanted to FULLY INVEST into microsoft to get the best out of the best for our 8 employees. WHY CAN I NOT HAVE ACCESS TO BUSINESS CENTER!??!?!", "author": "435037657", "created_at": "2018-02-13", "votes": 13, "reaction": [], "comments": [{"author": "795823573", "created_at": "2018-06-05", "text": "I definitely agree with you!! I was disappointed to find out that in order to move our voice services over to skype for business, we had to change to an enterprise subscription thus losing out on Business Center.  Its definitely a good move for our company to pull voice into office365, but I have a several sales clients that like the outlook customer manager and we use business center a lot!!  I do understand some of hour microsoft has integrated many independent platforms together as seamless as possible, but I don't understand why it cant be an addon option for enterprise."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32202253-contact-email-address-should-allow-personal-and-wo", "header": "contact email address should allow personal and work", "idea_text": "Allow different types of email address as you do for phone. At least work as well as personal (currently only allows personal). Maybe add 'other' as catch all.", "author": "700491799", "created_at": "2017-11-09", "votes": 7, "reaction": [{"status": "in the plans", "author": "", "created_at": "2017-11-15", "note": ""}], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/34977868-dark-background-theme-in-office-365", "header": "Dark background theme in Office 365", "idea_text": "Please add the option like in Office 2016 to change the background in the apps to dark.  The white background is very irritating to someone who has to stare at the spreadsheets all day long.  PLEASE do this.  Fewer headaches for all.", "author": "828662602", "created_at": "2018-07-31", "votes": 7, "reaction": [], "comments": [{"author": "880139605", "created_at": "2019-01-16", "text": "Definitely need this. It's a basic accessibility feature!"}, {"author": "868066789", "created_at": "2018-11-12", "text": "I totally agree"}, {"author": "853393219", "created_at": "2018-09-27", "text": "More than Very Much Agree!"}, {"author": "834684478", "created_at": "2018-08-13", "text": "Please do! I usually have a dark background for email and now it really hurts my eyes."}, {"author": "831373567", "created_at": "2018-08-07", "text": "Yes! This should be a basic feature on the Office 365 apps online. Consider dark background options for the apps as part of accessibility (ergonomics, eye strain, migraines, light sensitivity, etc.).  Only so much can be done by changing monitor settings. \n"}, {"author": "828883306", "created_at": "2018-07-31", "text": "Very much agree."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/36870892-give-me-a-way-to-get-my-old-ribbons-back", "header": "GIve me a way to get my old ribbons back.", "idea_text": " I've spent years learning and using the old ribbons, and they are a productivity tool.  I understand new users may want simplier ribbons, but experienced users don't.  Make it an option somewhere in Office 365.", "author": "884601616", "created_at": "2019-02-16", "votes": 7, "reaction": [], "comments": [{"author": "916515835", "created_at": "2019-08-29", "text": "These ribbons look like you had an intern design and implement them.  Not only are they confusing when you sit down the next day after update attempting to locate things visually,  they are an eyesore.  During this update you also botched a few other things,  for example when selecting a calendar and changing the view to say list mode,  the tick boxes on the calendar list disappear and make you guess where to turn another calendar on and off again.  I would assume that Microsoft spends it's time thinking of and developing ways to change the software to increase productivity as opposed to just randomly changing insignificant items to appease the small percentage of the user base with 40\"+ monitors for graphic scalability.  Also stop trying to be Mac,  you're not and there's a reason they've been slipping recently.  Learn from it."}, {"author": "911805490", "created_at": "2019-07-22", "text": "The new ribbon looks like it was designed by Fischer-Price for toddlers. Toddlers need big clunky buttons because they lack coordination, not so much adults using an office productivity app. I've read that the new ribbon is to accommodate different device resolutions, OK, why can't I decide on the size and resolution that I find best for me, it appears to be automatic. Apple detractors dislike their products because of the \"our way is the only way\" philosophy,  Microsoft is now racing down  the same path. There is no way this was tested with a focus group containing anyone over the age of 30."}, {"author": "911504872", "created_at": "2019-07-19", "text": "Totally agree, not only that, the new ribbons are just hideous.  Who decides these things?  And why don't we get a vote?"}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/35397571-add-outlook-customer-manager-business-apps-to-the", "header": "Add Outlook Customer Manager (Business Apps)to the Office 365 E3 & E5 plans", "idea_text": "Why do we need to downgrade a Enterprise Plan to get a feature that is included in a lower package?", "author": "850229104", "created_at": "2018-09-13", "votes": 7, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33177589-sync-business-manager-with-outlook-contacts-peo", "header": "Sync Business Manager with Outlook Contacts....People App.,..and Bookings", "idea_text": "We connected QuickBooks and Business Manager brought in all the contacts from QuickBooks, but there should be a natural integration with Outlook 2016 and the People App. Bookings App also does not sync with the Bookings in the Business Center. These should all be natural integrations. Flow should also be another natural integration with Business Manager.", "author": "749804407", "created_at": "2018-02-01", "votes": 10, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33182785-sync-client-outlook-signatures-with-office-365", "header": "Sync Client Outlook Signatures with Office 365", "idea_text": "Enable signatures to be set up in Office 365 so that they are synced with Outlook (2016 or other) client.  This way, companies can centralize signatures, changes, messages (e.g. company closures, etc.- though these can probably be executed through the disclaimer section).", "author": "750156844", "created_at": "2018-02-02", "votes": 8, "reaction": [], "comments": [{"author": "817719850", "created_at": "2018-07-19", "text": "Please have all client apps sync signature from O365."}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33159892-delete-email-campaigns", "header": "Delete Email Campaigns", "idea_text": "A few of my customers and I have noticed there are no options to delete email campaigns within Connections portion of Business Center. Working through the proof of concept and getting a feel for the product has left us with over 7 pages of campaigns. It would be great to have better control of how these are viewed and the ability to remove irrelevant campaigns. ", "author": "749286784", "created_at": "2018-01-31", "votes": 9, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/33079345-customer-relationship-management-crm-for-office", "header": "Customer relationship Management \"CRM\" for Office 365", "idea_text": "Please include a feature to upload documents in Word or PDF to a company contact. For example, a master services agreement, job description or a business contract. ", "author": "745367422", "created_at": "2018-01-25", "votes": 7, "reaction": [], "comments": []}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/32540221-convert-business-center-to-a-sharepoint-site", "header": "Convert Business Center to a SharePoint Site", "idea_text": "Business Center would be more powerful and flexible if it were a SharePoint site/application. The user would have all the available integration capabilities in SharePoint and Office 365 instead of the fairly closed environment that currently exists.  This includes being able to use Power BI Desktop, Access etc.", "author": "722405248", "created_at": "2017-12-06", "votes": 9, "reaction": [{"status": "tell us more", "author": "398985916", "created_at": "2018-01-17", "note": "What other SharePoint integrations besides Power BI and Access would you like to see in Business center?"}], "comments": [{"author": "839772367", "created_at": "2018-08-22", "text": "Agree that there should be at least some integration between BC and Sharepoint or O365. Instead it just seems to be an isolated feature. #1 I would like to see the ability to create a Flow that allows creation of Contact or add to a Mailing List in BC based on MS Forms responses. (opt in = yes)"}, {"author": "722405248", "created_at": "2018-01-19", "text": "One more comment.  I think many of the suggestions here could be easily handled if Business Center was integrated with SharePoint or was a site (template)."}, {"author": "722405248", "created_at": "2018-01-19", "text": "As you know SharePoint offers a great team environment. Small business, which seem to be the Business Center targets, need to operate efficiently as a team because of resource limitations.  SharePoint List, Document Libraries, Tasks etc. are great tools for this. I think it would be great to have Business Center as a SharePoint site so you can have Customers, Project, Employee information integrated with Business Center.  See my blog  for further ideas on how the integration would help small businesses. "}]}
{"url": "https://office365.uservoice.com/forums/600793-office-365-business-center/suggestions/37501693-change-free-in-calendar", "header": "Change ‘Free’ in Calendar", "idea_text": "When planning an appointment there are 5 options: Free, Working elsewhere, Tentative, Busy and Out of Office. \nIs it possible that you change the option 'Free' into 'Available'??? ‘Free’ is very confusing. ", "author": "897507838", "created_at": "2019-04-29", "votes": 10, "reaction": [], "comments": [{"author": "899334304", "created_at": "2019-05-08", "text": "What a wonderful idea!"}, {"author": "899162980", "created_at": "2019-05-07", "text": "Free is very confusing indeed! Please change this into available. This would help secretaries a lot. Greetz, Daniëlle"}, {"author": "899126275", "created_at": "2019-05-07", "text": "I agree!"}, {"author": "898218517", "created_at": "2019-05-01", "text": "Free is confusing! The person is not free as in a day off work but has no meetings...\nPlease change this in available!"}, {"author": "897852187", "created_at": "2019-04-30", "text": "I agree to Lorette. Good idea! "}, {"author": "897824644", "created_at": "2019-04-30", "text": "The term \"free\" in a meeting notice in the calendar is confusing and suggest that the person is not present when someone views the calendar \"underwater\" for possibilities to schedule an appointment. Maybe it's enough to not show the term \"free\" for the \"underwater\" viewers. "}]}
